# guideline_data.py

data = {
    "小学部": {
        "視覚障害者、聴覚障害者、肢体不自由者又は病弱者": {
            "全体": """各教科の目標，各学年の目標及び内容並びに指導計画の作成と内容の取扱いについては，小学校学習指導要領第２章に示すものに準ずるものとする。
指導計画の作成と各学年にわたる内容の取扱いに当たっては，児童の障害の状態や特性及び心身の発達の段階等を十分考慮するとともに，特に次の事項に配慮するものとする。""",
            "視覚障害者": """（１）　児童が聴覚，触覚及び保有する視覚などを十分に活用して，具体的な事物・事象や動作と言葉とを結び付けて，的確な概念の形成を図り，言葉を正しく理解し活用できるようにすること。
（２）　児童の視覚障害の状態等に応じて，点字又は普通の文字の読み書きを系統的に指導し，習熟させること。なお，点字を常用して学習する児童に対しても，漢字・漢語の理解を促すため，児童の発達の段階等に応じて適切な指導が行われるようにすること。
（３）　児童の視覚障害の状態等に応じて，指導内容を適切に精選し，基礎的・基本的な事項から着実に習得できるよう指導すること。
（４）　視覚補助具やコンピュータ等の情報機器，触覚教材，拡大教材及び音声教材等各種教材の効果的な活用を通して，児童が容易に情報を収集・整理し，主体的な学習ができるようにするなど，児童の視覚障害の状態等を考慮した指導方法を工夫すること。
（５）　児童が場の状況や活動の過程等を的確に把握できるよう配慮することで，空間や時間の概念を養い，見通しをもって意欲的な学習活動を展開できるようにすること。""",
            "聴覚障害者": """（１）　体験的な活動を通して，学習の基盤となる語句などについて的確な言語概念の形成を図り，児童の発達に応じた思考力の育成に努めること。
（２）　児童の言語発達の程度に応じて，主体的に読書に親しんだり，書いて表現したりする態度を養うよう工夫すること。
（３）　児童の聴覚障害の状態等に応じて，音声，文字，手話，指文字等を適切に活用して，発表や児童同士の話し合いなどの学習活動を積極的に取り入れ，的確な意思の相互伝達が行われるよう指導方法を工夫すること。
（４）　児童の聴覚障害の状態等に応じて，補聴器や人工内耳等の利用により，児童の保有する聴覚を最大限に活用し，効果的な学習活動が展開できるようにすること。
（５）　児童の言語概念や読み書きの力などに応じて，指導内容を適切に精選し，基礎的・基本的な事項に重点を置くなど指導を工夫すること。
（６）　視覚的に情報を獲得しやすい教材・教具やその活用方法等を工夫するとともに，コンピュータ等の情報機器などを有効に活用し，指導の効果を高めるようにすること。""",
            "肢体不自由者": """（１）　体験的な活動を通して言語概念等の形成を的確に図り，児童の障害の状態や発達の段階に応じた思考力，判断力，表現力等の育成に努めること。
（２）　児童の身体の動きの状態や認知の特性，各教科の内容の習得状況等を考慮して，指導内容を適切に設定し，重点を置く事項に時間を多く配当するなど計画的に指導すること。
（３）　児童の学習時の姿勢や認知の特性等に応じて，指導方法を工夫すること。
（４）　児童の身体の動きや意思の表出の状態等に応じて，適切な補助具や補助的手段を工夫するとともに，コンピュータ等の情報機器などを有効に活用し，指導の効果を高めるようにすること。
（５）　各教科の指導に当たっては，特に自立活動の時間における指導との密接な関連を保ち，学習効果を一層高めるようにすること。""",
            "病弱者": """（１）　個々の児童の学習状況や病気の状態，授業時数の制約等に応じて，指導内容を適切に精選し，基礎的・基本的な事項に重点を置くとともに，指導内容の連続性に配慮した工夫を行ったり，各教科等相互の関連を図ったりして，効果的な学習活動が展開できるようにすること。
（２）　健康状態の維持や管理，改善に関する内容の指導に当たっては，自己理解を深めながら学びに向かう力を高めるために，自立活動における指導との密接な関連を保ち，学習効果を一層高めるようにすること。
（３）　体験的な活動を伴う内容の指導に当たっては，児童の病気の状態や学習環境に応じて，間接体験や疑似体験，仮想体験等を取り入れるなど，指導方法を工夫し，効果的な学習活動が展開できるようにすること。
（４）　児童の身体活動の制限や認知の特性，学習環境等に応じて，教材・教具や入力支援機器等の補助用具を工夫するとともに，コンピュータ等の情報機器などを有効に活用し，指導の効果を高めるようにすること。
（５）　児童の病気の状態等を考慮し，学習活動が負担過重となる又は必要以上に制限することがないようにすること。
（６）　病気のため，姿勢の保持や長時間の学習活動が困難な児童については，姿勢の変換や適切な休養の確保などに留意すること。"""
        },
        "知的障害者": {
            "生活": {
                "目標": """具体的な活動や体験を通して，生活に関わる見方・考え方を生かし，自立し生活を豊かにしていくための資質・能力を次のとおり育成することを目指す。
（１）　活動や体験の過程において，自分自身，身近な人々，社会及び自然の特徴やよさ，それらの関わり等に気付くとともに，生活に必要な習慣や技能を身に付けるようにする。
（２）　自分自身や身の回りの生活のことや，身近な人々，社会及び自然と自分との関わりについて理解し，考えたことを表現することができるようにする。
（３）　自分のことに取り組んだり，身近な人々，社会及び自然に自ら働きかけ，意欲や自信をもって学んだり，生活を豊かにしようとしたりする態度を養う。""",
                "１段階": {
                    "目標": """ア　活動や体験の過程において，自分自身，身近な人々，社会及び自然の特徴に関心をもつとともに，身の回りの生活において必要な基本的な習慣や技能を身に付けるようにする。
イ　自分自身や身の回りの生活のことや，身近な人々，社会及び自然と自分との関わりについて関心をもち，感じたことを伝えようとする。
ウ　自分のことに取り組もうとしたり，身近な人々，社会及び自然に関心をもち，意欲をもって学んだり，生活に生かそうとしたりする態度を養う。""",
                    "内容": """ア　基本的生活習慣
　　　　食事や用便等の生活習慣に関わる初歩的な学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　簡単な身辺処理に気付き，教師と一緒に行おうとすること。
　　　（イ）　簡単な身辺処理に関する初歩的な知識や技能を身に付けること。
イ　安全
　　　　危ないことや危険な場所等における安全に関わる初歩的な学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの安全に気付き，教師と一緒に安全な生活に取り組もうとすること。
　　　（イ）　安全に関わる初歩的な知識や技能を身に付けること。
ウ　日課・予定
　　　　日課に沿って教師と共にする学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの簡単な日課に気付き，教師と一緒に日課に沿って行動しようとすること。
　　　（イ）　簡単な日課について，関心をもつこと。
エ　遊び
　　　　自分で好きな遊びをすることなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの遊びに気付き，教師や友達と同じ場所で遊ぼうとすること。
　　　（イ）　身の回りの遊びや遊び方について関心をもつこと。
オ　人との関わり
　　　　小さな集団での学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　教師や身の回りの人に気付き，教師と一緒に簡単な挨拶などをしようとすること。
　　　（イ）　身の回りの人との関わり方に関心をもつこと。
カ　役割
　　　　学級等の集団における役割などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの集団に気付き，教師と一緒に参加しようとすること。
　　　（イ）　集団の中での役割に関心をもつこと。
キ　手伝い・仕事
　　　　教師と一緒に印刷物を配ることや身の回りの簡単な手伝いなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの簡単な手伝いや仕事を教師と一緒にしようとすること。
　　　（イ）　簡単な手伝いや仕事に関心をもつこと。
ク　金銭の扱い
　　　　簡単な買い物や金銭を大切に扱うことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの生活の中で，教師と一緒に金銭を扱おうとすること。
　　　（イ）　金銭の扱い方などに関心をもつこと。
ケ　きまり
　　　　学校生活の簡単なきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りの簡単なきまりに従って教師と一緒に行動しようとすること。
　　　（イ）　簡単なきまりについて関心をもつこと。
コ　社会の仕組みと公共施設
　　　　自分の家族や近隣に関心をもつこと及び公園等の公共施設に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りにある社会の仕組みや公共施設に気付き，それを教師と一緒にみんなに伝えようとすること。
　　　（イ）　身の回りの社会の仕組みや公共施設の使い方などについて関心をもつこと。
サ　生命・自然
　　　　教師と一緒に公園や野山などの自然に触れることや生き物に興味や関心をもつことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りにある生命や自然に気付き，それを教師と一緒にみんなに伝えようとすること。
　　　（イ）　身の回りの生命や自然について関心をもつこと。
シ　ものの仕組みと働き
　　　　身の回りの生活の中で，物の重さに気付くことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身の回りにあるものの仕組みや働きに気付き，それを教師と一緒にみんなに伝えようとすること。
　　　（イ）　身の回りにあるものの仕組みや働きについて関心をもつこと。"""
                },
                "２段階": {
                    "目標": """ア　活動や体験の過程において，自分自身，身近な人々，社会及び自然の特徴や変化に気付くとともに，身近な生活において必要な習慣や技能を身に付けるようにする。
イ　自分自身や身の回りの生活のことや，身近な人々，社会及び自然と自分との関わりについて気付き，感じたことを表現しようとする。
ウ　自分のことに取り組もうとしたり，身近な人々，社会及び自然に自ら働きかけようとしたり，意欲や自信をもって学んだり，生活に生かそうとしたりする態度を養う。""",
                    "内容": """ア　基本的生活習慣
　　　　食事，用便，清潔等の基本的生活習慣に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　必要な身辺処理が分かり，身近な生活に役立てようとすること。
　　　（イ）　身近な生活に必要な身辺処理に関する基礎的な知識や技能を身に付けること。
イ　安全
　　　　遊具や器具の使い方，避難訓練等の基本的な安全や防災に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な生活の安全に関心をもち，教師の援助を求めながら，安全な生活に取り組もうとすること。
　　　（イ）　安全や防災に関わる基礎的な知識や技能を身に付けること。
ウ　日課・予定
　　　　絵や写真カードなどを手掛かりにして，見通しをもち主体的に取り組むことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な日課・予定が分かり，教師の援助を求めながら，日課に沿って行動しようとすること。
　　　（イ）　身近な日課・予定について知ること。
エ　遊び
　　　　教師や友達と簡単な遊びをすることなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な遊びの中で，教師や友達と簡単なきまりのある遊びをしたり，遊びを工夫しようとしたりすること。
　　　（イ）　簡単なきまりのある遊びについて知ること。
オ　人との関わり
　　　　身近な人と接することなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な人を知り，教師の援助を求めながら挨拶や話などをしようとすること。
　　　（イ）　身近な人との接し方などについて知ること。
カ　役割
　　　　学級や学年，異年齢の集団等における役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な集団活動に参加し，簡単な係活動をしようとすること。
　　　（イ）　簡単な係活動などの役割について知ること。
キ　手伝い・仕事
　　　　人の役に立つことのできる手伝いや仕事に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　教師の援助を求めながら身近で簡単な手伝いや仕事をしようとすること。
　　　（イ）　簡単な手伝いや仕事について知ること。
ク　金銭の扱い
　　　　金銭の価値に気付くことや金銭を扱うことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な生活の中で，教師に援助を求めながら買い物をし，金銭の大切さや必要性について気付くこと。
　　　（イ）　金銭の扱い方などを知ること。
ケ　きまり
　　　　順番を守ることや信号を守って横断することなど，簡単なきまりやマナーに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近で簡単なきまりやマナーに気付き，それらを守って行動しようとすること。
　　　（イ）　簡単なきまりやマナーについて知ること。
コ　社会の仕組みと公共施設
　　　　自分の住む地域のことや図書館や児童館等の公共施設に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　教師の援助を求めながら身近な社会の仕組みや公共施設に気付き，それらを表現しようとすること。
　　　（イ）　身近な社会の仕組みや公共施設の使い方などを知ること。
サ　生命・自然
　　　　小動物等を飼育し生き物への興味・関心をもつことや天候の変化，季節の特徴に関心をもつことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な生命や自然の特徴や変化が分かり，それらを表現しようとすること。
　　　（イ）　身近な生命や自然について知ること。
シ　ものの仕組みと働き
　　　　身近な生活の中で，ものの仕組みなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近にあるものの仕組みや働きが分かり，それらを表現しようとすること。
　　　（イ）　身近にあるものの仕組みや働きについて知ること。"""
                },
                "３段階": {
                    "目標": """ア　活動や体験の過程において，自分自身，身近な人々，社会及び自然の特徴やよさ，それらの関わりに気付くとともに，生活に必要な習慣や技能を身に付けるようにする。
イ　自分自身や身の回りの生活のことや，身近な人々，社会及び自然と自分との関わりについて理解し，考えたことを表現することができるようにする。
ウ　自分のことに取り組んだり，身近な人々，社会及び自然に自ら働きかけ，意欲や自信をもって学んだり，生活を豊かにしようとしたりする態度を養う。""",
                    "内容": """ア　基本的生活習慣
　　　　身の回りの整理や身なりなどの基本的生活習慣や日常生活に役立つことに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　必要な身辺処理や集団での基本的生活習慣が分かり，日常生活に役立てようとすること。
　　　（イ）　日常生活に必要な身辺処理等に関する知識や技能を身に付けること。
イ　安全
　　　　交通安全や避難訓練等の安全や防災に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の安全や防災に関心をもち，安全な生活をするよう心がけること。
　　　（イ）　安全や防災に関わる知識や技能を身に付けること。
ウ　日課・予定
　　　　一週間程度の予定，学校行事や家庭の予定などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の日課・予定が分かり，およその予定を考えながら，見通しをもって行動しようとすること。
　　　（イ）　日課や身近な予定を立てるために必要な知識や技能を身に付けること。
エ　遊び
　　　　日常生活の中での遊びに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の遊びで，友達と関わりをもち，きまりを守ったり，遊びを工夫し発展させたりして，仲良く遊ぼうとすること。
　　　（イ）　きまりのある遊びや友達と仲良く遊ぶことなどの知識や技能を身に付けること。
オ　人との関わり
　　　　身近なことを教師や友達と話すことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　身近な人と自分との関わりが分かり，一人で簡単な応対などをしようとすること。
　　　（イ）　身近な人との簡単な応対などをするための知識や技能を身に付けること。
カ　役割
　　　　様々な集団や地域での役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　様々な集団活動に進んで参加し，簡単な役割を果たそうとすること。
　　　（イ）　集団の中での簡単な役割を果たすための知識や技能を身に付けること。
キ　手伝い・仕事
　　　　自分から調理や製作などの様々な手伝いをすることや学級の備品等の整理などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の手伝いや仕事を進んでしようとすること。
　　　（イ）　手伝いや仕事をするための知識や技能を身に付けること。
ク　金銭の扱い
　　　　価格に応じて必要な貨幣を組み合わせるなどの金銭に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の中で，金銭の価値が分かり扱いに慣れること。
　　　（イ）　金銭の扱い方などの知識や技能を身に付けること。
ケ　きまり
　　　　学校のきまりや公共の場でのマナー等に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の簡単なきまりやマナーが分かり，それらを守って行動しようとすること。
　　　（イ）　簡単なきまりやマナーに関する知識や技能を身に付けること。
コ　社会の仕組みと公共施設
　　　　自分の地域や周辺の地理などの社会の様子，警察署や消防署などの公共施設に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活に関わりのある社会の仕組みや公共施設が分かり，それらを表現すること。
　　　（イ）　日常生活に関わりのある社会の仕組みや公共施設などを知ったり，活用したりすること。
サ　生命・自然
　　　　身近にいる昆虫，魚，小鳥の飼育や草花などの栽培及び四季の変化や天体の動きなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活に関わりのある生命や自然の特徴や変化が分かり，それらを表現すること。
　　　（イ）　日常生活に関わりのある生命や自然について関心をもって調べること。
シ　ものの仕組みと働き
　　　　日常生活の中で，ものの仕組みなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　　　（ア）　日常生活の中で，ものの仕組みや働きが分かり，それらを表現すること。
　　　（イ）　ものの仕組みや働きに関して関心をもって調べること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　年間や，単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，児童が具体的な場面で実際的な活動を通して，自分と身近な社会や自然との関わりについての関心を深められるようにすること。
イ　各教科等との関連を図り，指導の効果を高めるようにするとともに，中学部の社会科，理科及び職業・家庭科の学習を見据え，系統的・発展的に指導できるようにすること。
ウ　２の各段階の内容のサについては，動物や植物への関わり方が深まるよう継続的な飼育，栽培を行うなど工夫すること。
エ　入学当初においては，幼児期における遊びを通した総合的な学びから他教科等における学習に円滑に移行し，主体的に自己を発揮しながら，より自覚的な学びに向かうことが可能となるようにすること。
オ　自分自身の生活や成長を振り返る活動を通して，自分でできるようになったこと，役割が増えたことなどが分かるとともに，これまでの生活や成長を支えてくれた人々への感謝の気持ちと，これからの意欲的な取り組みにより，更に成長できるようにすること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　具体的な活動や体験を行うに当たっては，日々の日課に即して，実際的な指導ができるようにすること。
イ　身近な人々，社会及び自然に関する活動の楽しさを味わうとともに，それらを通して気付いたことや楽しかったことなどについて，多様な方法により表現し，考えることができるようにすること。
ウ　具体的な活動や体験を通して気付いたことを基に考えることができるようにするため，見付ける，比べる，たとえる，試す，見通す，工夫するなどの多様な学習活動を行うようにすること。
エ　２の各段階の内容のクは，算数科との関連を図りながら，実際的な指導ができるようにすること。
オ　具体的な活動や体験を行うに当たっては，身近な幼児，高齢者など多様な人々と触れ合うことができるようにすること。"""
            },
            "国語": {
                "目標": """言葉による見方・考え方を働かせ，言語活動を通して，国語で理解し表現する資質・能力を次のとおり育成することを目指す。
（１）　日常生活に必要な国語について，その特質を理解し使うことができるようにする。
（２）　日常生活における人との関わりの中で伝え合う力を身に付け，思考力や想像力を養う。
（３）　言葉で伝え合うよさを感じるとともに，言語感覚を養い，国語を大切にしてその能力の向上を図る態度を養う。""",
                "１段階": {
                    "目標": """ア　日常生活に必要な身近な言葉が分かり使うようになるとともに，いろいろな言葉や我が国の言語文化に触れることができるようにする。
イ　言葉をイメージしたり，言葉による関わりを受け止めたりする力を養い，日常生活における人との関わりの中で伝え合い，自分の思いをもつことができるようにする。
ウ　言葉で表すことやそのよさを感じるとともに，言葉を使おうとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア　言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）　身近な人の話し掛けに慣れ，言葉が事物の内容を表していることを感じること。
（イ）　言葉のもつ音やリズムに触れたり，言葉が表す事物やイメージに触れたりすること。
イ　我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）　昔話などについて，読み聞かせを聞くなどして親しむこと。
（イ）　遊びを通して，言葉のもつ楽しさに触れること。
（ウ）　書くことに関する次の事項を理解し使うこと。
　　　㋐　いろいろな筆記具に触れ，書くことを知ること。
　　　㋑　筆記具の持ち方や，正しい姿勢で書くことを知ること。
（エ）　読み聞かせに注目し，いろいろな絵本などに興味をもつこと。
〔思考力，判断力，表現力等〕
Ａ　聞くこと・話すこと
　　聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア　教師の話や読み聞かせに応じ，音声を模倣したり，表情や身振り，簡単な話し言葉などで表現したりすること。
イ　身近な人からの話し掛けに注目したり，応じて答えたりすること。
ウ　伝えたいことを思い浮かべ，身振りや音声などで表すこと。
Ｂ　書くこと
　　書くことに関する次の事項を身に付けることができるよう指導する。
ア　身近な人との関わりや出来事について，伝えたいことを思い浮かべたり，選んだりすること。
イ　文字に興味をもち，書こうとすること。
Ｃ　読むこと
　　読むことに関する次の事項を身に付けることができるよう指導する。
ア　教師と一緒に絵本などを見て，示された身近な事物や生き物などに気付き，注目すること。
イ　絵本などを見て，知っている事物や出来事などを指さしなどで表現すること。
ウ　絵や矢印などの記号で表された意味に応じ，行動すること。
エ　絵本などを見て，次の場面を楽しみにしたり，登場人物の動きなどを模倣したりすること。"""
                },
                "２段階": {
                    "目標": """ア　日常生活に必要な身近な言葉を身に付けるとともに，いろいろな言葉や我が国の言語文化に触れることができるようにする。
イ　言葉が表す事柄を想起したり受け止めたりする力を養い，日常生活における人との関わりの中で伝え合い，自分の思いをもつことができるようにする。
ウ　言葉がもつよさを感じるとともに，読み聞かせに親しみ，言葉でのやり取りを聞いたり伝えたりしようとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア　言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）　身近な人の話し掛けや会話などの話し言葉に慣れ，言葉が，気持ちや要求を表していることを感じること。
（イ）　日常生活でよく使われている平仮名を読むこと。
（ウ）　身近な人との会話を通して，物の名前や動作など，いろいろな言葉の種類に触れること。
イ　我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）　昔話や童謡の歌詞などの読み聞かせを聞いたり，言葉などを模倣したりするなどして，言葉の響きやリズムに親しむこと。
（イ）　遊びややり取りを通して，言葉による表現に親しむこと。
（ウ）　書くことに関する次の事項を理解し使うこと。
　　　㋐　いろいろな筆記具を用いて，書くことに親しむこと。
　　　㋑　写し書きやなぞり書きなどにより，筆記具の正しい持ち方や書くときの正しい姿勢など，書写の基本を身に付けること。
（エ）　読み聞かせに親しんだり，文字を拾い読みしたりして，いろいろな絵本や図鑑などに興味をもつこと。
〔思考力，判断力，表現力等〕
Ａ　聞くこと・話すこと
　　聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア　身近な人の話に慣れ，簡単な事柄と語句などを結び付けたり，語句などから事柄を思い浮かべたりすること。
イ　簡単な指示や説明を聞き，その指示等に応じた行動をすること。
ウ　体験したことなどについて，伝えたいことを考えること。
エ　挨拶をしたり，簡単な台詞（せりふ）などを表現したりすること。
Ｂ　書くこと
　　書くことに関する次の事項を身に付けることができるよう指導する。
ア　経験したことのうち身近なことについて，写真などを手掛かりにして，伝えたいことを思い浮かべたり，選んだりすること。
イ　自分の名前や物の名前を文字で表すことができることを知り，簡単な平仮名をなぞったり，書いたりすること。
Ｃ　読むこと
　　読むことに関する次の事項を身に付けることができるよう指導する。
ア　教師と一緒に絵本などを見て，登場するものや動作などを思い浮かべること。
イ　教師と一緒に絵本などを見て，時間の経過などの大体を捉えること。
ウ　日常生活でよく使われている表示などの特徴に気付き，読もうとしたり，表された意味に応じた行動をしたりすること。
エ　絵本などを見て，好きな場面を伝えたり，言葉などを模倣したりすること。"""
                },
                "３段階": {
                    "目標": """ア　日常生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に触れ，親しむことができるようにする。
イ　出来事の順序を思い出す力や感じたり想像したりする力を養い，日常生活における人との関わりの中で伝え合う力を身に付け，思い付いたり考えたりすることができるようにする。
ウ　言葉がもつよさを感じるとともに，図書に親しみ，思いや考えを伝えたり受け止めたりしようとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア　言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）　身近な人との会話や読み聞かせを通して，言葉には物事の内容を表す働きがあることに気付くこと。
（イ）　姿勢や口形に気を付けて話すこと。
（ウ）　日常生活でよく使う促音，長音などが含まれた語句，平仮名，片仮名，漢字の正しい読み方を知ること。
（エ）　言葉には，意味による語句のまとまりがあることに気付くこと。
（オ）　文の中における主語と述語との関係や助詞の使い方により，意味が変わることを知ること。
（カ）　正しい姿勢で音読すること。
イ　話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）　物事の始めと終わりなど，情報と情報との関係について理解すること。
（イ）　図書を用いた調べ方を理解し使うこと。
ウ　我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）　昔話や神話・伝承などの読み聞かせを聞き，言葉の響きやリズムに親しむこと。
（イ）　出来事や経験したことを伝え合う体験を通して，いろいろな語句や文の表現に触れること。
（ウ）　書くことに関する次の事項を理解し使うこと。
　　　㋐　目的に合った筆記具を選び，書くこと。
　　　㋑　姿勢や筆記具の持ち方を正しくし，平仮名や片仮名の文字の形に注意しながら丁寧に書くこと。
（エ）　読み聞かせなどに親しみ，いろいろな絵本や図鑑があることを知ること。
〔思考力，判断力，表現力等〕
Ａ　聞くこと・話すこと
　　聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア　絵本の読み聞かせなどを通して，出来事など話の大体を聞き取ること。
イ　経験したことを思い浮かべ，伝えたいことを考えること。
ウ　見聞きしたことなどのあらましや自分の気持ちなどについて思い付いたり，考えたりすること。
エ　挨拶や電話の受け答えなど，決まった言い方を使うこと。
オ　相手に伝わるよう，発音や声の大きさに気を付けること。
カ　相手の話に関心をもち，自分の思いや考えを相手に伝えたり，相手の思いや考えを受け止めたりすること。
Ｂ　書くこと
　　書くことに関する次の事項を身に付けることができるよう指導する。
ア　身近で見聞きしたり，経験したりしたことについて書きたいことを見付け，その題材に必要な事柄を集めること。
イ　見聞きしたり，経験したりしたことから，伝えたい事柄の順序を考えること。
ウ　見聞きしたり，経験したりしたことについて，簡単な語句や短い文を書くこと。
エ　書いた語句や文を読み，間違いを正すこと。
オ　文などに対して感じたことを伝えること。
Ｃ　読むこと
　　読むことに関する次の事項を身に付けることができるよう指導する。
ア　絵本や易しい読み物などを読み，挿絵と結び付けて登場人物の行動や場面の様子などを想像すること。
イ　絵本や易しい読み物などを読み，時間的な順序など内容の大体を捉えること。
ウ　日常生活で必要な語句や文，看板などを読み，必要な物を選んだり行動したりすること。
エ　登場人物になったつもりで，音読したり演じたりすること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，言葉による見方・考え方を働かせ，言語活動を通して，言葉の特徴や使い方などを身に付け自分の思いや考えを深める学習の充実を図ること。
イ　２の各段階の内容の〔知識及び技能〕に示す事項については，〔思考力，判断力，表現力等〕に示す事項の指導を通して指導することを基本とすること。
ウ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ａ聞くこと・話すこと」に関する指導に配当する授業時数は，児童の言語発達の状態を考慮し，適切に定めること。また，音声言語のための教材を積極的に活用するなどして，指導の効果を高めるよう工夫すること。
エ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｂ書くこと」に関する指導に配当する授業時数は，児童の運動の能力や手先の器用さなどを考慮し，適切に定めること。また，書き表す内容や方法については，個に応じて適切に選択すること。
オ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｃ読むこと」に関する指導に配当する授業時数は，児童の言語発達の状態を考慮し，適切に定めること。また，身近な題材を中心に段階的に様々な題材や文章に触れる機会を設けること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　２の各段階の内容のうち，文字に関する事項については，次のとおり取り扱うこと。
（ア）　平仮名及び片仮名を読み，書くとともに，片仮名で書く語の種類を知り，文や文章の中で使うことができるよう指導を工夫すること。
（イ）　日常生活や他教科等で必要な漢字を読み，文や文章の中で使うなど，適切に指導内容を設定し，指導すること。
（ウ）　平仮名，片仮名の読み書きが身に付き，字形を取ることができるなどの児童の学習状況に応じて，ローマ字を取り扱うこともできること。
イ　２の内容の指導に当たっては，学校図書館などを目的をもって計画的に利用し，児童が図書に親しむことができるよう配慮すること。
ウ　教材については，次の事項に留意すること。
（ア）　児童の障害の状態や特性及び心身の発達の段階等に応じ，興味・関心のある題材や生活に関連する身近な題材を中心に扱いながら，徐々に様々な種類や形式の文，文章に触れる機会を設けること。その際，児童が自分の考えや気持ちを伝える活動を重視すること。
（イ）　読み物教材は，場面の切り替えや筋の移り変わりが捉えやすい題材を選ぶようにすること。"""
            },
            "算数": {
                "目標": """数学的な見方・考え方を働かせ，数学的活動を通して，数学的に考える資質・能力を次のとおり育成することを目指す。
（１）　数量や図形などについての基礎的・基本的な概念や性質などに気付き理解するとともに，日常の事象を数量や図形に注目して処理する技能を身に付けるようにする。
（２）　日常の事象の中から数量や図形を直感的に捉える力，基礎的・基本的な数量や図形の性質などに気付き感じ取る力，数学的な表現を用いて事象を簡潔・明瞭・的確に表したり柔軟に表したりする力を養う。
（３）　数学的活動の楽しさに気付き，関心や興味をもち，学習したことを結び付けてよりよく問題を解決しようとする態度，算数で学んだことを学習や生活に活用しようとする態度を養う。""",
                "１段階": {
                    "目標": """Ａ　数量の基礎
ア　身の回りのものに気付き，対応させたり，組み合わせたりすることなどについての技能を身に付けるようにする。
イ　身の回りにあるもの同士を対応させたり，組み合わせたりするなど，数量に関心をもって関わる力を養う。
ウ　数量や図形に気付き，算数の学習に関心をもって取り組もうとする態度を養う。
Ｂ　数と計算
ア　ものの有無や３までの数的要素に気付き，身の回りのものの数に関心をもって関わることについての技能を身に付けるようにする。
イ　身の回りのものの有無や数的要素に注目し，数を直感的に捉えたり，数を用いて表現したりする力を養う。
ウ　数量に気付き，算数の学習に関心をもって取り組もうとする態度を養う。
Ｃ　図形
ア　身の回りのものの上下や前後，形の違いに気付き，違いに応じて関わることについての技能を身に付けるようにする。
イ　身の回りのものの形に注目し，同じ形を捉えたり，形の違いを捉えたりする力を養う。
ウ　図形に気付き，算数の学習に関心をもって取り組もうとする態度を養う。
Ｄ　測定
ア　身の回りにあるものの量の大きさに気付き，量の違いについての感覚を養うとともに，量に関わることについての技能を身に付けるようにする。
イ　身の回りにあるものの大きさや長さなどの量の違いに注目し，量の大きさにより区別する力を養う。
ウ　数量や図形に気付き，算数の学習に関心をもって取り組もうとする態度を養う。""",
                    "内容": """Ａ　数量の基礎
ア　具体物に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　具体物に気付いて指を差したり，つかもうとしたり，目で追ったりすること。
　　㋑　目の前で隠されたものを探したり，身近にあるものや人の名を聞いて指を差したりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　対象物に注意を向け，対象物の存在に注目し，諸感覚を協応させながら捉えること。
イ　ものとものとを対応させることに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものとものとを対応させて配ること。
　　㋑　分割した絵カードを組み合わせること。
　　㋒　関連の深い絵カードを組み合わせること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　ものとものとを関連付けることに注意を向け，ものの属性に注目し，仲間であることを判断したり，表現したりすること。
Ｂ　数と計算
ア　数えることの基礎に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものの有無に気付くこと。
　　㋑　目の前のものを，１個，２個，たくさんで表すこと。
　　㋒　５までの範囲で数唱をすること。
　　㋓　３までの範囲で具体物を取ること。
　　㋔　対応させてものを配ること。
　　㋕　形や色，位置が変わっても，数は変わらないことについて気付くこと。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　数詞とものとの関係に注目し，数のまとまりや数え方に気付き，それらを学習や生活で生かすこと。
Ｃ　図形
ア　ものの類別や分類・整理に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐ 　具体物に注目して指を差したり，つかもうとしたり，目で追ったりすること。
　　㋑　形を観点に区別すること。
　　㋒　形が同じものを選ぶこと。
　　㋓　似ている二つのものを結び付けること。
　　㋔　関連の深い一対のものや絵カードを組み合わせること。
　　㋕　同じもの同士の集合づくりをすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　対象物に注意を向け，対象物の存在に気付き，諸感覚を協応させながら具体物を捉えること。
　　㋑　ものの属性に着目し，様々な情報から同質なものや類似したものに気付き，日常生活の中で関心をもつこと。
　　㋒　ものとものとの関係に注意を向け，ものの属性に気付き，関心をもって対応しながら，表現する仕方を見つけ出し，日常生活で生かすこと。
Ｄ　測定
ア　身の回りにある具体物のもつ大きさに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　大きさや長さなどを，基準に対して同じか違うかによって区別すること。
　　㋑　ある・ない，大きい・小さい，多い・少ない，などの用語に注目して表現すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　大小や多少等で区別することに関心をもち，量の大きさを表す用語に注目して表現すること。
〔数学的活動〕
ア　内容の「Ａ数量の基礎」，「Ｂ数と計算」，「Ｃ図形」及び「Ｄ測定」に示す学習については，次のような数学的活動に取り組むものとする。
（ア）　身の回りの事象を観察したり，具体物を操作したりして，数量や形に関わる活動
（イ）　日常生活の問題を取り上げたり算数の問題を具体物などを用いて解決したりして，結果を確かめる活動"""
                },
                "２段階": {
                    "目標": """Ａ　数と計算
ア　10までの数の概念や表し方について分かり，数についての感覚をもつとともに，ものと数との関係に関心をもって関わることについての技能を身に付けるようにする。
イ　日常生活の事象について，ものの数に着目し，具体物や図などを用いながら数の数え方を考え，表現する力を養う。
ウ　数量に関心をもち，算数で学んだことの楽しさやよさを感じながら興味をもって学ぶ態度を養う。
Ｂ　図形
ア　身の回りのものの形に着目し，集めたり，分類したりすることを通して，図形の違いが分かるようにするための技能を身に付けるようにする。
イ　身の回りのものの形に関心をもち，分類したり，集めたりして，形の性質に気付く力を養う。
ウ　図形に関心をもち，算数で学んだことの楽しさやよさを感じながら興味をもって学ぶ態度を養う。
Ｃ　測定
ア　身の回りにある具体物の量の大きさに注目し，量の大きさの違いが分かるとともに，二つの量の大きさを比べることについての技能を身に付けるようにする。
イ　量に着目し，二つの量を比べる方法が分かり，一方を基準にして他方と比べる力を養う。
ウ　数量や図形に関心をもち，算数で学んだことの楽しさやよさを感じながら興味をもって学ぶ態度を養う。
Ｄ　データの活用
ア　身の回りのものや身近な出来事のつながりに関心をもち，それを簡単な絵や記号などを用いた表やグラフで表したり，読み取ったりする方法についての技能を身に付けるようにする。
イ　身の回りのものや身近な出来事のつながりなどの共通の要素に着目し，簡単な表やグラフで表現する力を養う。
ウ　数量や図形に関心をもち，算数で学んだことの楽しさやよさを感じながら興味をもって学ぶ態度を養う。""",
                    "内容": """Ａ　数と計算
ア　10までの数の数え方や表し方，構成に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものとものとを対応させることによって，ものの個数を比べ，同等・多少が分かること。
　　㋑　ものの集まりと対応して，数詞が分かること。
　　㋒　ものの集まりや数詞と対応して数字が分かること。
　　㋓　個数を正しく数えたり書き表したりすること。
　　㋔　二つの数を比べて数の大小が分かること。
　　㋕　数の系列が分かり，順序や位置を表すのに数を用いること。
　　㋖　０の意味について分かること。
　　㋗　一つの数を二つの数に分けたり，二つの数を一つの数にまとめたりして表すこと。
　　㋘　具体的な事物を加えたり，減らしたりしながら，集合数を一つの数と他の数と関係付けてみること。
　　㋙　10の補数が分かること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　数詞と数字，ものとの関係に着目し，数の数え方や数の大きさの比べ方，表し方について考え，それらを学習や生活で興味をもって生かすこと。
Ｂ　図形
ア　ものの分類に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　色や形，大きさに着目して分類すること。
　　㋑　身近なものを目的，用途及び機能に着目して分類すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　ものを色や形，大きさ，目的，用途及び機能に着目し，共通点や相違点について考えて，分類する方法を日常生活で生かすこと。
イ　身の回りにあるものの形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　身の回りにあるものの形に関心をもち，丸や三角，四角という名称を知ること。
　　㋑　縦や横の線，十字，△や□をかくこと。
　　㋒　大きさや色など属性の異なるものであっても形の属性に着目して，分類したり，集めたりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身の回りにあるものの形に関心を向け，丸や三角，四角を考えながら分けたり，集めたりすること。
Ｃ　測定
ア　身の回りにある具体物の量の大きさに注目し，二つの量の大きさに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　長さ，重さ，高さ及び広さなどの量の大きさが分かること。
　　㋑　二つの量の大きさについて，一方を基準にして相対的に比べること。
　　㋒　長い・短い，重い・軽い，高い・低い及び広い・狭いなどの用語が分かること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　長さ，重さ，高さ及び広さなどの量を，一方を基準にして比べることに関心をもったり，量の大きさを用語を用いて表現したりすること。
Ｄ　データの活用
ア　ものの分類に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　身近なものを目的，用途，機能に着目して分類すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身近なものの色や形，大きさ，目的及び用途等に関心を向け，共通点や相違点を考えながら，興味をもって分類すること。
イ　同等と多少に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものとものとを対応させることによって，ものの同等や多少が分かること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身の回りにあるものの個数に着目して絵グラフなどに表し，多少を読み取って表現すること。
ウ　○×を用いた表に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　身の回りの出来事から○×を用いた簡単な表を作成すること。
　　㋑　簡単な表で使用する○×の記号の意味が分かること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身の回りの出来事を捉え，○×を用いた簡単な表で表現すること。
〔数学的活動〕
ア　内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ測定」及び「Ｄデータの活用」に示す学習については，次のような数学的活動に取り組むものとする。
（ア）　身の回りの事象を観察したり，具体物を操作したりする活動
（イ）　日常生活の問題を具体物などを用いて解決したり結果を確かめたりする活動
（ウ）　問題解決した過程や結果を，具体物などを用いて表現する活動"""
                },
                "３段階": {
                    "目標": """Ａ　数と計算
ア　100までの数の概念や表し方について理解し，数に対する感覚を豊かにするとともに，加法，減法の意味について理解し，これらの簡単な計算ができるようにすることについての技能を身に付けるようにする。
イ　日常の事象について，ものの数に着目し，具体物や図などを用いながら数の数え方や計算の仕方を考え，表現する力を養う。
ウ　数量の違いを理解し，算数で学んだことのよさや楽しさを感じながら学習や生活に活用しようとする態度を養う。
Ｂ　図形
ア　身の回りのものの形の観察などの活動を通して，図形についての感覚を豊かにするとともに，ものについて，その形の合同，移動，位置，機能及び角の大きさの意味に関わる基礎的な知識を理解することなどについての技能を身に付けるようにする。
イ　身の回りのものの形に着目し，ぴったり重なる形，移動，ものの位置及び機能的な特徴等について具体的に操作をして考える力を養う。
ウ　図形や数量の違いを理解し，算数で学んだことのよさや楽しさを感じながら学習や生活に活用しようとする態度を養う。
Ｃ　測定
ア　身の回りにある長さや体積などの量の単位と測定の意味について理解し，量の大きさについての感覚を豊かにするとともに，測定することなどについての技能を身に付けるようにする。
イ　身の回りにある量の単位に着目し，目的に応じて量を比較したり，量の大小及び相等関係を表現したりする力を養う。
ウ　数量や図形の違いを理解し，算数で学んだことのよさや楽しさを感じながら学習や生活に活用しようとする態度を養う。
Ｄ　データの活用
ア　身の回りにある事象を，簡単な絵や図を用いて整理したり，記号に置き換えて表したりしながら，読み取り方について理解することについての技能を身に付けるようにする。
イ　身の回りの事象を，比較のために簡単な絵や図に置き換えて簡潔に表現したり，データ数を記号で表現したりして，考える力を養う。
ウ　数量や図形の違いを理解し，算数で学んだことのよさや楽しさを感じながら学習や生活に活用しようとする態度を養う。""",
                    "内容": """Ａ　数と計算
ア　100までの整数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　20までの数について，数詞を唱えたり，個数を数えたり書き表したり，数の大小を比べたりすること。
　　㋑　100までの数について，数詞を唱えたり，個数を数えたり書き表したり，数の系列を理解したりすること。
　　㋒　数える対象を２ずつや５ずつのまとまりで数えること。
　　㋓　数を10のまとまりとして数えたり，10のまとまりと端数に分けて数えたり書き表したりすること。
　　㋔　具体物を分配したり等分したりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　数のまとまりに着目し，数の数え方や数の大きさの比べ方，表し方について考え，学習や生活で生かすこと。
イ　整数の加法及び減法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　加法が用いられる合併や増加等の場合について理解すること。
　　㋑　加法が用いられる場面を式に表したり，式を読み取ったりすること。
　　㋒　１位数と１位数との加法の計算ができること。
　　㋓　１位数と２位数との和が20までの加法の計算ができること。
　　㋔　減法が用いられる求残や減少等の場合について理解すること。
　　㋕　減法が用いられる場面を式に表したり，式を読み取ったりすること。
　　㋖　20までの数の範囲で減法の計算ができること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　日常の事象における数量の関係に着目し，計算の意味や計算の仕方を見付け出したり，学習や生活で生かしたりすること。
Ｂ　図形
ア　身の回りにあるものの形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものの形に着目し，身の回りにあるものの特徴を捉えること。
　　㋑　具体物を用いて形を作ったり分解したりすること。
　　㋒　前後，左右，上下など方向や位置に関する言葉を用いて，ものの位置を表すこと。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身の回りにあるものから，いろいろな形を見付けたり，具体物を用いて形を作ったり分解したりすること。
　　㋑　身の回りにあるものの形を図形として捉えること。
　　㋒　身の回りにあるものの形の観察などをして，ものの形を認識したり，形の特徴を捉えたりすること。
イ　角の大きさに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　傾斜をつくると角ができることを理解すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　傾斜が変化したときの斜面と底面の作り出す開き具合について，大きい・小さいと表現すること。
Ｃ　測定
ア　身の回りのものの量の単位と測定に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　長さ，広さ，かさなどの量を直接比べる方法について理解し，比較すること。
　　㋑　身の回りにあるものの大きさを単位として，その幾つ分かで大きさを比較すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　身の回りのものの長さ，広さ及びかさについて，その単位に着目して大小を比較したり，表現したりすること。
イ　時刻や時間に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　日常生活の中で時刻を読むこと。
　　㋑　時間の単位（日，午前，午後，時，分）について知り，それらの関係を理解すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　時刻の読み方を日常生活に生かして，時刻と生活とを結び付けて表現すること。
Ｄ　データの活用
ア　身の回りにある事象を簡単な絵や図，記号に置き換えることに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　　㋐　ものとものとの対応やものの個数について，簡単な絵や図に表して整理したり，それらを読んだりすること。
　　㋑　身の回りにあるデータを簡単な記号に置き換えて表し，比較して読み取ること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　　㋐　個数の把握や比較のために簡単な絵や図，記号に置き換えて簡潔に表現すること。
〔数学的活動〕
ア　内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ測定」及び「Ｄデータの活用」に示す学習については，次のような数学的活動に取り組むものとする。
（ア）　身の回りの事象を観察したり，具体物を操作したりして，算数に主体的に関わる活動
（イ）　日常生活の事象から見いだした算数の問題を，具体物，絵図，式などを用いて解決し，結果を確かめる活動
（ウ）　問題解決した過程や結果を，具体物や絵図，式などを用いて表現し，伝え合う活動"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育むべき資質・能力の育成に向けて，数学的活動を通して，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，数学的な見方・考え方を働かせながら，日常の事象を数理的に捉え，算数の問題を見いだし，問題を自立的，協働的に解決し，学習の過程を振り返り，概念を形成するなどの学習の充実を図ること。
イ　数量や図形についての基礎的な能力の維持や向上を図るため，適宜練習の機会を設けて計画的に指導すること。また，段階間の指導内容を円滑に接続させるため，適切な反復による学習を進めるようにすること。
ウ　２の内容の「Ａ数と計算（１段階はＢ）」，「Ｂ図形（１段階はＣ）」，「Ｃ測定（１段階はＤ）」及び「Ｄデータの活用（１段階はＡ「数量の基礎」）」の指導の間の関連を図ること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　思考力，判断力，表現力等を育成するため，各段階の内容の指導に当たっては，具体物，言葉，数，式，図，表，グラフなどを用いて考えたり，説明したり，互いに自分の考えを表現し伝え合ったりするなどの学習活動を積極的に取り入れるようにすること。
イ　「Ａ数と計算（１段階はＢ）」の指導に当たっては，具体物などの教具を適宜用いて，数と計算についての意味の理解を深めるよう留意すること。
ウ　１段階の内容に示す事項については，次の（ア）から（ウ）までに留意するものとする。
（ア）　内容の「Ａ数量の基礎」のアの（ア）の ㋐及び ㋑，（イ）の ㋐に示す事項については，内容の「Ｃ図形」のアの（ア）の ㋐から㋕ まで及び（イ）の ㋐から ㋒までの基礎的な事項として関連付けながら取り上げること。
（イ）　内容の「Ａ数量の基礎」のイについては，分割した絵カードや関連の深い絵カードを組み合わせるなど，初歩的な分析や総合について取り扱うものとする。
（ウ）　内容の「Ｃ図形」のアの（ア）の㋐ については，様々な情報のうちから，必要な情報のみを取り出し，他を捨象することを取り扱うものとする。また， ㋑から ㋕までの類別や分類・整理につながるよう配慮するものとする。
エ　２段階の内容に示す事項については，次の（ア）から（ウ）までに留意するものとする。
（ア）　内容の「Ａ数と計算」の指導に当たっては，次の ㋐及び ㋑についての金銭の価値に親しむことを取り扱うものとする。
　　㋐　金種を用いる。
　　㋑　様々な種類の貨幣のもつ価値を知る。
（イ）　内容の「Ｂ図形」のアの（ア）の ㋑については，相違点や類似点に着目して分類することを取り扱うものとする。
（ウ）　内容の「Ｄデータの活用」のアの（ア）の㋐ については，分類してまとめたもの同士の数量に着目できるよう配慮するものとする。
オ　３段階の内容に示す事項については，次のアからオまでに留意するものとする。
（ア）　内容の「Ａ数と計算」の指導に当たっては，次の㋐ についての金銭の価値に親しむことを取り扱うものとする。
　　金種の理解
　　　ａ　金種を用いる。
　　　ｂ　様々な種類の貨幣のもつ価値を理解する。
　　　ｃ　おつりを扱うこと。
（イ）　内容の「Ｂ図形」の指導に当たっては，次の ㋐の基礎的事項と関連付けながら取り上げること。
　　㋐　大きさとしての角の理解
　　　ａ　身の回りにある直角を紙に写し取ったり，紙粘土でつくったりして「形としての角」を抽出する。
　　　ｂ　角度を変えるなどの操作を通して「大きさとしての角」を実感できるようにする。
（ウ）　内容の「Ｃ測定」の指導に当たっては，次の㋐ から㋒ までの基礎的な事項と関連付けながら取り上げること。
　　㋐　量の保存性に対する理解
　　　ａ　量を他の位置に移すことや分割していくつかに分けること，また，そのときに見かけの形が変わることなどを体験できるようにする。
　　　ｂ　見かけの形を元に戻したときに量の大きさが変わっていないということから，保存性について確かめるようにする。
　　㋑　量の性質の理解
　　　ａ　量の概念を理解し，豊かにするために，「量の比較性」，「量の測定性」，「量の加法性」に関わる体験を重視する。
　　㋒　時計の理解
　　　ａ　アナログ時計の長針と短針とを区別して捉えることができるようにする。
　　　ｂ　アナログ時計の時は短針で決まること，分は長針が指す目盛りで決まることを理解できるようにする。
（エ）　内容の「Ｃ測定」のウの（ア）については，直接的な表示により時刻に関心をもちやすいデジタル方式を取り扱うことができるよう配慮するものとする。
（オ）　内容の「Ｃ測定」のウ及び「Ｄデータの活用」のアの（ア）の ㋐については，児童の日常生活に関連する学習と関連付けながら取り上げること。
（３）　数学的活動の指導に当たっては，次の事項に配慮するものとする。
ア　数学的活動は，基礎的・基本的な知識及び技能を確実に身に付けたり，思考力，判断力，表現力等を高めたり，算数を学ぶことの楽しさを実感したりするために，重要な役割を果たすものであることから，２の内容の「Ａ数と計算（１段階はＢ）」，「Ｂ図形（１段階はＣ）」，「Ｃ測定（１段階はＤ）」及び「Ｄデータの活用（１段階は「Ａ数量の基礎」）」に示す事項については，数学的活動を通して指導するようにすること。
イ　数学的活動を楽しめるようにするとともに，算数を生活に活用することなどについて実感する機会を設けること。"""
            },
            "音楽": {
                "目標": """表現及び鑑賞の活動を通して，音楽的な見方・考え方を働かせ，生活の中の音や音楽に興味や関心をもって関わる資質・能力を次のとおり育成することを目指す。
（１）　曲名や曲想と音楽のつくりについて気付くとともに，感じたことを音楽表現するために必要な技能を身に付けるようにする。
（２）　感じたことを表現することや，曲や演奏の楽しさを見いだしながら，音や音楽の楽しさを味わって聴くことができるようにする。
（３）　音や音楽に楽しく関わり，協働して音楽活動をする楽しさを感じるとともに，身の回りの様々な音楽に親しむ態度を養い，豊かな情操を培う。""",
                "１段階": {
                    "目標": """ア　音や音楽に注意を向けて気付くとともに，関心を向け，音楽表現を楽しむために必要な身体表現，器楽，歌唱，音楽づくりにつながる技能を身に付けるようにする。
イ　音楽的な表現を楽しむことや，音や音楽に気付きながら関心や興味をもって聴くことができるようにする。
ウ　音や音楽に気付いて，教師と一緒に音楽活動をする楽しさを感じるとともに，音楽経験を生かして生活を楽しいものにしようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　音楽遊びの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　音や音楽遊びについての知識や技能を得たり生かしたりしながら，音や音楽を聴いて，自分なりに表そうとすること。
（イ）　表現する音や音楽に気付くこと。
（ウ）　思いに合った表現をするために必要な次の ㋐から㋒までの技能を身に付けること。
　㋐　音や音楽を感じて体を動かす技能
　㋑　音や音楽を感じて楽器の音を出す技能
　㋒　音や音楽を感じて声を出す技能
Ｂ　鑑　賞
ア　音楽遊びの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　音や音楽遊びについての知識や技能を得たり生かしたりしながら，音や音楽を聴いて，自分なりの楽しさを見付けようとすること。
（イ）　聴こえてくる音や音楽に気付くこと。"""
                },
                "２段階": {
                    "目標": """ア　曲名や曲想と簡単な音楽のつくりについて気付くとともに，音楽表現を楽しむために必要な身体表現，器楽，歌唱，音楽づくりの技能を身に付けるようにする。
イ　音楽表現を工夫することや，表現することを通じて，音や音楽に興味をもって聴くことができるようにする。
ウ　音や音楽に関わり，教師と一緒に音楽活動をする楽しさに興味をもちながら，音楽経験を生かして生活を明るく楽しいものにしようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　歌唱の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　歌唱表現についての知識や技能を得たり生かしたりしながら，好きな歌ややさしい旋律の一部分を自分なりに歌いたいという思いをもつこと。
（イ）　次の㋐ 及び ㋑について気付くこと。
　㋐　曲の特徴的なリズムと旋律
　㋑　曲名や歌詞に使われている特徴的な言葉
（ウ）　思いに合った表現をするために必要な次の ㋐から㋒ までの技能を身に付けること。
　㋐　範唱を聴いて，曲の一部分を模唱する技能
　㋑　自分の歌声に注意を向けて歌う技能
　㋒　教師や友達と一緒に歌う技能
イ　器楽の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　器楽表現についての知識や技能を得たり生かしたりしながら，身近な打楽器などに親しみ音を出そうとする思いをもつこと。
（イ）　次の ㋐及び ㋑について気付くこと。
　㋐　拍や曲の特徴的なリズム
　㋑　楽器の音色の違い
（ウ）　思いに合った表現をするために必要な次の㋐ から ㋒までの技能を身に付けること。
　㋐　範奏を聴き，模倣をして演奏する技能
　㋑　身近な打楽器を演奏する技能
　㋒　教師や友達と一緒に演奏する技能
ウ　音楽づくりの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　音楽づくりについての知識や技能を得たり生かしたりしながら，次の ㋐及び ㋑をできるようにすること。
　㋐　音遊びを通して，音の面白さに気付くこと。
　㋑　音や音楽で表現することについて思いをもつこと。
（イ）　次の ㋐及び ㋑について，それらが生み出す面白さなどに触れて気付くこと。
　㋐　声や身の回りの様々な音の特徴
　㋑　音のつなげ方の特徴
（ウ）　気付きを生かした表現や思いに合った表現をするために必要な次の ㋐及び ㋑の技能を身に付けること。
　㋐　音を選んだりつなげたりして，表現する技能
　㋑　教師や友達と一緒に簡単な音や音楽をつくる技能
エ　身体表現の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身体表現についての知識や技能を得たり生かしたりしながら，簡単なリズムの特徴を感じ取り，体を動かすことについて思いをもつこと。
（イ）　次の㋐ 及び ㋑について気付くこと。
　㋐　拍や曲の特徴的なリズム
　㋑　曲名と動きとの関わり
（ウ）　思いに合った動きで表現するために必要な次の㋐ から ㋒までの技能を身に付けること。
　㋐　示範を見て模倣したり，拍や特徴的なリズムを意識したりして手足や身体全体を動かす技能
　㋑　音や音楽を聴いて，手足や身体全体を自然に動かす技能
　㋒　教師や友達と一緒に体を動かす技能
Ｂ　鑑　賞
ア　鑑賞の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　鑑賞についての知識を得たり生かしたりしながら，身近な人の演奏を見たり，体の動きで表したりしながら聴くこと。
（イ）　身近な人の演奏に触れて，好きな音色や楽器の音を見付けること。"""
                },
                "３段階": {
                    "目標": """ア　曲名や曲想と音楽のつくりについて気付くとともに，音楽表現を楽しむために必要な身体表現，器楽，歌唱，音楽づくりの技能を身に付けるようにする。
イ　音楽表現に対する思いをもつことや，曲や演奏の楽しさを見いだしながら音楽を味わって聴くことができるようにする。
ウ　音や音楽に楽しく関わり，協働して音楽活動をする楽しさを感じながら，身の回りの様々な音楽に興味をもつとともに，音楽経験を生かして生活を明るく潤いのあるものにしようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　歌唱の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　歌唱表現についての知識や技能を得たり生かしたりしながら，歌唱表現に対する思いをもつこと。
（イ）　次の ㋐及び ㋑について気付くこと。
　㋐　曲の雰囲気と曲の速さや強弱との関わり
　㋑　曲名や歌詞に使われている言葉から受けるイメージと曲の雰囲気との関わり
（ウ）　思いに合った歌い方で歌うために必要な次の ㋐から ㋒までの技能を身に付けること。
　㋐　範唱を聴いて歌ったり，歌詞やリズムを意識して歌ったりする技能
　㋑　自分の歌声の大きさや発音などに気を付けて歌う技能
　㋒　教師や友達と一緒に声を合わせて歌う技能
イ　器楽の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　器楽表現についての知識や技能を得たり生かしたりしながら，器楽表現に対する思いをもつこと。
（イ）　次の ㋐及び ㋑について気付くこと。
　㋐　リズム，速度や強弱の違い
　㋑　演奏の仕方による楽器の音色の違い
（ウ）　思いに合った表現をするために必要な次の ㋐から ㋒までの技能を身に付けること。
　㋐　簡単な楽譜などを見てリズム演奏などをする技能
　㋑　身近な打楽器や旋律楽器を使って演奏する技能
　㋒　教師や友達の楽器の音を聴いて演奏する技能
ウ　音楽づくりの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　音楽づくりについての知識や技能を得たり生かしたりしながら，次の ㋐及び ㋑をできるようにすること。
　㋐　音遊びを通して，音の面白さに気付いたり，音楽づくりの発想を得たりすること。
　㋑　どのように音を音楽にしていくかについて思いをもつこと。
（イ）　次の ㋐及び ㋑について，それらが生み出す面白さなどと関わって気付くこと。
　㋐　声や身の回りの様々な音の特徴
　㋑　簡単なリズム・パターンの特徴
（ウ）　気付きや発想を生かした表現や，思いに合った表現をするために必要な次の ㋐及び ㋑の技能を身に付けること。
　㋐　音を選んだりつなげたりして表現する技能
　㋑　教師や友達と一緒に音楽の仕組みを用いて，簡単な音楽をつくる技能
エ　身体表現の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身体表現についての知識や技能を得たり生かしたりしながら，簡単なリズムや旋律の特徴，歌詞を感じ取り，体を動かすことについて思いをもつこと。
（イ）　次の ㋐及び ㋑の関わりについて気付くこと。
　㋐　曲のリズム，速度，旋律
　㋑　曲名，拍やリズムを表す言葉やかけ声，歌詞の一部
（ウ）　思いに合った体の動きで表現するために必要な次の㋐ から ㋒までの技能を身に付けること。
　㋐　示範を見たり，拍やリズム，旋律を意識したりして，身体表現をする技　能
　㋑　音や音楽を聴いて，様々な体の動きで表現する技能
　㋒　教師や友達と一緒に体を使って表現する技能
Ｂ　鑑　賞
ア　鑑賞の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　鑑賞についての知識を得たり生かしたりしながら，曲や演奏の楽しさを見いだして聴くこと。
（イ）　曲想や楽器の音色，リズムや速度，旋律の特徴に気付くこと。
〔共通事項〕
（１）　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
ア　音楽を形づくっている要素を聴き取り，それらの働きが生み出すよさや面白さ，美しさを感じ取りながら，聴き取ったことと感じとったこととの関わりについて考えること。
イ　絵譜や色を用いた音符，休符，記号や用語について，音楽における働きと関わらせて，その意味に触れること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　題材など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，音楽的な見方・考え方を働かせ，他者と協働しながら，音楽表現を生み出したり音楽を聴いてそのよさなどを見いだしたりするなど，思考，判断し，表現する一連の過程を大切にした学習の充実を図ること。
イ　２の目標及び内容の「Ａ表現」のアからエまで（１段階はア）の指導については，（ア），（イ）及び（ウ）の各事項を，「Ｂ鑑賞」のアの指導については，（ア）及び（イ）の各事項を，適切に関連させて指導すること。
ウ　２の目標及び内容の〔共通事項〕は，表現及び鑑賞の学習において共通に必要となる資質・能力であり，「Ａ表現」及び「Ｂ鑑賞」の指導と併せて，十分な指導が行われるよう工夫すること。
エ　２の目標及び内容の「Ａ表現」のアからエまで（１段階はア）及び「Ｂ鑑賞」のアの指導については，適宜，〔共通事項〕を要として各領域や分野の関連を図るようにすること。
オ　国歌「君が代」は，時期に応じて適切に指導すること。
カ　各段階においては，児童の発達の段階と生活年齢を考慮すること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　各段階の指導に当たっては，音や音楽との一体感を味わえるようにするため，指導のねらいに即して体を動かす活動を取り入れるようにすること。
イ　各段階の指導に当たっては，音や音楽及び言葉によるコミュニケーションを図る指導を工夫すること。その際，児童の言語理解や発声・発語の状況等を考慮し，必要に応じてコンピュータや教育機器も活用すること。
ウ　児童が学校内における音楽活動とのつながりを意識できるような機会を作るなど，児童や学校，地域の実態に応じ，生活や社会の中の音や音楽と主体的に関わっていくことができるよう配慮すること。
エ　合奏や合唱などの活動を通して和音のもつ表情を感じることができるようにすること。また，長調及び短調の曲においては，Ⅰ，Ⅳ，Ⅴ及びⅤ７などの和音を中心に指導すること。
オ　我が国や郷土の音楽の指導に当たっては，そのよさなどを感じ取って表現したり鑑賞したりできるよう，楽譜や音源等の示し方，伴奏の仕方，曲に合った歌い方や楽器の演奏の仕方など指導方法について工夫すること。
カ　各段階の「Ａ表現」のアの歌唱の指導に当たっては，次のとおり取り扱うこと。
（ア）　児童の実態や学習状況及び必要に応じて適宜，移動ド唱法を取り上げるようにすること。
（イ）　成長に伴う声の変化に気付くことができるよう，変声期の児童に対して適切に配慮すること。
キ　各段階の「Ａ表現」のイ（１段階はア）の楽器については，次のとおり取り扱うこと。
（ア）　各段階で取り上げる打楽器は，簡単に演奏できる楽器，木琴，鉄琴，和楽器，諸外国に伝わる様々な楽器を含めて，児童の実態や発達の段階を考慮して選択すること。
（イ）　各段階で取り上げる身近な楽器は，様々な打楽器，鍵盤ハーモニカなどの中から児童の実態や発達の段階を考慮して選択すること。
（ウ）　３段階で取り上げる旋律楽器は，既習の楽器を含めて，鍵盤楽器などの中から児童の実態や発達の段階を考慮して選択すること。
（エ）　合奏で扱う楽器については，リズム，旋律，和音などの各声部の演奏ができるよう，楽器の特性を生かして選択すること。
ク　２段階及び３段階の「Ａ表現」のウの音楽づくりの指導に当たっては，次のとおり取り扱うこと。
（ア）　音遊びや即興的な表現では，リズムや旋律を模倣したり，身近なものから多様な音を探したりして，音楽づくりのための発想を得ることができるよう指導すること。
（イ）　どのような音楽を，どのようにしてつくるかなどについて，児童の実態に応じて具体的な例を示しながら指導すること。
（ウ）　つくった音楽については，指導のねらいに即し，必要に応じて記録できるようにすること。記録の仕方については，図や絵によるものなど，柔軟に指導すること。
（エ）　拍のないリズム，我が国の音楽に使われている音階や調性にとらわれない音階などを児童の実態に応じて取り上げるようにすること。
ケ　各段階の「Ｂ鑑賞」の指導に当たっては，気付いたり感じたりしたことを体の動きで表現したり，絵に描いたり，言葉で表現したりできるよう指導を工夫すること。
コ　２の目標及び内容の〔共通事項〕の（1）のアに示す「音楽を形づくっている要素」については，児童の発達の段階や指導のねらいに応じて，次の（ア）及び（イ）を適切に選択したり関連付けたりして必要に応じて指導すること。
（ア）　音楽を特徴付けている要素
　㋐　音色，リズム，速度，旋律，強弱，音の重なり，和音の響き，音階，調，拍，フレーズなど
（イ）　音楽の仕組み
　㋐　反復，呼びかけとこたえ，変化，音楽の縦と横との関係など
サ　〔共通事項〕の（1）のイに示す「音符，休符，記号や用語」については，児童の実態や学習状況を考慮して取り扱うこと。
シ　歌唱教材は，次に示すものを取り扱うこと。
（ア）　児童の生活年齢及び発達の段階に応じた，日常の生活に関連した曲。
（イ）　主となる歌唱教材については，ウの共通教材を含めて，人々に長く親しまれている音楽など，いろいろな種類の曲。
（ウ）　共通教材は，次に示すものとする。
「うみ」　（文部省唱歌）林柳波（はやしりゅうは）作詞　井上武士（いのうえたけし）作曲
「かたつむり」　（文部省唱歌）
「日のまる」　（文部省唱歌）高野辰之（たかのやつゆき）作詞　岡野貞一（おかのていいち）作曲
「ひらいたひらいた」　（わらべうた）
「かくれんぼ」　（文部省唱歌）林柳波（はやしりゅうは）作詞　下総皖一（しもふさかんいち）作曲
「春がきた」　（文部省唱歌）高野辰之（たかのやつゆき）作詞　岡野貞一（おかのていいち）作曲
「虫のこえ」　（文部省唱歌）
「夕やけこやけ」　中村雨紅（なかむらうこう）作詞　草川信（くさかわしん）作曲
ス　器楽教材は，次に示すものを取り扱うこと。
（ア）　児童の生活年齢及び発達の段階に応じた，指導のねらいとの関係において適切であり，身近で親しみのもてるもの。
（イ）　主となる器楽教材については，既習の歌唱教材を含め，主旋律に簡単なリズム伴奏を加えた曲。
セ　音楽づくり教材は，次に示すものを取り扱うこと。
（ア）　児童の生活年齢及び発達の段階に応じた指導のねらいとの関係において適切であり，身近で親しみのもてるもの。
ソ　音や音楽の特徴を身体表現にするために適した教材は，次に示すものを取り扱うこと。
（ア）　主となる教材については，既習の歌唱教材や器楽教材を含め，音や音楽を聴いて体を動かすことができるものを中心に，児童の生活年齢及び発達の段階に応じた指導のねらいとの関係において適切であり，親しみのもてるもの。
タ　鑑賞教材は，次に示すものを取り扱うこと。
（ア）　主となる鑑賞教材については，既習の歌唱教材や器楽教材を含め，児童の生活年齢及び発達の段階に応じた，曲想を感じ取り，情景を思い浮かべやすい，いろいろな種類の曲。
（イ）　音楽を形づくっている要素の働きを感じ取りやすく，聴く楽しさを感じやすい曲。
（ウ）　楽器の音色や人の声の表現の違いを聴き取りやすい，いろいろな演奏形態による曲。"""
            },
            "図画工作": {
                "目標": """表現及び鑑賞の活動を通して，造形的な見方・考え方を働かせ，生活や社会の中の形や色などと豊かに関わる資質・能力を次のとおり育成することを目指す。
（１）　形や色などの造形的な視点に気付き，表したいことに合わせて材料や用具を使い，表し方を工夫してつくることができるようにする。
（２）　造形的なよさや美しさ，表したいことや表し方などについて考え，発想や構想をしたり，身の回りの作品などから自分の見方や感じ方を広げたりすることができるようにする。
（３）　つくりだす喜びを味わうとともに，感性を育み，楽しく豊かな生活を創造しようとする態度を養い，豊かな情操を培う。""",
                "１段階": {
                    "目標": """ア　形や色などに気付き，材料や用具を使おうとするようにする。
イ　表したいことを思い付いたり，作品を見たりできるようにする。
ウ　進んで表したり見たりする活動に取り組み，つくりだすことの楽しさに気付くとともに，形や色などに関わることにより楽しい生活を創造しようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　線を引く，絵をかくなどの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　材料などから，表したいことを思い付くこと。
（イ）　身の回りの自然物などに触れながらかく，切る，ぬる，はるなどすること。
Ｂ　鑑　賞
ア　身の回りにあるものや自分たちの作品などを鑑賞する活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身の回りにあるものなどを見ること。
〔共通事項〕
ア　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分が感じたことや行ったことを通して，形や色などについて気付くこと。
（イ）　形や色などを基に，自分のイメージをもつこと。"""
                },
                "２段階": {
                    "目標": """ア　形や色などの違いに気付き，表したいことを基に材料や用具を使い，表し方を工夫してつくるようにする。
イ　表したいことを思い付いたり，作品などの面白さや楽しさを感じ取ったりすることができるようにする。
ウ　進んで表現や鑑賞の活動に取り組み，つくりだす喜びを感じるとともに，形や色などに関わることにより楽しく豊かな生活を創造しようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　身近な出来事や思ったことを基に絵をかく，粘土で形をつくるなどの活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　材料や，感じたこと，想像したこと，見たことから表したいことを思い付くこと。
（イ）　身近な材料や用具を使い，かいたり，形をつくったりすること。
Ｂ　鑑　賞
ア　身の回りにあるものや自分たちの作品などを鑑賞する活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身近にあるものなどの形や色の面白さについて感じ取り，自分の見方や感じ方を広げること。
〔共通事項〕
ア　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分が感じたことや行ったことを通して，形や色などの違いに気付くこと。
（イ）　形や色などを基に，自分のイメージをもつこと。"""
                },
                "３段階": {
                    "目標": """ア　形や色などの造形的な視点に気付き，表したいことに合わせて材料や用具を使い，表し方を工夫してつくるようにする。
イ　造形的なよさや美しさ，表したいことや表し方などについて考え，発想や構想をしたり，身の回りの作品などから自分の見方や感じ方を広げたりすることができるようにする。
ウ　進んで表現や鑑賞の活動に取り組み，つくりだす喜びを味わうとともに，感性を育み，形や色などに関わることにより楽しく豊かな生活を創造しようとする態度を養う。""",
                    "内容": """Ａ　表　現
ア　日常生活の出来事や思ったことを基に絵をかいたり，作品をつくったりする活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　材料や，感じたこと，想像したこと，見たこと，思ったことから表したいことを思い付くこと。
（イ）　様々な材料や用具を使い，工夫して絵をかいたり，作品をつくったりすること。
Ｂ　鑑　賞
ア　自分たちの作品や身の回りにある作品などを鑑賞する活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分たちの作品や，日常生活の中にあるものなどの形や色，表し方の面白さなどについて，感じ取り，自分の見方や感じ方を広げること。
〔共通事項〕
ア　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分の感覚や行為を通して，形や色などの感じに気付くこと。
（イ）　形や色などの感じを基に，自分のイメージをもつこと。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　題材など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，造形的な見方・考え方を働かせ，表現したり鑑賞したりする資質・能力を相互に関連させた学習の充実を図ること。
イ　２の各段階の内容の「Ａ表現」及び「Ｂ鑑賞」の指導に当たっては，相互の関連を図るようにすること。ただし，「Ｂ鑑賞」の指導に当たっては，指導の効果を高めるための必要がある場合には，児童や学校の実態に応じ，独立して行うようにすること。
ウ　２の各段階の内容の〔共通事項〕は，表現及び鑑賞の学習において共通に必要となる資質・能力であり，「Ａ表現」及び「Ｂ鑑賞」の各事項の指導と併せて，十分な指導が行われるよう工夫すること。
エ　２の各段階の内容の「Ａ表現」の指導に当たっては，適宜共同してつくりだす活動を取り上げるようにすること。
オ　２の各段階の内容の「Ｂ鑑賞」に当たっては，感じたことや思ったことを周りの人と共有できる機会を設けるようにすること。
カ　２の各段階の指導に当たっては，他教科や特別活動等との関連を図り，総合的に活動することで，指導の効果を高めるようにすること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　造形活動においては，材料や用具の安全な使い方について指導するとともに活動場所を事前に点検するなどして，事故防止について徹底すること。
イ　児童が個性を生かして活動することができるようにするため，学習活動や表現方法などに幅をもたせるようにすること。
ウ　「Ａ表現」の指導に当たっては，活動の全過程を通して児童が実現したい思いを大切にしながら活動できるようにし，自分のよさや可能性を見いだし，楽しく豊かな生活を創造しようとする態度を養うようにすること。
エ　各活動において，互いのよさや個性などを認め尊重し合うようにすること。
オ　土，木，紙などの身近な材料に親しんで造形活動などをすることや，はさみ，のりなど身近で扱いやすい用具等の扱い方を理解して使えるよう指導すること。
カ　「Ａ表現」及び「Ｂ鑑賞」の学習を通して学んだことが，生活や社会の中で生かせるよう指導することや，作品や用具等を大切に取り扱うことを指導すること。
キ　コンピュータ，カメラなどの情報機器を利用することについては，表現や鑑賞の活動で使う用具の一つとして扱うとともに，必要性を十分に検討して利用すること。
ク　材料については，地域の身近にある材料なども取り上げ，指導すること。
ケ　作品を校内の適切な場所に展示するなどし，日常の学校生活においてそれらを鑑賞することができるよう配慮すること。また，学校や地域の実態に応じて，校外に児童の作品を展示する機会を設けるなどすること。"""
            },
            "体育": {
                "目標": """体育や保健の見方・考え方を働かせ，課題に気付き，その解決に向けた学習過程を通して，心と体を一体として捉え，生涯にわたって心身の健康を保持増進し，豊かなスポーツライフを実現するための資質・能力を次のとおり育成することを目指す。
（１）　遊びや基本的な運動の行い方及び身近な生活における健康について知るとともに，基本的な動きや健康な生活に必要な事柄を身に付けるようにする。
（２）　遊びや基本的な運動及び健康についての自分の課題に気付き，その解決に向けて自ら考え行動し，他者に伝える力を養う。
（３）　遊びや基本的な運動に親しむことや健康の保持増進と体力の向上を目指し，楽しく明るい生活を営む態度を養う。""",
                "１段階": {
                    "目標": """ア　教師と一緒に，楽しく体を動かすことができるようにするとともに，健康な生活に必要な事柄ができるようにする。
イ　体を動かすことの楽しさや心地よさを表現できるようにするとともに，健康な生活を営むために必要な事柄について教師に伝えることができるようにする。
ウ　簡単な合図や指示に従って，楽しく運動をしようとしたり，健康に必要な事柄をしようとしたりする態度を養う。""",
                    "内容": """Ａ　体つくり運動遊び
体つくり運動遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，手足を動かしたり，歩いたりして楽しく体を動かすこと。
イ　手足を動かしたり，歩いたりして体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，体つくり運動遊びをしようとすること。
Ｂ　器械・器具を使っての遊び
器械・器具を使っての遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，器械・器具を使って楽しく体を動かすこと。
イ　器械・器具を使って体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，器械・器具を使っての遊びをしようとすること。
Ｃ　走・跳の運動遊び
走・跳の運動遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，走ったり，跳んだりして楽しく体を動かすこと。
イ　走ったり，跳んだりして体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，走・跳の運動遊びをしようとすること。
Ｄ　水遊び
水遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，水の特性を生かした簡単な水遊びを楽しくすること。
イ　水の中で体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，水遊びをしようとすること。
Ｅ　ボール遊び
ボール遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，ボールを使って楽しく体を動かすこと。
イ　ボールを使って体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，ボール遊びをしようとすること。
Ｆ　表現遊び
表現遊びについて，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，音楽の流れている場所で楽しく体を動かすこと。
イ　音楽の流れている場所で体を動かすことの楽しさや心地よさを表現すること。
ウ　簡単な合図や指示に従って，表現遊びをしようとすること。
Ｇ　保健
健康な生活に必要な事柄について，次の事項を身に付けることができるよう指導する。
ア　教師と一緒に，うがいなどの健康な生活に必要な事柄をすること。
イ　健康な生活に必要な事柄に気付き，教師に伝えること。"""
                },
                "２段階": {
                    "目標": """ア　教師の支援を受けながら，楽しく基本的な運動ができるようにするとともに，健康な生活に必要な事柄ができるようにする。
イ　基本的な運動に慣れ，その楽しさや感じたことを表現できるようにするとともに，健康な生活に向け，感じたことを他者に伝える力を養う。
ウ　簡単なきまりを守り，友達とともに安全に楽しく運動をしようとしたり，健康に必要な事柄をしようとしたりする態度を養う。""",
                    "内容": """Ａ　体つくり運動
体つくり運動について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，楽しく基本的な体つくり運動をすること。
イ　基本的な体つくり運動に慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，基本的な体つくり運動をしようとすること。
Ｂ　器械・器具を使っての運動
器械・器具を使っての運動について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，楽しく器械・器具を使っての基本的な運動をすること。
イ　器械・器具を使っての基本的な運動に慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，器械・器具を使っての基本的な運動をしようとすること。
Ｃ　走・跳の運動
走・跳の運動について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，楽しく走・跳の基本的な運動をすること。
イ　走・跳の基本的な運動に慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，走・跳の基本的な運動をしようとすること。
Ｄ　水の中での運動
水の中での運動について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，楽しく水の中での基本的な運動をすること。
イ　水の中での基本的な運動に慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，水の中での基本的な運動をしようとすること。
Ｅ　ボールを使った運動やゲーム
ボールを使った運動やゲームについて，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，楽しくボールを使った基本的な運動やゲームをすること。
イ　ボールを使った基本的な運動やゲームに慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，ボールを使った基本的な運動やゲームをしようとすること。
Ｆ　表現運動
表現運動について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，音楽に合わせて楽しく表現運動をすること。
イ　基本的な表現運動に慣れ，その楽しさや感じたことを表現すること。
ウ　簡単なきまりを守り，友達とともに安全に楽しく，基本的な表現運動をしようとすること。
Ｇ　保健
健康な生活に必要な事柄について，次の事項を身に付けることができるよう指導する。
ア　教師の支援を受けながら，健康な生活に必要な事柄をすること。
イ　健康な生活に必要な事柄に慣れ，感じたことを他者に伝えること。"""
                },
                "３段階": {
                    "目標": """ア　基本的な運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付けるとともに，健康や身体の変化について知り，健康な生活ができるようにする。
イ　基本的な運動の楽しみ方や健康な生活の仕方について工夫するとともに，考えたことや気付いたことなどを他者に伝える力を養う。
ウ　きまりを守り，自分から友達と仲よく楽しく運動をしたり，場や用具の安全に気を付けたりしようとするとともに，自分から健康に必要な事柄をしようとする態度を養う。""",
                    "内容": """Ａ　体つくり運動
体つくり運動について，次の事項を身に付けることができるよう指導する。
ア　基本的な体つくり運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付けること。
イ　基本的な体つくり運動の楽しみ方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しく基本的な体つくり運動をしたり，場や用具の安全に気を付けたりしようとすること。
Ｂ　器械・器具を使っての運動
器械・器具を使っての運動について，次の事項を身に付けることができるよう指導する。
ア　器械・器具を使っての基本的な運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付けること。
イ　器械・器具を使っての基本的な運動の行い方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しく器械・器具を使っての基本的な運動をしたり，場や器械・器具の安全に気を付けたりしようとすること。
Ｃ　走・跳の運動
走・跳の運動について，次の事項を身に付けることができるよう指導する。
ア　走・跳の基本的な運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付けること。
イ　走・跳の基本的な運動の楽しみ方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しく走・跳の基本的な運動をしたり，場や用具の安全に気を付けたりしようとすること。
Ｄ　水の中での運動
水の中での運動について，次の事項を身に付けることができるよう指導する。
ア　水の中での基本的な運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付けること。
イ　水の中での基本的な運動の楽しみ方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しく水の中での基本的な運動をしたり，場や用具の安全に気を付けたりしようとすること。
Ｅ　ボールを使った運動やゲーム
ボールを使った運動やゲームについて，次の事項を身に付けることができるよう指導する。
ア　ボールを使った基本的な運動やゲームの楽しさを感じ，その行い方を知り，基本的な動きを身に付けること。
イ　ボールを使った基本的な運動やゲームの楽しみ方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しくボールを使った基本的な運動やゲームをしたり，場や用具の安全に気を付けたりしようとすること。
Ｆ　表現運動
表現運動について，次の事項を身に付けることができるよう指導する。
ア　基本的な表現運動の楽しさを感じ，その行い方を知り，基本的な動きを身に付け，表現したり踊ったりすること。
イ　基本的な表現運動の楽しみ方を工夫するとともに，考えたことや気付いたことなどを他者に伝えること。
ウ　きまりを守り，自分から友達と仲よく楽しく表現運動をしたり，場や用具の安全に気を付けたりしようとすること。
Ｇ　保健
健康な生活に必要な事柄について，次の事項を身に付けることができるよう指導する。
ア　健康や身体の変化について知り，健康な生活に必要な事柄に関する基本的な知識や技能を身に付けること。
イ　健康な生活に必要な事柄について工夫するとともに，考えたことや気付いたことなどを他者に伝えること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　各段階の内容のまとまりを見通して，その中で育む資質・能力の育成に向けて，児童の主体的・対話的で深い学びの実現を図るようにすること。その際，体育や保健の見方・考え方を働かせ，遊びや運動，健康についての自己の課題に気付き，個々の児童の障害の状態等に応じて，その解決のための方法を選んだり工夫したりするような活動の充実を図ること。また，運動の楽しさや喜びを味わったり，健康の大切さを実感したりすることができるよう，留意すること。
イ　「Ａ体つくり運動遊び」又は「Ａ体つくり運動」及び「Ｇ保健」については，６学年間にわたって取り扱うこと。
ウ　「Ｇ保健」については，生活科の２の各段階に示す内容のアの「基本的生活習慣」やイの「安全」などとの関連を積極的に図り，指導の効果を高めるようにすること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　学校や地域の実態を考慮するとともに，個々の児童の障害の状態等，遊びや運動の経験及び技能の程度などに応じた指導や児童自らが遊びや運動の課題の解決を目指す活動を行えるよう工夫すること。
イ　運動を苦手と感じている児童や，運動に意欲的に取り組まない児童への指導を工夫すること。
ウ　「Ａ体つくり運動遊び」及び「Ａ体つくり運動」から「Ｆ表現遊び」及び「Ｆ表現運動」までと「Ｇ保健」との関連を図る指導を工夫すること。
エ　自然との関わりの深い雪遊び，氷上遊び，スキー，スケート，水辺活動などの指導については，児童の障害の状態等，学校や地域の実態等に応じて積極的に行うことに留意すること。
オ　オリンピック・パラリンピックなどとも関連させ，遊びや運動を「すること」，「知ること」，「見ること」，「応援すること」などにつながるようにすること。"""
            },
            "全体指導計画": """１　指導計画の作成に当たっては，個々の児童の知的障害の状態，生活年齢，学習状況や経験等を考慮しながら，第１の各教科の目標及び内容を基に，６年間を見通して，全体的な指導計画に基づき具体的な指導目標や指導内容を設定するものとする。
２　個々の児童の実態に即して，教科別の指導を行うほか，必要に応じて各教科，道徳科，外国語活動，特別活動及び自立活動を合わせて指導を行うなど，効果的な指導方法を工夫するものとする。その際，各教科等において育成を目指す資質・能力を明らかにし，各教科等の内容間の関連を十分に図るよう配慮するものとする。
３　個々の児童の実態に即して，生活に結び付いた効果的な指導を行うとともに，児童が見通しをもって，意欲をもち主体的に学習活動に取り組むことができるよう指導計画全体を通して配慮するものとする。
４　第１章総則の第２節の２の（2）に示す道徳教育の目標に基づき，道徳科などとの関連を考慮しながら，第３章特別の教科道徳に示す内容について，各教科の特質に応じて適切な指導をするものとする。
５　児童の実態に即して学習環境を整えるなど，安全に留意するものとする。
６　児童の実態に即して自立や社会参加に向けて経験が必要な事項を整理した上で，指導するよう配慮するものとする。
７　学校と家庭等とが連携を図り，児童の学習過程について，相互に共有するとともに，児童が学習の成果を現在や将来の生活に生かすことができるよう配慮するものとする。
８　児童の知的障害の状態や学習状況，経験等に応じて，教材・教具や補助用具などを工夫するとともに，コンピュータや情報通信ネットワークを有効に活用し，指導の効果を高めるようにするものとする。"""
        }
    },
    "中学部": {
        "視覚障害者、聴覚障害者、肢体不自由者又は病弱者": {
            "全体": """各教科の目標，各学年，各分野又は各言語の目標及び内容並びに指導計画の作成と内容の取扱いについては，中学校学習指導要領第２章に示すものに準ずるものとする。
指導計画の作成と内容の取扱いに当たっては，生徒の障害の状態や特性及び心身の発達の段階等を十分考慮するとともに，第２章第１節第１款において特に示している事項に配慮するものとする。"""
        },
        "知的障害者": {
            "国語": {
                "目標": """言葉による見方・考え方を働かせ，言語活動を通して，国語で理解し表現する資質・能力を次のとおり育成することを目指す。
（１）　日常生活や社会生活に必要な国語について，その特質を理解し適切に使うことができるようにする。
（２）　日常生活や社会生活における人との関わりの中で伝え合う力を高め，思考力や想像力を養う。
（３）　言葉がもつよさに気付くとともに，言語感覚を養い，国語を大切にしてその能力の向上を図る態度を養う。""",
                "１段階": {
                    "目標": """ア　日常生活や社会生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しむことができるようにする。
イ　順序立てて考える力や感じたり想像したりする力を養い，日常生活や社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えをもつことができるようにする。
ウ　言葉がもつよさに気付くとともに，図書に親しみ，国語で考えたり伝え合ったりしようとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア　言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）　身近な大人や友達とのやり取りを通して，言葉には，事物の内容を表す働きや，経験したことを伝える働きがあることに気付くこと。
（イ）　発音や声の大きさに気を付けて話すこと。
（ウ）　長音，拗（よう）音，促音，撥（はつ）音，助詞の正しい読み方や書き方を知ること。
（エ）　言葉には，意味による語句のまとまりがあることを理解するとともに，話し方や書き方によって意味が異なる語句があることに気付くこと。
（オ）　主語と述語との関係や接続する語句の役割を理解すること。
（カ）　普通の言葉との違いに気を付けて，丁寧な言葉を使うこと。
（キ）　語のまとまりに気を付けて音読すること。
イ　話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）　事柄の順序など，情報と情報との関係について理解すること。
ウ　我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）　自然や季節の言葉を取り入れた俳句などを聞いたり作ったりして，言葉の響きやリズムに親しむこと。
（イ）　挨拶状などに書かれた語句や文を読んだり書いたりし，季節に応じた表現があることを知ること。
（ウ）　書くことに関する次の事項を取り扱うこと。
　　　㋐　姿勢や筆記具の持ち方を正しくし，文字の形に注意しながら，丁寧に書くこと。
　　　㋑　点画相互の接し方や交わり方，長短や方向などに注意して文字を書くこと。
（エ）　読書に親しみ，簡単な物語や，自然や季節などの美しさを表した詩や紀行文などがあることを知ること。
〔思考力，判断力，表現力等〕
Ａ　聞くこと・話すこと
　　聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア　身近な人の話や簡単な放送などを聞き，聞いたことを書き留めたり分からないことを聞き返したりして，話の大体を捉えること。
イ　話す事柄を思い浮かべ，伝えたいことを決めること。
ウ　見聞きしたことや経験したこと，自分の意見などについて，内容の大体が伝わるように伝える順序等を考えること。
エ　自己紹介や電話の受け答えなど，相手や目的に応じた話し方で話すこと。
オ　相手の話に関心をもち，分かったことや感じたことを伝え合い，考えをもつこと。
Ｂ　書くこと
　　書くことに関する次の事項を身に付けることができるよう指導する。
ア　見聞きしたことや経験したことの中から，伝えたい事柄を選び，書く内容を大まかにまとめること。
イ　相手に伝わるように事柄の順序に沿って簡単な構成を考えること。
ウ　文の構成，語句の使い方に気を付けて書くこと。
エ　自分が書いたものを読み返し，間違いを正すこと。
オ　文章に対する感想をもち，伝え合うこと。
Ｃ　読むこと
　　読むことに関する次の事項を身に付けることができるよう指導する。
ア　簡単な文や文章を読み，情景や場面の様子，登場人物の心情などを想像すること。
イ　語や語句の意味を基に時間的な順序や事柄の順序など内容の大体を捉えること。
ウ　日常生活で必要な語句や文章などを読み，行動すること。
エ　文章を読んで分かったことを伝えたり，感想をもったりすること。"""
                },
                "２段階": {
                    "目標": """ア　日常生活や社会生活，職業生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しむことができるようにする。
イ　筋道立てて考える力や豊かに感じたり想像したりする力を養い，日常生活や社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えをまとめることができるようにする。
ウ　言葉がもつよさに気付くとともに，いろいろな図書に親しみ，国語を大切にして，思いや考えを伝え合おうとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア　言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）　日常生活の中での周りの人とのやり取りを通して，言葉には，考えたことや思ったことを表す働きがあることに気付くこと。
（イ）　発声や発音に気を付けたり，声の大きさを調節したりして話すこと。
（ウ）　長音，拗（よう）音，促音，撥（はつ）音などの表記や助詞の使い方を理解し，文や文章の中で使うこと。
（エ）　理解したり表現したりするために必要な語句の量を増し，使える範囲を広げること。
（オ）　修飾と被修飾との関係，指示する語句の役割について理解すること。
（カ）　敬体と常体があることを理解し，その違いに注意しながら書くこと。
（キ）　内容の大体を意識しながら音読すること。
イ　話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）　考えとそれを支える理由など，情報と情報との関係について理解すること。
（イ）　必要な語や語句の書き留め方や，比べ方などの情報の整理の仕方を理解し使うこと。
ウ　我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）　易しい文語調の短歌や俳句を音読したり暗唱したりするなどして，言葉の響きやリズムに親しむこと。
（イ）　生活に身近なことわざなどを知り，使うことにより様々な表現に親しむこと。
（ウ）　書くことに関する次の事項を取り扱うこと。
　　　㋐　点画の書き方や文字の形に注意しながら，筆順に従って丁寧に書くこと。
　　　㋑　漢字や仮名の大きさ，配列に注意して書くこと。
（エ）　幅広く読書に親しみ，本にはいろいろな種類があることを知ること。
〔思考力，判断力，表現力等〕
Ａ　聞くこと・話すこと
　　聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア　身近な人の話や放送などを聞きながら，聞いたことを簡単に書き留めたり，分からないときは聞き返したりして，内容の大体を捉えること。
イ　相手や目的に応じて，自分の伝えたいことを明確にすること。
ウ　見聞きしたことや経験したこと，自分の意見やその理由について，内容の大体が伝わるように伝える順序や伝え方を考えること。
エ　相手に伝わるように発音や声の大きさ，速さに気を付けて話したり，必要な話し方を工夫したりすること。
オ　物事を決めるために，簡単な役割や進め方に沿って話し合い，考えをまとめること。
Ｂ　書くこと
　　書くことに関する次の事項を身に付けることができるよう指導する。
ア　相手や目的を意識して，見聞きしたことや経験したことの中から書くことを選び，伝えたいことを明確にすること。
イ　書く内容の中心を決め，自分の考えと理由などとの関係を明確にして，文章の構成を考えること。
ウ　事実と自分の考えとの違いなどが相手に伝わるように書き表し方を工夫すること。
エ　文章を読み返す習慣を身に付け，間違いを正したり，語と語との続き方を確かめたりすること。
オ　文章に対する感想を伝え合い，内容や表現のよいところを見付けること。
Ｃ　読むこと
　　読むことに関する次の事項を身に付けることができるよう指導する。
ア　様々な読み物を読み，情景や場面の様子，登場人物の心情などを想像すること。
イ　語と語や文と文との関係を基に，出来事の順序や気持ちの変化など内容の大体を捉えること。
ウ　日常生活や社会生活，職業生活に必要な語句，文章，表示などの意味を読み取り，行動すること。
エ　中心となる語句や文を明確にしながら読むこと。
オ　読んで感じたことや分かったことを伝え合い，一人一人の感じ方などに違いがあることに気付くこと。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，言葉による見方・考え方を働かせ，言語活動を通して，言葉の特徴や使い方などを身に付け自分の思いや考えを深める学習の充実を図ること。
イ　２の各段階の内容の〔知識及び技能〕に示す事項については，〔思考力，判断力，表現力等〕に示す事項の指導を通して指導することを基本とすること。
ウ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ａ聞くこと・話すこと」に関する指導については，生活に必要な話し言葉を身に付け，活用できるよう指導すること。
エ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｂ書くこと」に関する指導については，筆記具を用いる技能の指導に偏ることなく，文章を書く場面を設けるよう工夫すること。
オ　２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｃ読むこと」に関する指導については，発達の段階に応じた様々な文章に接し，日常生活において読書活動を活発に行うようにするとともに，他教科等における読書の指導や学校図書館等における指導との関連を図るようにすること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　２の各段階の内容のうち，文字に関する事項については，次のとおり取り扱うこと。
（ア）　生活場面や関わる相手が多様になることに応じて，平仮名，片仮名，漢字に加えてローマ字などの文字を取り扱うようにすること。
（イ）　これまでに学習した句読点の使い方や長音，撥音などの表記について，中学部においても正しくより適切に用いることができるよう引き続き指導すること。
イ　２の内容の指導に当たっては，学校図書館などを目的をもって計画的に利用しその機能の活用を図るようにすること。その際，本などの種類や配置，探し方について指導するなど，生徒が必要な本を選ぶことができるよう配慮すること。
ウ　教材の取扱いについては，次の事項に留意すること。
（ア）　生徒の障害の状態や特性及び心身の発達の段階等に応じ，興味・関心のある話題や身近な題材から，日常生活や社会生活及び職業生活に関連する題材まで，様々な種類や形式の文，文章を取り扱う機会を設けること。
（イ）　読み物教材としては，登場人物の行動や言葉から心情を読み取りやすいものや，情景が思い浮かびやすいものを選ぶこと。また，生徒の生活範囲が広がり，生活する力が高まるような内容の教材を選ぶこと。"""
            },
            "社会": {
                "目標": """社会的な見方・考え方を働かせ，社会的事象について関心をもち，具体的に考えたり関連付けたりする活動を通して，自立し生活を豊かにするとともに，平和で民主的な国家及び社会の形成者に必要な公民としての資質・能力の基礎を次のとおり育成することを目指す。
（１）　地域や我が国の国土の地理的環境，現代社会の仕組みや役割，地域や我が国の歴史や伝統と文化及び外国の様子について，具体的な活動や体験を通して理解するとともに，経験したことと関連付けて，調べまとめる技能を身に付けるようにする。
（２）　社会的事象について，自分の生活と結び付けて具体的に考え，社会との関わりの中で，選択・判断したことを適切に表現する力を養う。
（３）　社会に主体的に関わろうとする態度を養い，地域社会の一員として人々と共に生きていくことの大切さについての自覚を養う。""",
                "１段階": {
                    "目標": """日常生活に関わる社会的事象が分かり，地域社会の一員としての資質・能力の基礎を次のとおり育成することを目指す。
ア　身近な地域や市区町村の地理的環境，地域の安全を守るための諸活動，地域の産業と消費生活の様子及び身近な地域の様子の移り変わり並びに社会生活に必要なきまり，公共施設の役割及び外国の様子について，具体的な活動や体験を通して，自分との関わりが分かるとともに，調べまとめる技能を身に付けるようにする。
イ　社会的事象について，自分の生活や地域社会と関連付けて具体的に考えたことを表現する基礎的な力を養う。
ウ　身近な社会に自ら関わろうとする意欲をもち，地域社会の中で生活することの大切さについての自覚を養う。""",
                    "内容": """ア　社会参加ときまり
（ア）　社会参加するために必要な集団生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　学級や学校の中で，自分の意見を述べたり相手の意見を聞いたりするなど，集団生活の中での役割を果たすための知識や技能を身に付けること。
　㋑　集団生活の中で何が必要かに気付き，自分の役割を考え，表現すること。
（イ）　社会生活に必要なきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　家庭や学校でのきまりを知り，生活の中でそれを守ることの大切さが分かること。
　㋑　社会生活ときまりとの関連を考え，表現すること。
イ　公共施設と制度
（ア）　公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　身近な公共施設や公共物の役割が分かること。
　㋑　公共施設や公共物について調べ，それらの役割を考え，表現すること。
（イ）　制度の仕組みに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　身近な生活に関する制度が分かること。
　㋑　身近な生活に関する制度について調べ，自分との関わりを考え，表現すること。
ウ　地域の安全
（ア）　地域の安全に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　地域の安全を守るため，関係機関が地域の人々と協力していることが分かること。
　㋑　地域における災害や事故に対する施設・設備などの配置，緊急時への備えや対応などに着目して，関係機関や地域の人々の諸活動を捉え，そこに関わる人々の働きを考え，表現すること。
エ　産業と生活
（ア）　仕事と生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　生産の仕事は，地域の人々の生活と密接な関わりをもって行われていることが分かること。
　㋑　仕事の種類や工程などに着目して，生産に携わっている人々の仕事の様子を捉え，地域の人々の生活との関連を考え，表現すること。
（イ）　身近な産業と生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　販売の仕事は，消費者のことを考え，工夫して行われていることが分かること。
　㋑　消費者の願いや他地域との関わりなどに着目して，販売の仕事に携わっている人々の仕事の様子を捉え，それらの仕事に見られる工夫を考え，表現すること。
オ　我が国の地理や歴史
（ア）　身近な地域や市区町村（以下第２章第２節第２款において「市」という。）の様子に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　身近な地域や自分たちの市の様子が分かること。
　㋑　都道府県（以下第２章第２節第２款第１〔社会〕（2）内容において「県」という。）内における市の位置や市の地形，土地利用などに着目して，身近な地域や市の様子を捉え，場所による違いを考え，表現すること。
（イ）　身近な地域の移り変わりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　身近な地域や自分たちの市の様子，人々の生活は，時間とともに移り変わってきたことを知ること。
　㋑　交通や人口，生活の道具などの時期による違いに着目して，市や人々の生活の様子を捉え，それらの変化を考え，表現すること。
カ　外国の様子
（ア）　世界の中の日本と国際交流に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　文化や風習の特徴や違いを知ること。
　㋑　そこに暮らす人々の生活などに着目して，日本との違いを考え，表現すること。"""
                },
                "２段階": {
                    "目標": """日常生活に関わる社会的事象について理解し，地域社会の一員としての資質・能力の基礎を次のとおり育成することを目指す。
ア　自分たちの都道府県の地理的環境の特色，地域の人々の健康と生活環境を支える役割，自然災害から地域の安全を守るための諸活動及び地域の伝統と文化並びに社会参加するためのきまり，社会に関する基本的な制度及び外国の様子について，具体的な活動や体験を通して，人々の生活との関連を踏まえて理解するとともに，調べまとめる技能を身に付けるようにする。
イ　社会的事象について，自分の生活や地域社会と関連付けて具体的に考えたことを表現する力を養う。
ウ　社会に自ら関わろうとする意欲をもち，地域社会の中で生活することの大切さについての自覚を養う。""",
                    "内容": """ア　社会参加ときまり
（ア）　社会参加するために必要な集団生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　学級や学校の中で，意見を述べ合い，助け合い，協力しながら生活する必要性を理解し，そのための知識や技能を身に付けること。
　㋑　周囲の状況を判断し，集団生活の中での自分の役割と責任について考え，表現すること。
（イ）　社会生活に必要なきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　家庭や学校，地域社会でのきまりは，社会生活を送るために必要であることを理解すること。
　㋑　社会生活に必要なきまりの意義について考え，表現すること。
イ　公共施設と制度
（ア）　公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　自分の生活の中での公共施設や公共物の役割とその必要性を理解すること。
　㋑　公共施設や公共物の役割について調べ，生活の中での利用を考え，表現すること。
（イ）　制度の仕組みに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　社会に関する基本的な制度について理解すること。
　㋑　社会に関する基本的な制度について調べ，それらの意味を考え，表現すること。
ウ　地域の安全
（ア）　地域の安全に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　地域の関係機関や人々は，過去に発生した地域の自然災害や事故に対し，様々な協力をして対処してきたことや，今後想定される災害に対し，様々な備えをしていることを理解すること。
　㋑　過去に発生した地域の自然災害や事故，関係機関の協力などに着目して，危険から人々を守る活動と働きを考え，表現すること。
エ　産業と生活
（ア）　県内の特色ある地域に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　地域では，人々が協力し，産業の発展に努めていることを理解すること。
　㋑　人々の活動や産業の歴史的背景などに着目して，地域の様子を捉え，それらの特色を考え，表現すること。
（イ）　生活を支える事業に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　水道，電気及びガスなどの生活を支える事業は，安全で安定的に供給や処理できるよう実施されていることや，地域の人々の健康な生活の維持と向上に役立っていることを理解すること。
　㋑　供給や処理の仕組みや関係機関の協力などに着目して，水道，電気及びガスなどの生活を支える事業の様子を捉え，それらの事業が果たす役割を考え，表現すること。
オ　我が国の地理や歴史
（ア）　身近な地域に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　自分たちの県の概要を理解すること。
　㋑　我が国における自分たちの県の位置，県全体の地形などに着目して，県の様子を捉え，地理的環境の特色を考え，表現すること。
（イ）　県内の伝統や文化，先人の働きや出来事に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　県内の主な歴史を手掛かりに，先人の働きや出来事，文化遺産などを知ること。
　㋑　歴史的背景や現在に至る経緯などに着目し，県内の文化財や年中行事の様子を捉え，それらの特色を考え，表現すること。
カ　外国の様子
（ア）　世界の中の日本と国際交流に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　文化や風習の特徴や違いを理解すること。
　㋑　人々の生活や習慣などに着目して，多様な文化について考え，表現すること。
（イ）　世界の様々な地域に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
　㋐　人々の生活の様子を大まかに理解すること。
　㋑　世界の出来事などに着目して，それらの国の人々の生活の様子を捉え，交流することの大切さを考え，表現すること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，生活に即した具体的で分かりやすい内容を取り上げ，社会的事象の見方・考え方を働かせ，事象の特色や意味などを考え，説明したり表現したりするなど，自ら意欲的に取り組むことのできる活動の充実を図ること。
イ　各教科等との関連を図り，指導の効果を高めるようにするとともに，小学部の生活科の学習との関連を踏まえて，系統的・発展的に指導できるようにすること。
ウ　コンピュータや情報通信ネットワークなどを活用して，情報の収集やまとめなどを行うようにすること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　各学校においては，地域の実態を生かして，生徒が興味・関心をもって学習に取り組めるようにするとともに，観察や見学，聞き取りなどの調査活動を含む具体的な体験を伴う学習を通し，自分の生活と結び付けて考えたことをまとめることで知識が深まるようにすること。
イ　２の内容については，次の事項について配慮するものとする。
（ア）　アについては，集団生活を送る上で必要とされる人との関わりやきまりを守ることについて理解できるようにするとともに，主体的に社会参加するための基礎的な力を養うこと。
（イ）　イについては，身近な公共施設を取り上げ，その役割や利用できる制度を知ることで，よりよい社会生活を送ることができるようにすること。
（ウ）　ウについては，地域の実態に応じて，地震災害，津波災害，風水害，火山災害，雪害などの中から取り上げ，地域や自分自身の安全を守るために自分たちにできることなどを考えたり選択・判断したりできるようにすること。
（エ）　エについては，身近な仕事を通して生産や販売について関心をもつこと。また，生活を支える事業について取り扱うことで，節水や節電の必要性を感じて取り組もうとすること。
（オ）　オについては，地図の扱いに慣れるようにすること。また，主な文化財や年中行事の中から具体的事例を取り上げ，その特色が大まかに分かるようにすること。
（カ）　カについては，我が国や諸外国には国旗があることを理解し，それを尊重する態度を養うようにすること。"""
            },
            "数学": {
                "目標": """数学的な見方・考え方を働かせ，数学的活動を通して，数学的に考える資質・能力を次のとおり育成することを目指す。
（１）　数量や図形などについての基礎的・基本的な概念や性質などを理解し，事象を数理的に処理する技能を身に付けるようにする。
（２）　日常の事象を数理的に捉え見通しをもち筋道を立てて考察する力，基礎的・基本的な数量や図形の性質などを見いだし統合的・発展的に考察する力，数学的な表現を用いて事象を簡潔・明瞭・的確に表現する力を養う。
（３）　数学的活動の楽しさや数学のよさに気付き，学習を振り返ってよりよく問題を解決しようとする態度，数学で学んだことを生活や学習に活用しようとする態度を養う。""",
                "１段階": {
                    "目標": """Ａ　数と計算
ア　３位数程度の整数の概念について理解し，数に対する感覚を豊かにするとともに，加法，減法及び乗法の意味や性質について理解し，これらを計算することについての技能を身に付けるようにする。
イ　数とその表現や数の関係に着目し，具体物や図などを用いて，数の表し方や計算の仕方などを筋道立てて考えたり，関連付けて考えたりする力を養う。
ウ　数量に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさに気付き，そのことを生活や学習に活用しようとする態度を養う。
Ｂ　図形
ア　三角形や四角形，箱の形などの基本的な図形について理解し，図形についての感覚を豊かにするとともに，図形を作図したり，構成したりすることなどについての技能を身に付けるようにする。
イ　三角形や四角形，箱の形などの基本的な図形を構成する要素に着目して，平面図形の特徴を捉えたり，身の回りの事象を図形の性質から関連付けて考えたりする力を養う。
ウ　図形に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさに気付き，そのことを生活や学習に活用しようとする態度を養う。
Ｃ　測定
ア　身の回りにある長さ，体積，重さ及び時間の単位と測定の意味について理解し，量の大きさについての感覚を豊かにするとともに，それらを測定することについての技能を身に付けるようにする。
イ　身の回りの事象を量に着目して捉え，量の単位を用いて的確に表現する力を養う。
ウ　数量や図形に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさに気付き，そのことを生活や学習に活用しようとする態度を養う。
Ｄ　データの活用
ア　身の回りにあるデータを分類整理して簡単な表やグラフに表したり，それらを問題解決において用いたりすることについての技能を身に付けるようにする。
イ　身の回りの事象を，データの特徴に着目して捉え，簡潔に表現したり，考察したりする力を養う。
ウ　データの活用に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさに気付き，そのことを生活や学習に活用しようとする態度を養う。""",
                    "内容": """Ａ　数と計算
ア　整数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　1000までの数をいくつかの同じまとまりに分割したうえで数えたり，分類して数えたりすること。
　㋑　３位数の表し方について理解すること。
　㋒　数を十や百を単位としてみるなど，数の相対的な大きさについて理解すること。
　㋓　３位数の数系列，順序，大小について，数直線上の目盛りを読んで理解したり，数を表したりすること。
　㋔　一つの数をほかの数の積としてみるなど，ほかの数と関係付けてみること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数のまとまりに着目し，考察する範囲を広げながら数の大きさの比べ方や数え方を考え，日常生活で生かすこと。
イ　整数の加法及び減法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　２位数の加法及び減法について理解し，その計算ができること。また，それらの筆算の仕方について知ること。
　㋑　簡単な場合について３位数の加法及び減法の計算の仕方を知ること。
　㋒　加法及び減法に関して成り立つ性質について理解すること。
　㋓　計算機を使って，具体的な生活場面における簡単な加法及び減法の計算ができること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，数を適用する範囲を広げ，計算に関して成り立つ性質や計算の仕方を見いだすとともに，日常生活で生かすこと。
ウ　整数の乗法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　乗法が用いられる場合や意味について知ること。
　㋑　乗法が用いられる場面を式に表したり，式を読み取ったりすること。
　㋒　乗法に関して成り立つ簡単な性質について理解すること。
　㋓　乗法九九について知り，１位数と１位数との乗法の計算ができること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，計算に関して成り立つ性質や計算の仕方を見いだすとともに，日常生活で生かすこと。
Ｂ　図形
ア　図形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　直線について知ること。
　㋑　三角形や四角形について知ること。
　㋒　正方形，長方形及び直角三角形について知ること。
　㋓　正方形や長方形で捉えられる箱の形をしたものについて理解し，それらを構成したり，分解したりすること。
　㋔　直角，頂点，辺及び面という用語を用いて図形の性質を表現すること。
　㋕　基本的な図形が分かり，その図形をかいたり，簡単な図表を作ったりすること。
　㋖　正方形，長方形及び直角三角形をかいたり，作ったり，それらを使って平面に敷き詰めたりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　図形を構成する要素に着目し，構成の仕方を考えるとともに，図形の性質を見いだし，身の回りのものの形を図形として捉えること。
Ｃ　測定
ア　量の単位と測定に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　目盛の原点を対象の端に当てて測定すること。
　㋑　長さの単位［ミリメートル（mm），センチメートル（cm），メートル（m），キロメートル（km）］や重さの単位［グラム（g），キログラム（kg）］について知り，測定の意味を理解すること。
　㋒　かさの単位［ミリリットル（mL），デシリットル（dL），リットル（L）］について知り，測定の意味を理解すること。
　㋓　長さ，重さ及びかさについて，およその見当を付け，単位を選択したり，計器を用いて測定したりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　身の回りのものの特徴に着目し，目的に適した単位で量の大きさを表現したり，比べたりすること。
イ　時刻や時間に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　時間の単位（秒）について知ること。
　㋑　日常生活に必要な時刻や時間を求めること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　時間の単位に着目し，簡単な時刻や時間の求め方を日常生活に生かすこと。
Ｄ　データの活用
ア　身の回りにあるデータを簡単な表やグラフで表したり，読み取ったりすることに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　身の回りにある数量を簡単な表やグラフに表したり，読み取ったりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　身の回りの事象に関するデータを整理する観点に着目し，簡単な表やグラフを用いながら読み取ったり，考察したりすること。
〔数学的活動〕
ア　内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ測定」及び「Ｄデータの活用」に示す学習については，次のような数学的活動に取り組むものとする。
（ア）　日常生活の事象から見いだした数学の問題を，具体物や図，式などを用いて解決し，結果を確かめたり，日常生活に生かしたりする活動
（イ）　問題解決した過程や結果を，具体物や図，式などを用いて表現し伝え合う活動"""
                },
                "２段階": {
                    "目標": """Ａ　数と計算
ア　整数の概念や性質について理解を深め，数に対する感覚を豊かにするとともに，加法，減法，乗法及び除法の意味や性質について理解し，それらの計算ができるようにする。また，小数及び分数の意味や表し方について知り，数量とその関係を表したり読み取ったりすることができるようにすることについての技能を身に付けるようにする。
イ　数を構成する単位に着目して，数の表し方やその数について考えたり，扱う数の範囲を広げ，計算の仕方を見いだし，筋道立てて考えたりするとともに，日常生活の問題場面を数量に着目して捉え，処理した結果を場面をもとに振り返り，解釈及び判断する力を養う。
ウ　数量に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさを理解し，そのことを生活や学習に活用しようとする態度を養う。
Ｂ　図形
ア　二等辺三角形や正三角形などの基本的な図形や面積，角の大きさについて理解し，図形についての感覚を豊かにするとともに，図形を作図や構成したり，図形の面積や角の大きさを求めたりすることなどについての技能を身に付けるようにする。
イ　二等辺三角形や正三角形などの基本的な図形を構成する要素に着目して，平面図形の特徴を捉えたり，身の回りの事象を図形の性質から考察したりする力，図形を構成する要素に着目し，図形の計量について考察する力を養う。
ウ　図形や数量に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさを理解し，そのことを生活や学習に活用しようとする態度を養う。
Ｃ　変化と関係
ア　二つの数量の関係や変化の様子を表や式，グラフで表すことについて理解するとともに，二つの数量の関係を割合によって比べることについての技能を身に付けるようにする。
イ　伴って変わる二つの数量の関係に着目し，変化の特徴に気付き，二つの数量の関係を表や式，グラフを用いて考察したり，割合を用いて考察したりする力を養う。
ウ　数量に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさを理解し，そのことを生活や学習に活用しようとする態度を養う。
Ｄ　データの活用
ア　データを表や棒グラフ，折れ線グラフで表す表し方や読み取り方を理解し，それらを問題解決における用い方についての技能を身に付けるようにする。
イ　身の回りの事象について整理されたデータの特徴に着目し，事象を簡潔に表現したり，適切に判断したりする力を養う。
ウ　データの活用に進んで関わり，数学的に表現・処理するとともに，数学で学んだことのよさを理解し，そのことを生活や学習に活用しようとする態度を養う。""",
                    "内容": """Ａ　数と計算
ア　整数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　４位数までの十進位取り記数法による数の表し方及び数の大小や順序について，理解すること。
　㋑　10倍，100倍，1/10の大きさの数及びその表し方について知ること。
　㋒　数を千を単位としてみるなど，数の相対的な大きさについて理解を深めること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数のまとまりに着目し，考察する範囲を広げながら数の大きさの比べ方や数え方を考え，日常生活で生かすこと。
イ　整数の加法及び減法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　３位数や４位数の加法及び減法の計算の仕方について理解し，計算ができること。また，それらの筆算についての仕方を知ること。
　㋑　加法及び減法に関して成り立つ性質を理解すること。
　㋒　計算機を使って，具体的な生活場面における加法及び減法の計算ができること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，数の適用範囲を広げ，計算に関して成り立つ性質や計算の仕方を見いだすとともに，日常生活で生かすこと。
ウ　整数の乗法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　１位数と１位数との乗法の計算ができ，それを適切に用いること。
　㋑　交換法則や分配法則といった乗法に関して成り立つ性質を理解すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，計算に関して成り立つ性質や計算の仕方を見いだすとともに，日常生活で生かすこと。
エ　整数の除法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　除法が用いられる場合や意味について理解すること。
　㋑　除法が用いられる場面を式に表したり，式を読み取ったりすること。
　㋒　除法と乗法との関係について理解すること。
　㋓　除数と商が共に１位数である除法の計算ができること。
　㋔　余りについて知り，余りの求め方が分かること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，計算に関して成り立つ性質や計算の仕方を見いだすとともに，日常生活に生かすこと。
オ　小数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　端数部分の大きさを表すのに小数を用いることを知ること。
　㋑　1/10の位までの小数の仕組みや表し方について理解すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数のまとまりに着目し，数の表し方の適用範囲を広げ，日常生活に生かすこと。
カ　分数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　1/2，1/4など簡単な分数について知ること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数のまとまりに着目し，数の表し方の適用範囲を広げ，日常生活に生かすこと。
キ　数量の関係を表す式に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　数量の関係を式に表したり，式と図を関連付けたりすること。
　㋑　□などを用いて数量の関係を式に表すことができることを知ること。
　㋒　□などに数を当てはめて調べること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　数量の関係に着目し，事柄や関係を式や図を用いて簡潔に表したり，式と図を関連付けて式を読んだりすること。
Ｂ　図形
ア　図形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　二等辺三角形，正三角形などについて知り，作図などを通してそれらの関係に着目すること。
　㋑　二等辺三角形や正三角形を定規とコンパスなどを用いて作図すること。
　㋒　基本的な図形と関連して角について知ること。
　㋓　直線の平行や垂直の関係について理解すること。
　㋔　円について，中心，半径及び直径を知ること。また，円に関連して，球についても直径などを知ること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　図形を構成する要素及びそれらの位置関係に着目し，構成の仕方を考察して，図形の性質を見いだすとともに，その性質を基に既習の図形を捉え直すこと。
イ　面積に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　面積の単位［平方センチメートル（ ），平方メートル（㎡），平方キロメートル（ ）］について知り，測定の意味について理解すること。
　㋑　正方形及び長方形の面積の求め方について知ること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　面積の単位に着目し，図形の面積について，求め方を考えたり，計算して表したりすること。
ウ　角の大きさに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　角の大きさを回転の大きさとして捉えること。
　㋑　角の大きさの単位（度（°））について知り，測定の意味について理解すること。
　㋒　角の大きさを測定すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　角の大きさの単位に着目し，図形の角の大きさを的確に表現して比較したり，図形の考察に生かしたりすること。
Ｃ　変化と関係
ア　伴って変わる二つの数量に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　変化の様子を表や式を用いて表したり，変化の特徴を読み取ったりすること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　伴って変わる二つの数量の関係に着目し，表や式を用いて変化の特徴を考察すること。
イ　二つの数量の関係に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　簡単な場合について，ある二つの数量の関係と別の二つの数量の関係とを比べる場合に割合を用いる場合があることを知ること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　日常生活における数量の関係に着目し，図や式を用いて，二つの数量の関係を考察すること。
Ｄ　データの活用
ア　データを表やグラフで表したり，読み取ったりすることに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のような知識及び技能を身に付けること。
　㋐　データを日時や場所などの観点から分類及び整理し，表や棒グラフで表したり，読んだりすること。
　㋑　データを二つの観点から分類及び整理し，折れ線グラフで表したり，読み取ったりすること。
　㋒　表や棒グラフ，折れ線グラフの意味やその用い方を理解すること。
（イ）　次のような思考力，判断力，表現力等を身に付けること。
　㋐　身の回りの事象に関するデータを整理する観点に着目し，表や棒グラフを用いながら，読み取ったり，考察したり，結論を表現したりすること。
　㋑　目的に応じてデータを集めて分類及び整理し，データの特徴や傾向を見付けて，適切なグラフを用いて表現したり，考察したりすること。
〔数学的活動〕
ア　内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」に示す学習については，次のような数学的活動に取り組むものとする。
（ア）　身の回りの事象を観察したり，具体物を操作したりして，数学の学習に関わる活動
（イ）　日常の事象から見いだした数学の問題を，具体物や図，表及び式などを用いて解決し，結果を確かめたり，日常生活に生かしたりする活動
（ウ）　問題解決した過程や結果を，具体物や図，表，式などを用いて表現し伝え合う活動"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育むべき資質・能力の育成に向けて，数学的活動を通して，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，数学的な見方・考え方を働かせながら，日常の事象を数学的に捉え，数学の問題を見いだし，問題を自立的，協働的に解決し，学習の過程を振り返り，概念を形成するなどの学習の充実を図ること。
イ　数量や図形についての基礎的な能力の維持や向上を図るため，適宜練習の機会を設けて計画的に指導すること。また，段階間の指導内容を円滑に接続させるため，適切な反復による学習指導を進めるようにすること。
ウ　２の内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ測定」，「Ｃ変化と関係」及び「Ｄデータの活用」の指導の間の関連を図ること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　思考力，判断力，表現力等を育成するため，各段階の内容の指導に当たっては，具体物，言葉，数，式，図，表，グラフなどを用いて考えたり，説明したり，互いに自分の考えを表現し伝え合ったりするなどの学習活動を積極的に取り入れるようにすること。
イ　「Ａ数と計算」の指導に当たっては，具体物などの教具を適宜用いて，数と計算についての意味の理解を深めるよう留意すること。
ウ　１段階の内容に示す事項については，次のアからウまでに留意するものとする。
（ア）　内容の「Ａ数と計算」のイについては，必要な場合には，（　）や□などを用いることができるものとする。
（イ）　内容の「Ｃ測定」のア及び「Ｄデータの活用」のアについては，必要な場合には，温度計や体温計の目盛りの読み方やデータのまとめ方を取り扱うものとする。
（ウ）　内容の「Ｃ測定」のアのアの については，任意の単位を用いた比較や基準容器で正確に計量する技能を指導することに配慮するものとする。
エ　２段階の内容に示す事項については，次のアからウまでに留意するものとする。
（ア）　内容の「Ａ数と計算」のイ及びウについては，簡単な計算は暗算でできるよう配慮するものとする。また，計算の結果の見積もりについても触れるものとする。
（イ）　内容の「Ｂ図形」のアのアの基本的な図形については，定規，コンパスなどを用いて，図形をかいたり確かめたりする活動を通して，図形に関心をもたせるよう配慮するものとする。コンパスを取り扱う際には，生徒の障害の状態等に配慮するものとする。
（ウ）　内容の「Ｄデータの活用」のアについては，いろいろな表やグラフに触れるとともに，式やグラフが，事象の変化や全体の傾向をつかむのに便利であることに気付くよう配慮するものとする。
（３）　数学的活動の指導に当たっては，次の事項に配慮するものとする。
ア　数学的活動は，基礎的・基本的な知識及び技能を確実に身に付けたり，思考力，判断力，表現力等を高めたり，数学を学ぶことの楽しさを実感したりするために，重要な役割を果たすものであることから，２の内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ測定」，「Ｃ変化と関係」及び「Ｄデータの活用」に示す事項については，数学的活動を通して指導するようにすること。
イ　数学的活動を楽しめるようにするとともに，数学を生活に活用することなどについて実感する機会を設けること。"""
            },
            "理科": {
                "目標": """自然に親しみ，理科の見方・考え方を働かせ，見通しをもって，観察，実験を行うことなどを通して，自然の事物・現象についての問題を科学的に解決するために必要な資質・能力を次のとおり育成することを目指す。
（１）　自然の事物・現象についての基本的な理解を図り，観察，実験などに関する初歩的な技能を身に付けるようにする。
（２）　観察，実験などを行い，疑問をもつ力と予想や仮説を立てる力を養う。
（３）　自然を愛する心情を養うとともに，学んだことを主体的に日常生活や社会生活などに生かそうとする態度を養う。""",
                "１段階": {
                    "目標": """Ａ　生命
ア　身の回りの生物の様子について気付き，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　身の回りの生物の様子から，主に差異点や共通点に気付き，疑問をもつ力を養う。
ウ　身の回りの生物の様子について進んで調べ，生物を愛護する態度や学んだことを日常生活などに生かそうとする態度を養う。
Ｂ　地球・自然
ア　太陽と地面の様子について気付き，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　太陽と地面の様子から，主に差異点や共通点に気付き，疑問をもつ力を養う。
ウ　太陽と地面の様子について進んで調べ，学んだことを日常生活などに生かそうとする態度を養う。
Ｃ　物質・エネルギー
ア　物の性質，風やゴムの力の働き，光や音の性質，磁石の性質及び電気の回路について気付き，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　物の性質，風やゴムの力の働き，光や音の性質，磁石の性質及び電気の回路から，主に差異点や共通点に気付き，疑問をもつ力を養う。
ウ　物の性質，風やゴムの力の働き，光や音の性質，磁石の性質及び電気の回路について進んで調べ，学んだことを日常生活などに生かそうとする態度を養う。""",
                    "内容": """Ａ　生命
ア　身の回りの生物
身の回りの生物について，探したり育てたりする中で，生物の姿に着目して，それらを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　生物は，色，形，大きさなど，姿に違いがあること。
　㋑　昆虫や植物の育ち方には一定の順序があること。
（イ）　身の回りの生物について調べる中で，差異点や共通点に気付き，生物の姿についての疑問をもち，表現すること。
Ｂ　地球・自然
ア　太陽と地面の様子
太陽と地面の様子との関係について，日なたと日陰の様子に着目して，それらを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　日陰は太陽の光を遮るとできること。
　㋑　地面は太陽によって暖められ，日なたと日陰では地面の暖かさに違いがあること。
（イ）　日なたと日陰の様子について調べる中で，差異点や共通点に気付き，太陽と地面の様子との関係についての疑問をもち，表現すること。
Ｃ　物質・エネルギー
ア　物と重さ
物の性質について，形や体積に着目して，重さを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　物は，形が変わっても重さは変わらないこと。
　㋑　物は，体積が同じでも重さは違うことがあること。
（イ）　物の形や体積と重さとの関係について調べる中で，差異点や共通点に気付き，物の性質についての疑問をもち，表現すること。
イ　風やゴムの力の働き
風やゴムの力の働きについて，力と物の動く様子に着目して，それらを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　風の力は，物を動かすことができること。また，風の力の大きさを変えると，物が動く様子も変わること。
　㋑　ゴムの力は，物を動かすことができること。また，ゴムの力の大きさを変えると，物が動く様子も変わること。
（イ）　風やゴムの力で物が動く様子について調べる中で，差異点や共通点に気付き，風やゴムの力の働きについての疑問をもち，表現すること。
ウ　光や音の性質
光や音の性質について，光を当てたときの明るさや暖かさ，音を出したときの震え方に着目して，光の強さや音の大きさを変えたときの違いを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　日光は直進すること。
　㋑　物に日光を当てると，物の明るさや暖かさが変わること。
　㋒　物から音が出たり伝わったりするとき，物は震えていること。
（イ）　光を当てたときの明るさや暖かさの様子，音を出したときの震え方の様子について調べる中で，差異点や共通点に気付き，光や音の性質についての疑問をもち，表現すること。
エ　磁石の性質
磁石の性質について，磁石を身の回りの物に近付けたときの様子に着目して，それらを比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　磁石に引き付けられる物と引き付けられない物があること。
　㋑　磁石の異極は引き合い，同極は退け合うこと。
（イ）　磁石を身の回りの物に近付けたときの様子について調べる中で，差異点や共通点に気付き，磁石の性質についての疑問をもち，表現すること。
オ　電気の通り道
電気の回路について，乾電池と豆電球などのつなぎ方と，乾電池につないだ物の様子に着目して，電気を通すときと通さないときのつなぎ方を比較しながら調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　電気を通すつなぎ方と通さないつなぎ方があること。
　㋑　電気を通す物と通さない物があること。
（イ）　乾電池と豆電球などをつないだときの様子について調べる中で，差異点や共通点に気付き，電気の回路についての疑問をもち，表現すること。""",
                    "指導計画の作成と内容の取扱い": """ア　（２）の「Ａ生命」のアの「身の回りの生物」については，次のとおり取り扱うものとする。
（ア）　（ア）の㋑については，飼育，栽培を通して行うこと。
（イ）　（ア）の㋑の「植物の育ち方」については，夏生一年生の双子葉植物を扱うこと。
イ　（２） の「Ｂ地球・自然」のアの「太陽と地面の様子」については，太陽の位置は，東から南，西へと変化することを取り扱うものとする。
ウ　（２）の「Ｃ物質・エネルギー」の指導に当たっては，ものづくりを通して行うよう配慮すること。"""
                },
                "２段階": {
                    "目標": """Ａ　生命
ア　人の体のつくりと運動，動物の活動や植物の成長と環境との関わりについての理解を図り，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　人の体のつくりと運動，動物の活動や植物の成長と環境との関わりについて，疑問をもったことについて既習の内容や生活経験を基に予想する力を養う。
ウ　人の体のつくりと運動，動物の活動や植物の成長と環境の関わりについて見いだした疑問を進んで調べ，生物を愛護する態度や学んだことを日常生活や社会生活などに生かそうとする態度を養う。
Ｂ　地球・自然
ア　雨水の行方と地面の様子，気象現象，月や星についての理解を図り，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　雨水の行方と地面の様子，気象現象，月や星について，疑問をもったことについて既習の内容や生活経験を基に予想する力を養う。
ウ　雨水の行方と地面の様子，気象現象，月や星について見いだした疑問を進んで調べ，学んだことを日常生活や社会生活などに生かそうとする態度を養う。
Ｃ　物質・エネルギー
ア　水や空気の性質についての理解を図り，観察，実験などに関する初歩的な技能を身に付けるようにする。
イ　水や空気の性質について，疑問をもったことについて既習の内容や生活経験を基に予想する力を養う。
ウ　水や空気の性質について見いだした疑問を進んで調べ，学んだことを日常生活や社会生活などに生かそうとする態度を養う。""",
                    "内容": """Ａ　生命
ア　人の体のつくりと運動
人や他の動物について，骨や筋肉のつくりと働きに着目して，それらを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　人の体には骨と筋肉があること。
　㋑　人が体を動かすことができるのは，骨，筋肉の働きによること。
（イ）　人や他の動物の骨や筋肉のつくりと働きについて調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。
イ　季節と生物
身近な動物や植物について，探したり育てたりする中で，動物の活動や植物の成長と季節の変化に着目して，それらを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　動物の活動は，暖かい季節，寒い季節などによって違いがあること。
　㋑　植物の成長は，暖かい季節，寒い季節などによって違いがあること。
（イ）　身近な動物の活動や植物の成長の変化について調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。
Ｂ　地球・自然
ア　雨水の行方と地面の様子
雨水の行方と地面の様子について, 流れ方やしみ込み方に着目して，それらと地面の傾きや土の粒の大きさとを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　水は，高い場所から低い場所へと流れて集まること。
　㋑　水のしみ込み方は，土の粒の大きさによって違いがあること。
（イ）　雨水の流れ方やしみ込み方と地面の傾きや土の粒の大きさとの関係について調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。
イ　天気の様子
天気や自然界の水の様子について，気温や水の行方に着目して，それらと天気の様子や水の状態変化とを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　天気によって１日の気温の変化の仕方に違いがあること。
　㋑　水は，水面や地面などから蒸発し，水蒸気になって空気中に含まれていくこと。
（イ）　天気の様子や水の状態変化と気温や水の行方との関係について調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。
ウ　月と星
月や星の特徴について，位置の変化や時間の経過に着目して，それらを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　月は日によって形が変わって見え，１日のうちでも時刻によって位置が変わること。
　㋑　空には，明るさや色の違う星があること。
（イ）　月の位置の変化と時間の経過との関係について調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。
Ｃ　物質・エネルギー
ア　水や空気と温度
水や空気の性質について，体積や状態の変化に着目して，それらと温度の変化とを関係付けて調べる活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　次のことを理解するとともに，観察，実験などに関する初歩的な技能を身に付けること。
　㋐　水や空気は，温めたり冷やしたりすると，その体積が変わること。
　㋑　水は，温度によって水蒸気や氷に変わること。
（イ）　水や空気の体積や状態の変化について調べる中で，見いだした疑問について，既習の内容や生活経験を基に予想し，表現すること。""",
                    "指導計画の作成と内容の取扱い": """ア　（２）の「Ａ生命」のアの「人の体のつくりと運動」のアの については，関節の働きを扱うものとすること。
イ　（２）の「Ａ生命」のイの「季節と生物」については，１年を通しての動物の活動や植物の成長を観察や映像資料などで指導するものとする。
ウ　（２）の「Ｂ地球・自然」のイの「天気の様子」のアの については，２つのデータを同時に扱うようなグラフや表は扱わないこと。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，理科の学習過程の特質を踏まえ，理科の見方・考え方を働かせ，見通しをもって観察，実験を行うなどの，問題を科学的に解決しようとする学習活動の充実を図ること。
イ　各段階で育成を目指す思考力，判断力，表現力等については，当該段階において育成することを目指す力のうち，主なものを示したものであり，実際の指導に当たっては，他の段階で掲げている力の育成についても十分に配慮すること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　実験を行うに当たっては，身の回りのことや生活に関わる簡単なものを取り扱うこと。
イ　生物，天気などに関する指導に当たっては，自然に親しむ活動や体験的な活動を多く取り入れるとともに，生命を尊重し，身の回りの自然環境の保全に寄与する態度を養うようにすること。
ウ　天気などに関する指導に当たっては，災害に関する基礎的な理解が図られるようにすること。
エ　理科で学習することが様々な職業などと関係していることにも触れること。
オ　博物館や科学学習センターなどと連携，協力を図ること。
（３）　観察，実験などの指導に当たっては，事故防止に十分留意すること。また，環境整備に十分配慮すること。"""
            },
            "美術": {
                "目標": """表現及び鑑賞の活動を通して，造形的な見方・考え方を働かせ，生活や社会の中の美術や美術文化と豊かに関わる資質・能力を次のとおり育成することを目指す。
（１）　造形的な視点について理解し，表したいことに合わせて材料や用具を使い，表し方を工夫する技能を身に付けるようにする。
（２）　造形的なよさや面白さ，美しさ，表したいことや表し方などについて考え，経験したことや材料などを基に，発想し構想するとともに，造形や作品などを鑑賞し，自分の見方や感じ方を深めることができるようにする。
（３）　創造活動の喜びを味わい，美術を愛好する心情を育み，感性を豊かにし，心豊かな生活を営む態度を養い，豊かな情操を培う。""",
                "１段階": {
                    "目標": """ア　造形的な視点について気付き，材料や用具の扱い方に親しむとともに，表し方を工夫する技能を身に付けるようにする。
イ　造形的なよさや面白さ，表したいことや表し方などについて考え，経験したことや思ったこと，材料などを基に，発想し構想するとともに，身近にある造形や作品などから，自分の見方や感じ方を広げることができるようにする。
ウ　楽しく美術の活動に取り組み，創造活動の喜びを味わい，美術を愛好する心情を培い，心豊かな生活を営む態度を養う。""",
                    "内容": """Ａ　表　現
ア　日常生活の中で経験したことや思ったこと，材料などを基に，表したいことや表し方を考えて，描いたり，つくったり，それらを飾ったりする活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　経験したことや思ったこと，材料などを基に，表したいことや表し方を考えて，発想や構想をすること。
（イ）　材料や用具の扱いに親しみ，表したいことに合わせて，表し方を工夫し，材料や用具を選んで使い表すこと。
Ｂ　鑑　賞
ア　自分たちの作品や身近な造形品の鑑賞の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分たちの作品や身近な造形品の制作の過程などの鑑賞を通して，よさや面白さに気付き，自分の見方や感じ方を広げること。
（イ）　表し方や材料による印象の違いなどに気付き，自分の見方や感じ方を広げること。
〔共通事項〕
ア　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
（ア）　形や色彩，材料や光などの特徴について知ること。
（イ）　造形的な特徴などからイメージをもつこと。"""
                },
                "２段階": {
                    "目標": """ア　造形的な視点について理解し，材料や用具の扱い方などを身に付けるとともに，多様な表し方を工夫する技能を身に付けるようにする。
イ　造形的なよさや面白さ，美しさ，表したいことや表し方などについて考え，経験したことや想像したこと，材料などを基に，発想し構想するとともに，自分たちの作品や美術作品などに親しみ自分の見方や感じ方を深めることができるようにする。
ウ　主体的に美術の活動に取り組み，創造活動の喜びを味わい，美術を愛好する心情を高め，心豊かな生活を営む態度を養う。""",
                    "内容": """Ａ　表　現
ア　経験したことや想像したこと，材料などを基に，表したいことや表し方を考えて，描いたり，つくったり，それらを飾ったりする活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　経験したことや想像したこと，材料などを基に，表したいことや表し方を考えて，発想や構想をすること。
（イ）　材料や用具の扱い方を身に付け，表したいことに合わせて，材料や用具の特徴を生かしたり，それらを組み合わせたりして計画的に表すこと。
Ｂ　鑑　賞
ア　自分たちの作品や美術作品などの鑑賞の活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分たちの作品や美術作品などを鑑賞して，よさや面白さ，美しさを感じ取り，自分の見方や感じ方を深めること。
（イ）　表し方や材料による特徴の違いなどを捉え，自分の見方や感じ方を深めること。
〔共通事項〕
ア　「Ａ表現」及び「Ｂ鑑賞」の指導を通して，次の事項を身に付けることができるよう指導する。
（ア）　形や色彩，材料や光などの特徴について理解すること。
（イ）　造形的な特徴などからイメージを捉えること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　題材など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，造形的な見方・考え方を働かせ，表現したり鑑賞したりする資質・能力を相互に関連させた学習の充実を図ること。
イ　２の各段階の内容の「Ａ表現」及び「Ｂ鑑賞」の指導に当たっては，相互の関連を図るようにすること。
ウ　２の各段階の内容の〔共通事項〕は，表現及び鑑賞の学習において共通に必要となる資質・能力であり，「Ａ表現」及び「Ｂ鑑賞」の各事項の指導と併せて，十分な指導が行われるよう工夫すること。
エ　２の各段階の内容の「Ａ表現」の指導に当たっては，適宜共同してつくりだす活動を取り上げるようにすること。
オ　２の各段階の内容の「Ｂ鑑賞」の指導に当たっては，感じたことや思ったことを伝え合うなど，周りの人と共有できる機会を設けるようにすること。
カ　２の各段階の「Ｂ鑑賞」の指導に当たっては，生徒や学校の実態に応じて，地域の美術館を利用するなど，連携を図るようにすること。また，学校図書館等における鑑賞用図書，映像資料等の活用を図ること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　「Ａ表現」の指導に当たっては，材料や用具の安全な使い方について指導するとともに，活動場所を事前に点検するなどして，事故防止について徹底すること。
イ　生徒が個性を生かして活動することができるようにするため，学習活動や表現方法などに幅をもたせるようにすること。
ウ　「Ａ表現」の指導に当たっては，活動の全過程を通して生徒が実現したい思いを大切にしながら活動できるようにし，自分のよさや可能性を見いだし，楽しく豊かな生活を創造する態度を養うようにすること。
エ　各活動において，互いのよさや個性などを認め尊重し合うようにすること。
オ　「Ａ表現」及び「Ｂ鑑賞」の学習を通して学んだことが，生活や社会の中で生かせるようにすることや，作品や用具等を大切に取り扱うことを理解して使えるよう指導すること。
カ　美術の表現の可能性を広げるために，写真・ビデオ・コンピュータ等の映像メディアの積極的な活用を図るようにすること。
キ　材料については，地域の身近にある材料なども取り上げ，指導すること。
ク　作品を校内の適切な場所に展示するなどし，日常の学校生活においてそれらを鑑賞することができるよう配慮すること。また，学校や地域の実態に応じて，校外に生徒の作品を展示する機会を設けるなどすること。"""
            },
            "保健体育": {
                "目標": """体育や保健の見方・考え方を働かせ，課題を見付け，その解決に向けた学習過程を通して，心と体を一体として捉え，生涯にわたって心身の健康を保持増進し，豊かなスポーツライフを実現するための資質・能力を次のとおり育成することを目指す。
（１）　各種の運動の特性に応じた技能等及び自分の生活における健康・安全について理解するとともに，基本的な技能を身に付けるようにする。
（２）　各種の運動や健康・安全についての自分の課題を見付け，その解決に向けて自ら思考し判断するとともに，他者に伝える力を養う。
（３）　生涯にわたって運動に親しむことや健康の保持増進と体力の向上を目指し，明るく豊かな生活を営む態度を養う。""",
                "１段階": {
                    "目標": """ア　各種の運動の楽しさや喜びに触れ，その特性に応じた行い方及び体の発育・発達やけがの防止，病気の予防などの仕方が分かり，基本的な動きや技能を身に付けるようにする。
イ　各種の運動や健康な生活における自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝える力を養う。
ウ　各種の運動に進んで取り組み，きまりや簡単なスポーツのルールなどを守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をする態度を養う。また，健康・安全の大切さに気付き，自己の健康の保持増進に進んで取り組む態度を養う。""",
                    "内容": """Ａ　体つくり運動
体つくり運動について，次の事項を身に付けることができるよう指導する。
ア　体ほぐしの運動や体の動きを高める運動を通して，体を動かす楽しさや心地よさに触れるとともに，その行い方が分かり，友達と関わったり，動きを持続する能力などを高めたりすること。
イ　体ほぐしの運動や体の動きを高める運動についての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　体ほぐしの運動や体の動きを高める運動に進んで取り組み，きまりを守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｂ　器械運動
器械運動について，次の事項を身に付けることができるよう指導する。
ア　器械・器具を使った運動の楽しさや喜びに触れ，その行い方が分かり，基本的な動きや技を身に付けること。
イ　器械・器具を使った運動についての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　器械・器具を使った運動に進んで取り組み，きまりを守り，友達と協力したり，場や器械・器具の安全に留意したりし，最後まで楽しく運動をすること。
Ｃ　陸上運動
陸上運動について，次の事項を身に付けることができるよう指導する。
ア　陸上運動の楽しさや喜びに触れ，その行い方が分かり，基本的な動きや技能を身に付けること。
イ　陸上運動についての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　陸上運動に進んで取り組み，きまりを守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｄ　水泳運動
水泳運動について，次の事項を身に付けることができるよう指導する。
ア　初歩的な泳ぎの楽しさや喜びに触れ，その行い方が分かり，基本的な動きや技能を身に付けること。
イ　初歩的な泳ぎについての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　初歩的な泳ぎに進んで取り組み，きまりなどを守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｅ　球技
球技について，次の事項を身に付けることができるよう指導する。
ア　球技の楽しさや喜びに触れ，その行い方が分かり，基本的な動きや技能を身に付け，簡易化されたゲームを行うこと。
イ　球技についての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　球技に進んで取り組み，きまりや簡単なルールを守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｆ　武道
武道について，次の事項を身に付けることができるよう指導する。
ア　武道の楽しさを感じ，その行い方や伝統的な考え方が分かり，基本動作や基本となる技を用いて，簡易な攻防を展開すること。
イ　武道についての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　武道に進んで取り組み，きまりや伝統的な行動の仕方を守り，友達と協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｇ　ダンス
ダンスについて，次の事項を身に付けることができるよう指導する。
ア　ダンスの楽しさや喜びに触れ，その行い方が分かり，基本的な動きや技能を身に付け，表現したり踊ったりすること。
イ　ダンスについての自分の課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。
ウ　ダンスに進んで取り組み，友達の動きを認め協力したり，場や用具の安全に留意したりし，最後まで楽しく運動をすること。
Ｈ　保健
健康・安全に関する事項について，次の事項を身に付けることができるよう指導する。
ア　体の発育・発達やけがの防止，病気の予防などの仕方が分かり，基本的な知識及び技能を身に付けること。
イ　自分の健康・安全についての課題を見付け，その解決のための活動を考えたり，工夫したりしたことを他者に伝えること。"""
                },
                "２段階": {
                    "目標": """ア　各種の運動の楽しさや喜びを味わい，その特性に応じた行い方及び体の発育・発達やけがの防止，病気の予防などの仕方について理解し，基本的な技能を身に付けるようにする。
イ　各種の運動や健康な生活における自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝える力を養う。
ウ　各種の運動に積極的に取り組み，きまりや簡単なスポーツのルールなどを守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の最善を尽くして運動をする態度を養う。また，健康・安全の大切さに気付き，自己の健康の保持増進と回復に進んで取り組む態度を養う。""",
                    "内容": """Ａ　体つくり運動
体つくり運動について，次の事項を身に付けることができるよう指導する。
ア　体ほぐしの運動や体の動きを高める運動を通して，体を動かす楽しさや心地よさを味わうとともに，その行い方を理解し，友達と関わったり，動きを持続する能力などを高めたりすること。
イ　体ほぐしの運動や体の動きを高める運動についての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　体ほぐしの運動や体の動きを高める運動に積極的に取り組み，きまりを守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｂ　器械運動
器械運動について，次の事項を身に付けることができるよう指導する。
ア　器械運動の楽しさや喜びを味わい，その行い方を理解し，基本的な技を身に付けること。
イ　器械運動についての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　器械運動に積極的に取り組み，きまりを守り，友達と助け合ったり，場や器械・器具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｃ　陸上運動
陸上運動について，次の事項を身に付けることができるよう指導する。
ア　陸上運動の楽しさや喜びを味わい，その行い方を理解し，基本的な技能を身に付けること。
イ　陸上運動についての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　陸上運動に積極的に取り組み，きまりを守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｄ　水泳運動
水泳運動について，次の事項を身に付けることができるよう指導する。
ア　水泳運動の楽しさや喜びを味わい，その行い方を理解し，基本的な技能を身に付けること。
イ　水泳運動についての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　水泳運動に積極的に取り組み，きまりなどを守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｅ　球技
球技について，次の事項を身に付けることができるよう指導する。
ア　球技の楽しさや喜びを味わい，その行い方を理解し，基本的な技能を身に付け，簡易化されたゲームを行うこと。
イ　球技についての自分やチームの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　球技に積極的に取り組み，きまりや簡単なルールを守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｆ　武道
武道について，次の事項を身に付けることができるよう指導する。
ア　武道の楽しさや喜びに触れ，その行い方や伝統的な考え方を理解し，基本動作や基本となる技を用いて，簡易な攻防を展開すること。
イ　武道についての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　武道に積極的に取り組み，きまりや伝統的な行動の仕方を守り，友達と助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｇ　ダンス
ダンスについて，次の事項を身に付けることができるよう指導する。
ア　ダンスの楽しさや喜びを味わい，その行い方を理解し，基本的な技能を身に付け，表現したり踊ったりすること。
イ　ダンスについての自分やグループの課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。
ウ　ダンスに積極的に取り組み，友達のよさを認め助け合ったり，場や用具の安全に留意したりし，自己の力を発揮して運動をすること。
Ｈ　保健
健康・安全に関する事項について，次の事項を身に付けることができるよう指導する。
ア　体の発育・発達やけがの防止，病気の予防などの仕方について理解し，基本的な技能を身に付けること。
イ　自分やグループの健康・安全についての課題を見付け，その解決のために友達と考えたり，工夫したりしたことを他者に伝えること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　各段階の内容のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，体育や保健の見方・考え方を働かせ，運動や健康についての自他の課題を見付け，個々の生徒の障害の状態等に応じて，その解決のための活動の充実を図ること。また，運動の楽しさや喜びを味わったり，健康の大切さを実感したりすることができるよう，留意すること。
イ　「Ａ体つくり運動」及び「Ｈ保健」については，３学年間にわたって取り扱うこと。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　学校や地域の実態を考慮するとともに，個々の生徒の障害の状態等，運動の経験及び技能の程度などに応じた指導や生徒自らが運動の課題の解決を目指す活動を行えるよう工夫すること。
イ　運動を苦手と感じている生徒や，運動に意欲的に取り組まない生徒への指導を工夫すること。
ウ　「Ａ体つくり運動」から「Ｇダンス」までと「Ｈ保健」との関連を図る指導を工夫すること。
エ　「Ｅ球技」については，個の能力だけでなく，より集団を意識したゲームを取り扱うものとすること。
オ　「Ｆ武道」については，武道場や用具の確保が難しい場合は指導方法を工夫して行うとともに，安全面に十分留意すること。
カ　自然との関わりの深い雪遊び，氷上遊び，スキー，スケート，水辺活動などの指導については，生徒の障害の状態等，学校や地域の実態等に応じて積極的に行うようにすること。
キ　オリンピック・パラリンピックなどとも関連させ，フェアなプレイを大切にするなど，生徒の発達の段階に応じて，運動やスポーツの大切さや必要性等に触れるようにするとともに，運動やスポーツを「すること」，「知ること」，「見ること」，「応援すること」などの多様な関わり方について取り扱うようにすること。"""
            },
            "職業・家庭": {
                "目標": """生活の営みに係る見方・考え方や職業の見方・考え方を働かせ，生活や職業に関する実践的・体験的な学習活動を通して，よりよい生活の実現に向けて工夫する資質・能力を次のとおり育成することを目指す。
（１）　生活や職業に対する関心を高め，将来の家庭生活や職業生活に係る基礎的な知識や技能を身に付けるようにする。
（２）　将来の家庭生活や職業生活に必要な事柄を見いだして課題を設定し，解決策を考え，実践を評価・改善し，自分の考えを表現するなどして，課題を解決する力を養う。
（３）　よりよい家庭生活や将来の職業生活の実現に向けて，生活を工夫し考えようとする実践的な態度を養う。""",
                "１段階": {
                    "目標": """職業分野
職業に係る見方・考え方を働かせ，作業や実習に関する実践的・体験的な学習活動を通して，よりよい生活の実現に向けて工夫する資質・能力を次のとおり育成することを目指す。
ア　職業について関心をもち，将来の職業生活に係る基礎的な知識や技能を身に付けるようにする。
イ　将来の職業生活に必要な事柄について触れ，課題や解決策に気付き，実践し，学習したことを伝えるなど，課題を解決する力の基礎を養う。
ウ　将来の職業生活の実現に向けて，生活を工夫しようとする態度を養う。
家庭分野
生活の営みに係る見方・考え方を働かせ，衣食住などに関する実践的・体験的な学習活動を通して，よりよい生活の実現に向けて工夫する資質・能力を次のとおり育成することを目指す。
ア　家庭の中の自分の役割に気付き，生活の自立に必要な家族・家庭，衣食住，消費や環境等についての基礎的な理解を図るとともに，それらに係る技能を身に付けるようにする。
イ　家庭生活に必要な事柄について触れ，課題や解決策に気付き，実践し，学習したことを伝えるなど，日常生活において課題を解決する力の基礎を養う。
ウ　家族や地域の人々とのやりとりを通して，よりよい生活の実現に向けて，生活を工夫しようとする態度を養う。""",
                    "内容": """職業分野
Ａ　職業生活
ア　働くことの意義
働くことに関心をもち，作業や実習等に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　働くことの目的などを知ること。
（イ）　意欲や見通しをもって取り組み，自分の役割について気付くこと。
（ウ）　作業や実習等で達成感を得ること。
イ　職業
職業に関わる事柄について，考えたり，体験したりする学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　職業に関わる知識や技能について，次のとおりとする。
　㋐　職業生活に必要な知識や技能について知ること。
　㋑　職業生活を支える社会の仕組み等があることを知ること。
　㋒　材料や育成する生物等の扱い方及び生産や生育活動等に関わる基礎的な技術について知ること。
　㋓　作業課題が分かり、使用する道具等の扱い方に慣れること。
　㋔　作業の持続性や巧緻性などを身に付けること。
（イ）　職業生活に必要な思考力，判断力，表現力等について，次のとおりとする。
　㋐　職業に関わる事柄と作業や実習で取り組む内容との関連について気付くこと。
　㋑　作業に当たり安全や衛生について気付き、工夫すること。
　㋒　職業生活に必要な健康管理について気付くこと。
Ｂ　情報機器の活用
職業生活で使われるコンピュータ等の情報機器に触れることなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
ア　コンピュータ等の情報機器の初歩的な操作の仕方を知ること。
イ　コンピュータ等の情報機器に触れ，体験したことなどを他者に伝えること。
Ｃ　産業現場等における実習
実際的な学習活動を通して，次の事項を身に付けることができるよう指導する。
ア　職業や進路に関わることについて関心をもったり，調べたりすること。
イ　職業や職業生活，進路に関わることについて，気付き，他者に伝えること。
家庭分野
Ａ　家族・家庭生活
ア　自分の成長と家族
自分の成長に気付くことや家族のことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分の成長を振り返りながら，家庭生活の大切さを知ること。
（イ）　家族とのやりとりを通して，家族を大切にする気持ちを育み，よりよい関わり方について気付き，それらを他者に伝えること。
イ　家庭生活と役割
家庭の中での役割などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　家庭における役割や地域との関わりについて関心をもち，知ること。
（イ）　家庭生活に必要なことや自分の果たす役割に気付き，それらを他者に伝えること。
ウ　家庭生活における余暇
家庭における余暇の過ごし方などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　健康や様々な余暇の過ごし方について知り，実践しようとすること。
（イ）　望ましい生活環境や健康及び様々な余暇の過ごし方について気付き，工夫すること。
エ　幼児の生活と家族
幼児と接することなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　幼児の特徴や過ごし方について知ること。
（イ）　幼児への適切な関わり方について気付き，それらを他者に伝えること。
Ｂ　衣食住の生活
ア　食事の役割
食事の仕方や食事の大切さに気付くことなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　健康な生活と食事の役割について知ること。
（イ）　適切な量の食事を楽しくとることの大切さに気付き，それらを他者に伝えること。
イ　調理の基礎
必要な材料を使って食事の準備をすることなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　簡単な調理の仕方や手順について知り，できるようにすること。
（イ）　簡単な調理計画について考えること。
ウ　衣服の着用と手入れ
衣服の着方や手入れの仕方などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　場面に応じた日常着の着方や手入れの仕方などについて知り，実践しようとすること。
（イ）　日常着の着方や手入れの仕方に気付き，工夫すること。
エ　快適な住まい方
持ち物の整理や住まいの清掃などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　住まいの主な働きや，整理・整頓や清掃の仕方について知り，実践しようとすること。
（イ）　季節の変化に合わせた住まい方，整理・整頓や清掃の仕方に気付き，工夫すること。
Ｃ　消費生活・環境
ア　身近な消費生活
買物の仕組みや必要な物の選び方などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　生活に必要な物の選び方，買い方，計画的な使い方などについて知り，実践しようとすること。
（イ）　生活に必要な物を選んだり，物を大切に使おうとしたりすること。
イ　環境に配慮した生活
身近な生活の中で環境に配慮することに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身近な生活の中で，環境に配慮した物の使い方などについて知り，実践しようとすること。
（イ）　身近な生活の中で，環境に配慮した物の使い方などについて考え，工夫すること。"""
                },
                "２段階": {
                    "目標": """職業分野
職業に係る見方・考え方を働かせ，作業や実習に関する実践的・体験的な学習活動を通して，よりよい生活の実現に向けて工夫する資質・能力を次のとおり育成することを目指す。
ア　働くことに対する関心を高め，将来の職業生活に係る基礎的な知識や技能を身に付けるようにする。
イ　将来の職業生活に必要な事柄を見いだして課題を設定し，解決策を考え，実践し，学習したことを振り返り，考えたことを表現するなど，課題を解決する力を養う。
ウ　将来の職業生活の実現に向けて，生活を工夫し考えようとする実践的な態度を養う。
家庭分野
生活の営みに係る見方・考え方を働かせ，衣食住などに関する実践的・体験的な学習活動を通して，よりよい生活の実現に向けて工夫する資質・能力を次のとおり育成することを目指す。
ア　家族や自分の役割について理解し，生活の自立に必要な家族・家庭，衣食住，消費や環境等についての基礎的な理解を図るとともに，それらに係る技能を身に付けるようにする。
イ　家庭生活に必要な事柄について考え，課題を設定し，解決策を考え，実践し，学習したことを振り返り，考えたことを表現するなど，日常生活において課題を解決する力を養う。
ウ　家族や地域の人々とのやりとりを通して，よりよい生活の実現に向けて，生活を工夫し考えようとする実践的な態度を養う。""",
                    "内容": """職業分野
Ａ　職業生活
ア　働くことの意義
働くことに対する意欲や関心を高め，他者と協力して取り組む作業や実習等に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　働くことの目的などを理解すること。
（イ）　意欲や見通しをもって取り組み，自分と他者との関係や役割について考えること。
（ウ）　作業や実習等に達成感を得て，進んで取り組むこと。
イ　職業
職業に関わる事柄について，考えを深めたり，体験したりする学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　職業に関わる知識や技能について，次のとおりとする。
　㋐　職業生活に必要な知識や技能を理解すること。
　㋑　職業生活を支える社会の仕組み等があることを理解すること。
　㋒　材料や育成する生物等の特性や扱い方及び生産や生育活動等に関わる基礎的な技術について理解すること。
　㋓　作業課題が分かり、使用する道具や機械等の扱い方を理解すること。
　㋔　作業の確実性や持続性、巧緻性等を身に付けること。
（イ）　職業生活に必要な思考力，判断力，表現力等について，次のとおりとする。
　㋐　職業に関わる事柄と作業や実習で取り組む内容との関連について、考えて、発表すること。
　㋑　作業上の安全や衛生及び作業の効率について考えて、工夫すること。
　㋒ 　職業生活に必要な健康管理について考えること。
Ｂ　情報機器の活用
職業生活や社会生活で使われるコンピュータ等の情報機器を扱うことに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
ア　コンピュータ等の情報機器の基礎的な操作の仕方を知り，扱いに慣れること。
イ　コンピュータ等の情報機器を扱い，体験したことや自分の考えを表現すること。
Ｃ　産業現場等における実習
実際的な学習活動を通して，次の事項を身に付けることができるよう指導する。
ア　職業や進路に関わることについて調べて，理解すること。
イ　職業や職業生活，進路に関わることと自己の成長などについて考えて，発表すること。
家庭分野
Ａ　家族・家庭生活
ア　自分の成長と家族
自分の成長と家族や家庭生活などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　自分の成長を振り返り，家庭生活の大切さを理解すること。
（イ）　家族とのやりとりを通して，家族を大切にする気持ちを育み，よりよい関わり方について考え，表現すること。
イ　家庭生活と役割
家庭生活での役割などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　家庭における役割や地域との関わりについて調べて，理解すること。
（イ）　家庭生活に必要なことに関して，家族の一員として，自分の果たす役割を考え，表現すること。
ウ　家庭生活における余暇
家庭生活における健康や余暇に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　健康管理や余暇の過ごし方について理解し，実践すること。
（イ）　望ましい生活環境や健康管理及び自分に合った余暇の過ごし方について考え，表現すること。
エ　家族や地域の人々との関わり
家族との触れ合いや地域の人々と接することなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　地域生活や地域の活動について調べて，理解すること。
（イ）　家族との触れ合いや地域生活に関心をもち，家族や地域の人々と地域活動への関わりについて気付き，表現すること。
Ｂ　衣食住の生活
ア　食事の役割
楽しく食事をするための工夫などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　健康な生活と食事の役割や日常の食事の大切さを理解すること。
（イ）　日常の食事の大切さや規則正しい食事の必要性を考え，表現すること。
イ　栄養を考えた食事
バランスのとれた食事について考えることに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身体に必要な栄養について関心をもち，理解し，実践すること。
（イ）　バランスのとれた食事について気付き，献立などを工夫すること。
ウ　調理の基礎
食事の準備や調理の仕方などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　調理に必要な材料の分量や手順などについて理解し，適切にできること。
（イ）　調理計画に沿って，調理の手順や仕方を工夫すること。
エ　衣服の着用と手入れ
衣服の手入れや洗濯の仕方などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　日常着の使い分けや手入れの仕方などについて理解し，実践すること。
（イ）　日常着の快適な着方や手入れの仕方を考え，工夫すること。
オ　快適で安全な住まい方
住まいの整理・整頓や清掃などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　快適な住まい方や，安全について理解し，実践すること。
（イ）　季節の変化に合わせた快適な住まい方に気付き，工夫すること。
Ｃ　消費生活・環境
ア　身近な消費生活
身近な消費生活について考えることなどに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　生活に必要な物の選択や扱い方について理解し，実践すること。
（イ）　生活に必要な物について考えて選ぶことや，物を大切に使う工夫をすること。
イ　環境に配慮した生活
自分の生活と環境との関連などに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
（ア）　身近な生活の中での環境との関わりや環境に配慮した物の使い方などについて理解し，実践すること。
（イ）　身近な生活の中で，環境との関わりや環境に配慮した生活について考えて，物の使い方などを工夫すること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　題材など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，作業や実習など体験的な活動と知識とを相互に関連付けてより深く理解できるようにすること。
イ　職業分野及び家庭分野に示された各段階の目標・内容については，分野相互の関連を図り，総合的に展開されるよう適切に計画すること。その際，小学部の生活科をはじめとする各教科等とのつながりや，中学部における他教科等との関連を重視することや高等部における職業科，家庭科，情報科等の学習を見据え，系統的に指導できるよう計画すること。
ウ　生徒一人一人のキャリア発達を促していくことを踏まえ，発達の段階に応じて望ましい勤労観や職業観を身に付け，自らの生き方を考えて進路を主体的に選択することができるよう，将来の生き方等についても扱うなど，組織的かつ計画的に指導を行うこと。
エ　地域や産業界との連携を図り，実際的な学習活動や就業体験，実習等を計画的に取り入れること。産業現場等における実習については，校内での作業や就業体験等と関連させ，段階的・系統的に指導するよう配慮すること。
（２）　２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア　実習の指導に当たっては，施設・設備の安全・衛生管理に配慮し，学習環境を整備するとともに，火気，用具，材料などの取扱いと事故防止の指導を徹底するものとする。その際，適切な服装や防護眼鏡・防塵マスクの着用等による安全の確保に努めること。
イ　職業分野
職業分野の内容の取扱いについては，次の事項に配慮するものとする。
（ア）　基礎的な知識及び技能を習得し，その理解を深めることで概念が育まれるとともに，仕事の楽しさや完成の喜びを体得できるよう，実践的・体験的な学習活動を充実すること。
（イ）　生徒が習得した知識や技能を生活に活用できるよう，問題解決的な学習を充実するとともに，家庭や地域との連携を図ること。
（ウ）　職業生活や家庭生活に必要な生きて働く知識や技能及び態度の形成に重点を置いた指導が行われるように配慮すること。
（エ）　職業生活における余暇については，家庭生活における余暇と関連させて指導すること。
（オ）　「Ｂ情報機器の活用」については，家庭生活における情報機器の取扱いについても留意して指導すること。
ウ　家庭分野
家庭分野の内容の取扱いについては，次の事項に配慮するものとする。
（ア）　食に関する指導では，職業・家庭科の特質に応じて，食育の充実に資すること。
（イ）　幼児と関わるなどの校外での学習について，事故の防止策及び事故発生時の対応策等を綿密に計画するとともに，相手に対する配慮にも十分留意するものとする。
（ウ）　調理に用いる食品については，安全・衛生に留意すること。また，食物アレルギーについても配慮すること。"""
            },
            "外国語": {
                "目標": """外国語によるコミュニケーションにおける見方・考え方を働かせ，外国語の音声や基本的な表現に触れる活動を通して，コミュニケーションを図る素地となる資質・能力を次のとおり育成することを目指す。
（１）　外国語を用いた体験的な活動を通して，身近な生活で見聞きする外国語に興味や関心をもち，外国語の音声や基本的な表現に慣れ親しむようにする。
（２）　身近で簡単な事柄について，外国語で聞いたり話したりして自分の考えや気持ちなどを伝え合う力の素地を養う。
（３）　外国語を通して，外国語やその背景にある文化の多様性を知り，相手に配慮しながらコミュニケーションを図ろうとする態度を養う。""",
                "内容": """〔英　語〕
〔知識及び技能〕
（１）　英語の特徴等に関する事項
実際に英語を用いた場面や状況等における言語活動を通して，次の事項を身に付けることができるよう指導する。
ア　英語の音声や基本的な表現に慣れ親しむこと
（ア）　英語の音声を聞き，真似て声を出したり，話したりしようとすること。
（イ）　英語の音声や文字も，事物の内容を表したり，要件を伝えたりなどの働きがあることを感じ取ること。
（ウ）　基本的な表現や語句が表す内容を知り，それらを使うことで相手に伝わることを感じ取ること。
イ　日本と外国の言語や文化に慣れ親しむこと。
（ア）　体験的な活動を通して，日本と外国との生活，習慣，行事などの違いを知ること。
（イ）　対話的な活動を通して，相手の発言をよく聞こうとしたり，相づちや表情，ジェスチャーなどで応じようとしたりすること。
〔思考力，判断力，表現力等〕
（２）　情報を整理し，表現したり，伝え合ったりすることに関する事項
具体的な課題等を設定し，コミュニケーションを行う目的や場面，状況などに応じて情報や考えなどを表現することを通して，次の事項を身に付けることができるよう指導する。
ア　日常生活に関する簡単な事柄について，伝えたいことを考え，簡単な語などや基本的な表現を使って伝え合うこと。
イ　日常生活に関する簡単な事柄について，自分の考えや気持ちなどが伝わるよう，工夫して質問をしたり，質問に答えたりすること。
（３）　言語活動及び言語の働きに関する事項
①　言語活動に関する事項
（2）に示す事項については，（1）に示す事項を活用して，例えば，次のような言語活動を通して指導する。
ア　聞くこと
（ア）　文字の発音を聞いて文字と結び付ける活動。
（イ）　身近で具体的な事物に関する簡単な英語を聞き，それが表す内容をイラストや写真と結び付ける活動。
（ウ）　挨拶や簡単な指示に応じる活動。
イ　話すこと［発表］
（ア）　自分の名前，年齢，好みなどを簡単な語などや基本的な表現を用いて表現する活動。
（イ）　身近で具体的な事物の様子や状態を簡単な語などや基本的な表現，ジェスチャーを用いて表現する活動。
ウ　話すこと［やり取り］
（ア）　簡単な挨拶をし合う活動。
（イ）　自分のことについて，具体物などを相手に見せながら，好みや要求などの自分の考えや気持ちを伝え合う活動。
（ウ）　ゆっくり話される簡単な質問に，英語の語など又は身振りや動作などで応じる活動。
エ　書くこと
（ア）　身近な事物を表す文字を書く活動。
（イ）　例示を見ながら自分の名前を書き写す活動。
オ　読むこと
（ア）　身の回りで使われている文字や単語を見付ける活動。
（イ）　日本の人の名前や地名の英語表記に使われている文字を読む活動。
②　言語の働きに関する事項
言語活動を行うに当たり，主として次に示すような言語の使用場面や言語の働きを取り上げるようにする。
ア　言語の使用場面の例
（ア）　特有の表現がよく使われる場面
　挨拶をする
　自己紹介をする
　買物をする
　食事をする　など
（イ）　生徒の身近な暮らしに関わる場面
　ゲーム
　歌やダンス
　学校での学習や活動
　家庭での生活　など
イ　言語の働きの例
（ア）　コミュニケーションを円滑にする
　挨拶をする
　相づちを打つ
（イ）　気持ちを伝える
　礼を言う
　褒める
（ウ）　相手の行動を促す
　質問する
〔その他の外国語〕
その他の外国語については，外国語の２の内容の〔英語〕に準じて指導を行うものとする。""",
                "指導計画の作成と内容の取扱い": """（１）　外国語科においては，英語を履修させることを原則とすること。
（２）　指導計画の作成に当たっては，次の事項に配慮するものとする。
ア　単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，具体的課題等を設定し，生徒が外国語によるコミュニケーションにおける見方・考え方を働かせながら，コミュニケーションの目的や場面，状況などを意識して活動を行い，英語の音声や語彙，表現などの知識を，五つの領域における実際のコミュニケーションにおいて活用する学習の充実を図ること。
イ　これまでに学習した外国語活動との関連に留意して，指導計画を適切に作成すること。
ウ　外国語科を設ける場合は，生徒の障害の状態や実態に応じて，指導目標を適切に定め，３年間を通して外国語科の目標の実現を図るようにすること。また，高等部における指導との接続に配慮すること。
エ　指導内容や活動については，生徒の興味や関心，経験などに合ったものとし，国語科や音楽科，美術科などの他教科等で生徒が学習したことを活用するなどの工夫により，指導の効果を高めるようにすること。
オ　学級担任の教師又は外国語を担当する教師が指導計画を作成し，授業を実施するに当たっては，ネイティブ・スピーカーや英語が堪能な地域人材などの協力を得る等，指導体制等の充実を図るとともに，指導方法を工夫すること。
カ　外国語を通して他者とコミュニケーションを図ることの必要性や楽しさを味わうことができるよう工夫すること。
（３）　２の内容の取扱いについては，次の事項に配慮するものとする。
ア　言語材料については，生徒に身近でなじみのある簡単なものから扱うようにするとともに，語，連語及び慣用表現については活用頻度の高いものを用い，必要に応じて繰り返し活用しながら体験的な理解を図るようにすること。
イ　２の内容のうち，主として言語や文化に関する内容の指導については，言語活動との関連を図るようにすること。その際，日本語と外国語との違いに生徒が気付くなど体験的な理解を図ることとし，指導内容が必要以上に細部にわたったり，形式的になったりしないようにすること。
ウ　生徒の実態や教材の内容などに応じて，情報機器等を有効に活用し適切な言語材料を十分に提供できるようにすること。"""
            },
            "全体指導計画": """指導計画の作成と各教科全体にわたる内容の取扱いについては，第２章第１節第２款第２において特に示している事項に準ずるものとする。"""
        }
    },
    # guideline_data.py


    "高等部": {
        "知的障害者": {
            "国語科": {
                "目標": """言葉による見方・考え方を働かせ，言語活動を通して，国語で理解し表現する資質・能力を次のとおり育成することを目指す。
（１）社会生活に必要な国語について，その特質を理解し適切に使うことができるようにする。
（２）社会生活における人との関わりの中で伝え合う力を高め，思考力や想像力を養う。
（３）言葉がもつよさを認識するとともに，言語感覚を養い，国語を大切にしてその能力の向上を図る態度を養う。""",
                "１段階": {
                    "目標": """ア 社会生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しむことができるようにする。
イ 筋道立てて考える力や豊かに感じたり想像したりする力を養い，社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えをまとめることができるようにする。
ウ 言葉がもつよさを認識するとともに，幅広く読書をし，国語を大切にして，思いや考えを伝え合おうとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア 言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）社会生活に係る人とのやり取りを通して，言葉には，考えたことや思ったことを表す働きがあることに気付くこと。
（イ）相手を見て話したり聞いたりするとともに，間の取り方などに注意して話すこと。
（ウ）漢字と仮名を用いた表記や送り仮名の付け方を理解して文や文章の中で使うとともに，句読点の使い方を意識して打つこと。
（エ）表現したり理解したりするために必要な語句の量を増し，話や文章の中で使うとともに，言葉には，性質や役割による語句のまとまりがあることを理解すること。
（オ）接続する語句の役割，段落の役割について理解すること。
（カ）日常よく使われる敬語を理解し使うこと。
（キ）文章の構成や内容の大体を意識しながら音読すること。
イ 話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）考えとそれを支える理由や事例，全体と中心など，情報と情報との関係について理解すること。
（イ）比較や分類の仕方，辞書や事典の使い方などを理解し使うこと。
ウ 我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）生活に身近なことわざや慣用句などを知り，使うこと。
（イ）書くことに関する次の事項を取り扱うこと。
㋐ 文字の組み立て方を理解し，形を整えて書くこと。
（ウ）幅広く読書に親しみ，読書が，必要な知識や情報を得ることに役立つことに気付くこと。
〔思考力，判断力，表現力等〕
Ａ 聞くこと・話すこと
聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア 社会の中で関わる人の話などを，話し手が伝えたいことの中心に注意して聞き，話の内容を捉えること。
イ 目的に応じて，話題を決め，集めた材料を比較するなど伝え合うために必要な事柄を選ぶこと。
ウ 話の中心が明確になるよう話の構成を考えること。
エ 相手に伝わるように，言葉の抑揚や強弱，間の取り方などを工夫すること。
オ 目的や進め方を確認し，司会などの役割を果たしながら話し合い，互いの意見の共通点や相違点に着目して，考えをまとめること。
Ｂ 書くこと
書くことに関する次の事項を身に付けることができるよう指導する。
ア 相手や目的を意識して，書くことを決め，集めた材料を比較するなど，伝えたいことを明確にすること。
イ 書く内容の中心を決め，内容のまとまりで段落をつくったり，段落相互の関係に注意したりして，文章の構成を考えること。
ウ 自分の考えとそれを支える理由や事例との関係を明確にして，書き表し方を工夫すること。
エ 間違いを正したり，相手や目的を意識した表現になっているかを確かめたりして，文や文章を整えること。
オ 書こうとしたことが明確になっているかなど，文章に対する感想や意見を伝え合い，自分の文章のよいところを見付けること。
Ｃ 読むこと
読むことに関する次の事項を身に付けることができるよう指導する。
ア 登場人物の行動や心情などについて，叙述を基に捉えること。
イ 段落相互の関係に着目しながら，考えとそれを支える理由や事例との関係などについて，叙述を基に捉えること。
ウ 登場人物の心情や情景について，場面と結び付けて具体的に想像すること。
エ 目的を意識して，中心となる語や文を見付けて要約すること。
オ 文章を読んで理解したことに基づいて，感想や考えをもつこと。"""
                },
                "２段階": {
                    "目標": """ア 社会生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しんだり理解したりすることができるようにする。
イ 筋道立てて考える力や豊かに感じたり想像したりする力を養い，社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えを広げることができるようにする。
ウ 言葉がもつよさを認識するとともに，進んで読書をし，国語を大切にして，思いや考えを伝え合おうとする態度を養う。""",
                    "内容": """〔知識及び技能〕
ア 言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）社会生活に係る人とのやり取りを通して，言葉には，相手とのつながりをつくる働きがあることに気付くこと。
（イ）話し言葉と書き言葉に違いがあることに気付くこと。
（ウ）文や文章の中で漢字と仮名を使い分けて書くこと。
（エ）表現したり理解したりするために必要な語句の量を増し，話や文章の中で使うとともに，語彙を豊かにすること。
（オ）文と文との接続の関係，話や文章の構成や種類について理解すること。
（カ）日常よく使われる敬語を理解し使い慣れること。
（キ）文章を音読したり，朗読したりすること。
イ 話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）原因と結果など，情報と情報との関係について理解すること。
（イ）情報と情報との関係付けの仕方を理解し使うこと。
ウ 我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）親しみやすい古文などの文章を音読するなどして，言葉の響きやリズムに親しむこと。
（イ）生活の中で使われる慣用句，故事成語などの意味を知り，使うこと。
（ウ）書くことに関する次の事項を取り扱うこと。
㋐ 用紙全体との関係に注意して，文字の大きさや配列などを決めて書くこと。
㋑ 目的に応じて使用する筆記具を選び，その特徴を生かして書くこと。
（エ）日常的に読書に親しみ，読書が，自分の考えを広げることに役立つことに気付くこと。
〔思考力，判断力，表現力等〕
Ａ 聞くこと・話すこと
聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア 社会の中で関わる人の話などについて，話し手の目的や自分が聞きたいことの中心を捉え，その内容を捉えること。
イ 目的や意図に応じて，話題を決め，集めた材料を比較したり分類したりして，伝え合う内容を検討すること。
ウ 話の内容が明確になるように，話の構成を考えること。
エ 資料を活用するなどして，自分の考えが伝わるように表現を工夫すること。
オ 互いの立場や意図を明確にしながら，計画的に話し合い，考えを広げたりまとめたりすること。
Ｂ 書くこと
書くことに関する次の事項を身に付けることができるよう指導する。
ア 目的や意図に応じて，書くことを決め，集めた材料を比較したり分類したりして，伝えたいことを明確にすること。
イ 筋道の通った文章となるように，文章全体の構成を考えること。
ウ 目的や意図に応じて簡単に書いたり詳しく書いたりするとともに，事実と感想，意見とを区別して書いたりするなど，自分の考えが伝わるように書き表し方を工夫すること。
エ 引用したり，図表やグラフなどを用いたりして，自分の考えが伝わるように書き表し方を工夫すること。
オ 文章全体の構成や書き表し方などに着目して，文や文章を整えること。
カ 文章全体の構成が明確になっているかなど，文章に対する感想や意見を伝え合い，自分の文章のよいところを見付けること。
Ｃ 読むこと
読むことに関する次の事項を身に付けることができるよう指導する。
ア 登場人物の相互関係や心情などについて，描写を基に捉えること。
イ 事実と感想，意見などとの関係を叙述を基に押さえ，文章全体の構成を捉えて要旨を把握すること。
ウ 人物像を具体的に想像したり，表現の効果を考えたりすること。
エ 目的を意識して，文章と図表などを結び付けるなどして，必要な情報を見付けること。
オ 文章を読んで理解したことに基づいて，自分の考えをまとめること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）指導計画の作成に当たっては，次の事項に配慮するものとする。
ア 単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，言葉による見方・考え方を働かせ，言語活動を通して，言葉の特徴や使い方などを理解し自分の思いや考えを深める学習の充実を図ること。
イ ２の各段階の内容の〔知識及び技能〕に示す事項については，〔思考力，判断力，表現力等〕に示す事項の指導を通して指導することを基本とすること。
ウ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ａ聞くこと・話すこと」に関する指導については，高等部卒業後の生活に必要な話し言葉を身に付け，活用できるよう指導すること。
エ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｂ書くこと」に関する指導については，筆記具を用いる技能の指導に偏ることなく，文章を書く場面を設けるよう工夫すること。
オ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｃ読むこと」に関する指導については，発達の段階に応じた様々な文章に接し，日常生活において読書活動を活発に行うようにするとともに，他教科等における読書の指導や学校図書館等における指導との関連を図るようにすること。"""
            },
            "社会科": {
                "目標": """社会的な見方・考え方を働かせ，社会的事象について関心をもち，具体的に考察する活動を通して，グローバル化する国際社会に主体的に生きる平和で民主的な国家及び社会の形成者に必要な公民としての資質・能力の基礎を次のとおり育成することを目指す。
（１）地域や我が国の国土の地理的環境，現代社会の仕組みや働き，地域や我が国の歴史や伝統と文化及び外国の様子について，様々な資料や具体的な活動を通して理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
（２）社会的事象の特色や相互の関連，意味を多角的に考えたり，自分の生活と結び付けて考えたり，社会への関わり方を選択・判断したりする力，考えたことや選択・判断したことを適切に表現する力を養う。
（３）社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土と歴史に対する愛情，我が国の将来を担う国民としての自覚，世界の国々の人々と共に生きていくことの大切さについての自覚などを養う。""",
                "１段階": {
                    "目標": """学習の問題を追究・解決する活動を通して，次のとおり資質・能力を育成することを目指す。
ア 我が国の国土の様子と国民生活，自然環境の特色，先人の業績や優れた文化遺産，社会参加するためのきまり，公共施設の役割と制度，農業や水産業の現状，産業と経済との関わり，外国の様子について，様々な資料や具体的な活動を通して，社会生活との関連を踏まえて理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
イ 社会的事象の特色や相互の関連，意味を多角的に考える力，自分の生活と結び付けて考える力，社会への関わり方を選択・判断する力，考えたことや選択・判断したことを表現する力を養う。
ウ 社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土に対する愛情，我が国の歴史や伝統を大切にして国を愛する心情，我が国の産業の発展を願い我が国の将来を担う国民としての自覚や平和を願う日本人として世界の国々の人々と共に生きることの大切さについての自覚を養う。""",
                    "内容": """ア 社会参加ときまり
（ア）社会参加するために必要な社会生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 地域の人々と互いに協力することの大切さを理解し，自分の役割や責任を果たすための知識や技能を身に付けること。
㋑ 社会生活の中で状況を的確に判断し，自分の役割と責任について考え，表現すること。
（イ）社会生活を営む上で大切な法やきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会生活を営む上で大切な法やきまりがあることを理解すること。
㋑ 社会生活を営む上で大切な法やきまりの意義と自分との関わりについて考え，表現すること。
イ 公共施設の役割と制度
（ア）公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 生活に関係の深い公共施設や公共物の役割とその必要性を理解すること。
㋑ 生活に関係の深い公共施設や公共物の利用の仕方を調べ，適切な活用を考え，表現すること。
（イ）制度に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の政治の基本的な仕組みや働きについて理解すること。
㋑ 国や地方公共団体の政治の取組について調べ，国民生活における政治の働きを考え，表現すること。
ウ 我が国の国土の自然環境と国民生活
（ア）我が国の国土の自然環境と国民生活との関連に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 自然災害は国土の自然条件などと関連して発生していることや，自然災害が国土と国民生活に影響を及ぼすことを理解すること。
㋑ 関係機関や地域の人々の様々な努力により公害の防止や生活環境の改善が図られてきたことを理解するとともに，公害が国土の環境や国民の生活に影響を及ぼすことを理解すること。
㋒ 災害の種類や発生の位置や時期，防災対策などに着目して，国土の自然災害の状況を捉え，自然条件との関連を考え，表現すること。
㋓ 公害の発生時期や経過，人々の協力や努力などに着目して，公害防止の取組を捉え，その働きを考え，表現すること。
エ 産業と生活
（ア）我が国の農業や水産業における食料生産に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の食料生産は，自然条件を生かして営まれていることや，国民の食料を確保する重要な役割を果たしていることを理解すること。
㋑ 食料生産に関わる人々は，生産性や品質を高めるよう努力したり輸送方法や販売方法を工夫したりして，良質な食料を消費地に届けるなど，食料生産を支えていることを理解すること。
㋒ 生産物の種類や分布，生産量の変化などに着目して，食料生産の概要を捉え，食料生産が国民生活に果たす役割を考え，表現すること。
㋓ 生産の工程，人々の協力関係，技術の向上，輸送，価格や費用などに関心をもって，食料生産に関わる人々の工夫や努力を捉え，その働きを考え，表現すること。
オ 我が国の国土の様子と国民生活，歴史
（ア）我が国の国土の様子と国民生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の国土の地形や気候の概要を理解するとともに，人々は自然環境に適応して生活していることを理解すること。
㋑ 地形や気候などに着目して，国土の自然などの様子や自然条件から見て特色ある地域の人々の生活を捉え，国土の自然環境の特色やそれらと国民生活との関連を考え，表現すること。
（イ）我が国の歴史上の主な事象に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の歴史上の主な事象を手掛かりに，関連する先人の業績，優れた文化遺産などを理解すること。
㋑ 世の中の様子，人物の働きや代表的な文化遺産などに着目して，我が国の歴史上の主な事象を捉え，世の中の様子の変化を考え，表現すること。
カ 外国の様子
（ア）グローバル化する世界と日本の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 異なる文化や習慣を尊重し合うことが大切であることを理解すること。
㋑ 外国の人々の生活の様子などに着目して，日本の文化や習慣との違いについて考え，表現すること。"""
                },
                "２段階": {
                    "目標": """学習の問題を追究・解決する活動を通して，次のとおり資質・能力を育成することを目指す。
ア 我が国の国土の様子と国民生活，自然環境の特色，先人の業績や優れた文化遺産，社会参加するためのきまり，公共施設の役割と制度，工業の現状，産業と情報との関わり，外国の様子について，様々な資料や具体的な活動を通して，社会生活との関連を踏まえて理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
イ 社会的事象の特色や相互の関連，意味を多角的に考える力，自分の生活と結び付けて考える力，社会への関わり方を選択・判断する力，考えたことや選択・判断したことを適切に表現する力を養う。
ウ 社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土に対する愛情，我が国の歴史や伝統を大切にして国を愛する心情，我が国の産業の発展を願い我が国の将来を担う国民としての自覚や平和を願う日本人として世界の国々の人々と共に生きることの大切さについての自覚を養う。""",
                    "内容": """ア 社会参加ときまり
（ア）社会参加するために必要な社会生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会の中で互いに協力しながら，社会生活に必要な知識や技能を身に付けること。
㋑ 社会生活の中で状況を的確に判断し，国民としての権利及び義務，それに伴う責任について考え，表現すること。
（イ）社会生活を営む上で大切な法やきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会の慣習，生活に関係の深い法やきまりを理解すること。
㋑ 社会の慣習，生活に関係の深い法やきまりの意義と自分との関わりについて考え，表現すること。
イ 公共施設の役割と制度
（ア）公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 地域における公共施設や公共物の役割とその必要性を理解すること。
㋑ 地域における公共施設や公共物の利用の仕方を調べ，適切な活用を考え，表現すること。
（イ）制度に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 生活に関係の深い制度について理解すること。
㋑ 生活に関係の深い制度について調べ，その活用を考え，表現すること。
ウ 我が国の国土の自然環境と国民生活
（ア）我が国の国土の自然環境と国民生活との関連に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 自然災害から国土を保全し国民生活を守るために国や県などが様々な対策や事業を進めていることを理解すること。
㋑ 国土の環境保全について，自分たちにできることなどを考え，表現すること。
エ 産業と生活
（ア）我が国の工業生産に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国では様々な工業生産が行われていることや，国土には工業の盛んな地域が広がっていること及び工業製品は国民生活の向上に重要な役割を果たしていることを理解すること。
㋑ 工業生産に関わる人々は，消費者の需要や社会の変化に対応し，優れた製品を生産するよう様々な工夫や努力をして，工業生産を支えていることを理解すること。
㋒ 工業の種類，工業の盛んな地域の分布，工業製品の改良などに着目して，工業生産の概要を捉え，工業生産が国民生活に果たす役割を考え，表現すること。
㋓ 製造の工程，工場相互の協力関係，優れた技術などに着目して，工業生産に関わる人々の工夫や努力を捉え，その働きを考え，表現すること。
（イ）我が国の産業と情報との関わりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 大量の情報や情報通信技術の活用は様々な産業を発展させ，国民生活を向上させていることを理解すること。
㋑ 情報の種類，情報の活用の仕方などに着目して，産業における情報活用の現状を捉え，情報を生かして発展する産業が国民生活に果たす役割を考え，表現すること。
オ 我が国の国土の様子と国民生活，歴史
（ア）我が国の国土の様子と国民生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 世界における我が国の国土の位置，国土の構成，領土の範囲などを大まかに理解すること。
㋑ 世界の大陸と主な海洋，主な国の位置，海洋に囲まれ多数の島からなる国土の構成などに着目して，我が国の国土の様子を捉え，その特色を考え，表現すること。
（イ）我が国の歴史上の主な事象に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の歴史上の主な事象を手掛かりに，世の中の様子の変化を理解するとともに，関連する先人の業績，優れた文化遺産を理解すること。
㋑ 世の中の様子，人物の働きや代表的な文化遺産などに着目して，我が国の歴史上の主な事象を捉え，世の中の様子の変化を考え，表現すること。
カ 外国の様子
（ア）グローバル化する世界と日本の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国は，平和な世界の実現のために国際連合の一員として重要な役割を果たしたり，諸外国の発展のために援助や協力を行ったりしていることを理解すること。
㋑ 地球規模で発生している課題の解決に向けた連携・協力などに着目して，国際社会において我が国が果たしている役割を考え，表現すること。"""
                },
                "指導計画の作成と内容の取扱い": """（１）指導計画の作成に当たっては，次の事項に配慮するものとする。
ア 単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，生活に即した具体的で分かりやすい内容を取り上げ，社会的事象の見方・考え方を働かせ，事象の特色や意味などを考え，説明したり表現したりするなど，自ら意欲的に取り組むことのできる活動の充実を図ること。
イ 各教科等との関連を図り，指導の効果を高めるようにするとともに，中学部の社会科の学習との関連を踏まえて，系統的，発展的に指導できるようにすること。
ウ コンピュータや情報通信ネットワークなどを活用して，情報の収集やまとめなどを行うようにすること。
（２）２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア 各学校においては，地域の実態を生かして，生徒が興味・関心をもって学習に取り組めるようにするとともに，観察や見学，聞き取りなどの調査活動を含む具体的な体験を伴う学習を通し，自分の生活と結び付けて考えたことをまとめることで将来の社会生活に生かせるようにすること。
イ ２の内容については，次の事項について配慮するものとする。
（ア）日本国憲法が基本的人権の尊重，国民主権及び平和主義を基本的原則としていることについて触れること。
（イ）情報を適切に調べまとめる技能が身に付くよう，地図帳や地球儀，各種の資料で調べ，まとめる活動を取り入れること。
（ウ）アについては，身近な生活の中でのきまりから日本国憲法まで幅広く取り上げ，秩序ある社会生活を保つためには，それらを遵守することが大切であることに気付くようにするとともに，主体的に社会参加するための基礎的な力を養うこと。
（エ）イについては，選挙などの国民の政治参加の方法や意味についても取り上げること。また，地域の公共施設について，その地域にある意味や，それらの利用がよりよい社会生活を送ることにつながることなどを考えることができるようにすること。
（オ）ウについては，我が国の豊かな自然環境が国民生活に多くの恩恵を与えている一方で，地震災害，津波災害，風水害，火山災害，雪害などの自然災害と，大気の汚染，水質の汚濁などの公害を取り上げ，自然災害や生活環境に関心をもち，日常生活の中で必要な注意事項を考えることにより，環境保全のためには国民一人一人の協力が必要であることに気付くようにすること。
（カ）エの（ア）の「食料生産」，「工業生産」については，食料生産や工業の盛んな地域の具体的事例を通して調べることとし，稲作のほか，野菜，果物，畜産物，水産物などの中から，また，金属工業，機械工業，化学工業，食料品工業などの中から，それぞれ一つを取り上げること。また，消費者や生産者の立場などから多角的に考えて，これからの産業の発展について自分の考えをまとめることができるようにすること。
（キ）２段階のオの（ア）の㋐の「領土の範囲」については，竹島や北方領土，尖閣諸島が我が国の固有の領土であることに触れること。
（ク）カについては，我が国や諸外国には国旗があることを理解し，それを尊重する態度を養うようにすること。
（ケ）社会的事象については，生徒の考えが深まるよう様々な見解を提示するよう配慮し，多様な見解のある事柄，未確定な事柄を取り上げる場合には，有益適切な教材に基づいて指導するとともに，特定の事柄を強調し過ぎたり，一面的な見解を十分な配慮なく取り上げたりするなどの偏った取扱いにより，生徒が多角的に考えたり，事実を客観的に捉え，公正に判断したりすることを妨げることのないよう留意すること。"""
            }
        },
        "数学科": {
                "目標": "数学的な見方・考え方を働かせ，数学的活動を通して，数学的に考える資質・能力を次のとおり育成することを目指す。\n(1) 数量や図形などについての基礎的・基本的な概念や性質などを理解するとともに，日常の事象を数学的に解釈したり，数学的に表現・処理したりする技能を身に付けるようにする。\n(2) 日常の事象を数理的に捉え見通しをもち筋道を立てて考察する力，基礎的・基本的な数量や図形などの性質を見いだし統合的・発展的に考察する力，数学的な表現を用いて事象を簡潔・明瞭・的確に表現したり目的に応じて柔軟に表したりする力を養う。\n(3) 数学的活動の楽しさや数学のよさを実感し，数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学を生活や学習に活用しようとする態度を養う",
                "１段階": {
                    "目標": {
                        "Ａ 数と計算": "ア 整数，小数，分数及び概数の意味と表し方や四則の関係について理解するとともに，整数，小数及び分数の計算についての意味や性質について理解し，それらを計算する技能を身に付けるようにする。\nイ 数の表し方の仕組みや数を構成する単位に着目し，数の比べ方や表し方を統合的に捉えて考察したり，数とその表現や数量の関係に着目し，目的に合った表現方法を用いて計算の仕方を考察したりするとともに，数量の関係を簡潔に，また一般的に表現する力を養う。\nウ 数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさに気付き学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｂ 図形": "ア 図形の形や大きさが決まる要素や立体を構成する要素の位置関係，図形の合同や多角形の性質について理解し，図形を作図したり，三角形，平行四辺形，ひし形，台形の面積を求めたりする技能を身に付けるようにする。\nイ 図形を構成する要素や図形間の関係に着目し，構成の仕方を考察したり，図形の性質を見いだし統合的に考察したりするとともに，三角形，平行四辺形，ひし形の面積の求め方を考え，その表現を振り返り，簡潔かつ的確な表現に高め，公式として導く力を養う。\nウ 図形や数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさに気付き学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｃ 変化と関係": "ア 比例の関係や異種の二つの量の割合として捉えられる数量の比べ方，百分率について理解するとともに，目的に応じてある二つの数量の関係と別の二つの数量とを比べたり，表現したりする方法についての技能を身に付けるようにする。\nイ 伴って変わる二つの数量の関係に着目し，その変化や対応の特徴を表や式を用いて考察したり，異種の二つの量の割合を用いた数量の比べ方を考察したりする力を養う。\nウ 数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさに気付き学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｄ データの活用": "ア データを円グラフや帯グラフで表す表し方や読み取り方，測定した結果を平均する方法について理解するとともに，それらの問題解決における用い方についての技能を身に付けるようにする。\nイ 目的に応じてデータを収集し，データの特徴や傾向に着目して，表やグラフに的確に表現し，それらを用いて問題解決したり，解決の過程や結果を多面的に捉え考察したりする力を養う。\nウ データの活用について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさに気付き学習したことを生活や学習に活用しようとする態度を養う。"
                    },
                    "内容": {
                        "Ａ 数と計算": {
                            "ア 整数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "万の単位を知ること。",
                                    "10 倍，100 倍，1000 倍， 1/10 の大きさの数及びその表し方の理解を深めること。",
                                    "億，兆の単位について知り，十進位取り記数法についての理解を深めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数のまとまりに着目し，大きな数の大きさの比べ方や表し方を統合的に捉えるとともに，それらを日常生活に生かすこと。"
                                ]
                            },
                            "イ 整数及び小数の表し方に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "ある数の 10 倍，100 倍，1000 倍， 1/10 ， 1/100 などの大きさの数を，小数点の位置を移してつくること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数の表し方の仕組みに着目し，数の相対的な大きさを考察し，計算などに有効に生かすこと。"
                                ]
                            },
                            "ウ 概数に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "概数が用いられる場面について知ること。",
                                    "四捨五入について知ること。",
                                    "目的に応じて四則計算の結果の見積りをすること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "日常の事象における場面に着目し，目的に合った数の処理の仕方を考えるとともに，それを日常生活に生かすこと。"
                                ]
                            },
                            "エ 整数の加法及び減法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "大きな数の加法及び減法の計算が，２位数などについての基本的な計算を基にしてできることを理解すること。また，その筆算の仕方について理解すること。",
                                    "加法及び減法の計算が確実にでき，それらを適切に用いること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数量の関係に着目し，計算の仕方を考えたり，計算に関して成り立つ性質を見いだしたりするとともに，その性質を活用して，計算を工夫したり，計算の確かめをしたりすること。"
                                ]
                            },
                            "オ 整数の乗法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "２位数や３位数に１位数や２位数をかける乗法の計算が，乗法九九などの基本的な計算を基にしてできることを理解すること。また，その筆算の仕方について理解すること。",
                                    "乗法の計算が確実にでき，それを適切に用いること。",
                                    "乗法に関して成り立つ性質について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数量の関係に着目し，計算の仕方を考えたり，計算に関して成り立つ性質を見いだしたりするとともに，その性質を活用して，計算を工夫したり，計算の確かめをしたりすること。"
                                ]
                            },
                            "カ 整数の除法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "除数が１位数や２位数で被除数が２位数や３位数の場合の計算が，基本的な計算を基にしてできることを理解すること。また，その筆算の仕方について理解すること。",
                                    "除法の計算が確実にでき，それを適切に用いること。",
                                    "除法について，次の関係を理解すること。\n（被除数）＝（除数）×（商）＋（余り）",
                                    "除法に関して成り立つ性質について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数量の関係に着目し，計算の仕方を考えたり，計算に関して成り立つ性質を見いだしたりするとともに，その性質を活用して，計算を工夫したり，計算の確かめをしたりすること。"
                                ]
                            },
                            "キ 小数とその計算に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "ある量の何倍かを表すのに小数を用いることを知ること。",
                                    "小数が整数と同じ仕組みで表されていることを知るとともに，数の相対的な大きさについての理解を深めること。",
                                    "小数の加法及び減法の意味について理解し，それらの計算ができること。",
                                    "乗数や除数が整数である場合の小数の乗法及び除法の計算ができること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数の表し方の仕組みや数を構成する単位に着目し，計算の仕方を考えるとともに，それを日常生活に生かすこと。"
                                ]
                            },
                            "ク 小数の乗法及び除法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "乗数や除数が小数である場合の小数の乗法及び除法の意味について理解すること。",
                                    "小数の乗法及び除法の計算ができること。",
                                    "余りの大きさについて理解すること。",
                                    "小数の乗法及び除法についても整数の場合と同じ関係や法則が成り立つことを理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "乗法及び除法の意味に着目し，乗数や除数が小数である場合まで数の範囲を広げて乗法及び除法の意味を捉え直すとともに，それらの計算の仕方を考えたり，それらを日常生活に生かしたりすること。"
                                ]
                            },
                            "ケ 分数とその計算に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "等分してできる部分の大きさや端数部分の大きさを表すのに分数を用いることについて理解すること。また，分数の表し方について知ること。",
                                    "分数が単位分数の幾つ分かで表すことができることを知ること。",
                                    "簡単な場合について，分数の加法及び減法の意味について理解し，それらの計算ができることを知ること。",
                                    "簡単な場合について，大きさの等しい分数があることを知ること。",
                                    "同分母の分数の加法及び減法の計算ができること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数のまとまりに着目し，分数でも数の大きさを比べたり，計算したりできるかどうかを考えるとともに，分数を日常生活に生かすこと。",
                                    "数を構成する単位に着目し，大きさの等しい分数を探したり，計算の仕方を考えたりするとともに，それを日常生活に生かすこと。"
                                ]
                            },
                            "コ 数量の関係を表す式に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "四則の混合した式や（ ）を用いた式について理解し，正しく計算すること。",
                                    "公式についての考え方を理解し，公式を用いること。",
                                    "数量を□，△などを用いて表し，その関係を式に表したり，□，△などに数を当てはめて調べたりすること。",
                                    "数量の関係を表す式についての理解を深めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "問題場面の数量の関係に着目し，数量の関係を簡潔に，また一般的に表現したり，式の意味を読み取ったりすること。",
                                    "二つの数量の対応や変わり方に着目し，簡単な式で表されている関係について考察すること。"
                                ]
                            },
                            "サ 計算に関して成り立つ性質に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "四則に関して成り立つ性質についての理解を深めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数量の関係に着目し，計算に関して成り立つ性質を用いて計算の仕方を考えること。"
                                ]
                            }
                        },
                        "Ｂ 図形": {
                            "ア 平面図形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "平行四辺形，ひし形，台形について知ること。",
                                    "図形の形や大きさが決まる要素について理解するとともに，図形の合同について理解すること。",
                                    "三角形や四角形など多角形についての簡単な性質を理解すること。",
                                    "円と関連させて正多角形の基本的な性質を知ること。",
                                    "円周率の意味について理解し，それを用いること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素及びそれらの位置関係に着目し，構成の仕方を考察し図形の性質を見いだすとともに，その性質を基に既習の図形を捉え直すこと。",
                                    "図形を構成する要素及び図形間の関係に着目し，構成の仕方を考察したり，図形の性質を見いだし，その性質を筋道を立てて考え説明したりすること。"
                                ]
                            },
                            "イ 立体図形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "立方体，直方体について知ること。",
                                    "直方体に関連して，直線や平面の平行や垂直の関係について理解すること。",
                                    "見取図，展開図について知ること。",
                                    "基本的な角柱や円柱について知ること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素及びそれらの位置関係に着目し，立体図形の平面上での表現や構成の仕方を考察し，図形の性質を見いだすとともに，日常の事象を図形の性質から捉え直すこと。"
                                ]
                            },
                            "ウ ものの位置に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "ものの位置の表し方について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "平面や空間における位置を決める要素に着目し，その位置を数を用いて表現する方法を考察すること。"
                                ]
                            },
                            "エ 平面図形の面積に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "三角形，平行四辺形，ひし形，台形の面積の計算による求め方について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素などに着目して，基本図形の面積の求め方を見いだすとともに，その表現を振り返り，簡潔かつ的確な表現に高め，公式として導くこと。"
                                ]
                            }
                        },
                        "Ｃ 変化と関係": {
                            "ア 伴って変わる二つの数量に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "簡単な場合について，比例の関係があることを知ること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "伴って変わる二つの数量を見いだして，それらの関係に着目し，表や式を用いて変化や対応の特徴を考察すること。"
                                ]
                            },
                            "イ 異種の二つの量の割合として捉えられる数量に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "速さなど単位量当たりの大きさの意味及び表し方について理解し，それを求めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "異種の二つの量の割合として捉えられる数量の関係に着目し，目的に応じて大きさを比べたり，表現したりする方法を考察し，それらを日常生活に生かすこと。"
                                ]
                            },
                            "ウ 二つの数量の関係に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "ある二つの数量関係と別の二つの数量の関係を比べる場合に割合を用いる場合があることを理解すること。",
                                    "百分率を用いた表し方を理解し，割合などを求めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "日常の事象における数量の関係に着目し，図や式などを用いて，ある二つの数量の関係と別の二つの数量の関係との比べ方を考察し，それを日常生活に生かすこと。"
                                ]
                            }
                        },
                        "Ｄ データの活用": {
                            "ア データの収集とその分析に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "数量の関係を割合で捉え，円グラフや帯グラフで表したり，読んだりすること。",
                                    "円グラフや帯グラフの意味やそれらの用い方を理解すること。",
                                    "データの収集や適切な手法の選択など統計的な問題解決の方法を知ること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "目的に応じてデータを集めて分類整理し，データの特徴や傾向に着目し，問題を解決するために適切なグラフを選択して読み取り，その結論について多面的に捉え考察すること。"
                                ]
                            },
                            "イ 測定した結果を平均する方法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "平均の意味や求め方を理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "概括的に捉えることに着目し，測定した結果を平均する方法について考察し，それを学習や日常生活に生かすこと。"
                                ]
                            }
                        },
                        "〔数学的活動〕": "ア 内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」に示す学習については，次のような数学的活動に取り組むものとする。\n( ｱ ) 日常の事象から数学の問題を見いだして解決し，結果を確かめたり，日常生活等に生かしたりする活動\n( ｲ ) 数学の学習場面から数学の問題を見いだして解決し，結果を確かめたり，発展的に考察したりする活動\n( ｳ ) 問題解決の過程や結果を，図や式などを用いて数学的に表現し伝え合う活動"
                    }
                },
                "２段階": {
                    "目標": {
                        "Ａ 数と計算": "ア 整数の性質，分数の意味，文字を用いた式について理解するとともに，分数の計算についての意味や法則について理解し，それらを計算する技能を身に付けるようにする。\nイ 数とその表現や計算の意味に着目し，発展的に考察して問題を見いだしたり，目的に応じて多様な表現方法を用いながら，数の表し方や計算の仕方などを考察したりするとともに，数量の関係を簡潔かつ一般的に表現する力を養う。\nウ 数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさを実感し，学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｂ 図形": "ア 平面図形を縮小したり，拡大したりすることの意味や，立体図形の体積の求め方について理解し，縮図，拡大図を作図したり，円の面積や立方体，直方体，角柱，円柱の体積を求めたりする技能を身に付けるようにする。\nイ 図形を構成する要素や図形間の関係に着目し，構成の仕方を考察したり，図形の性質を見いだしたりするとともに，円の面積や立方体，直方体，角柱，円柱の体積の求め方を考え，その表現を振り返り，簡潔かつ的確な表現に高め，公式として導く力を養う。\nウ 図形や数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさを実感し，学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｃ 変化と関係": "ア 比例や反比例の関係，比について理解するとともに，伴って変わる二つの数量を見いだし，それらの関係について表や式を用いて表現したり，目的に応じて比で処理したりする方法についての技能を身に付けるようにする。\nイ 伴って変わる二つの数量の関係に着目し，目的に応じて表や式，グラフを用いて変化や対応の特徴を考察したり，比例の関係を前提に二つの数量の関係を考察したりする力を養う。\nウ 数量について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさを実感し，学習したことを生活や学習に活用しようとする態度を養う。",
                        "Ｄ データの活用": "ア 量的データの分布の中心や散らばりの様子からデータの特徴を読み取る方法を理解するとともに，それらを問題解決における用い方についての技能を身に付けるようにする。\nイ 目的に応じてデータを収集し，データの特徴や傾向に着目して，表やグラフに的確に表現し，それらを用いて問題解決したり，解決の過程や結果を批判的に捉え考察したりする力を養う。\nウ データの活用について数学的に表現・処理したことを振り返り，多面的に捉え検討してよりよいものを求めて粘り強く考える態度，数学のよさを実感し，学習したことを生活や学習に活用しようとする態度を養う。"
                    },
                    "内容": {
                        "Ａ 数と計算": {
                            "ア 整数の性質及び整数の構成に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "整数は，観点を決めると偶数と奇数に類別されることを理解すること。",
                                    "約数，倍数について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "乗法及び除法に着目し，観点を決めて整数を類別する仕方を考えたり，数の構成について考察したりするとともに，日常生活に生かすこと。"
                                ]
                            },
                            "イ 分数に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "整数及び小数を分数の形に直したり，分数を小数で表したりすること。",
                                    "整数の除法の結果は，分数を用いると常に一つの数として表すことができることを理解すること。",
                                    "一つの分数の分子及び分母に同じ数を乗除してできる分数は，元の分数と同じ大きさを表すことを理解すること。",
                                    "分数の相等及び大小について知り，大小を比べること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数を構成する単位に着目し，数の相等及び大小関係について考察すること。",
                                    "分数の表現に着目し，除法の結果の表し方を振り返り，分数の意味をまとめること。"
                                ]
                            },
                            "ウ 分数の加法及び減法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "異分母の分数の加法及び減法の計算ができること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "分数の意味や表現に着目し，計算の仕方を考えること。"
                                ]
                            },
                            "エ 分数の乗法及び除法に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "乗数や除数が整数や分数である場合も含めて，分数の乗法及び除法の意味について理解すること。",
                                    "分数の乗法及び除法の計算ができること。",
                                    "分数の乗法及び除法についても，整数の場合と同じ関係や法則が成り立つことを理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "数の意味と表現，計算について成り立つ性質に着目し，計算の仕方を多面的に捉え考えること。"
                                ]
                            },
                            "オ 数量の関係を表す式に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "数量を表す言葉や□，△などの代わりに，a ，x などの文字を用いて式に表したり，文字に数を当てはめて調べたりすること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "問題場面の数量の関係に着目し，数量の関係を簡潔かつ一般的に表現したり，式の意味を読み取ったりすること。"
                                ]
                            }
                        },
                        "Ｂ 図形": {
                            "ア 平面図形に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "縮図や拡大図について理解すること。",
                                    "対称な図形について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素及び図形間の関係に着目し，構成の仕方を考察したり，図形の性質を見いだしたりするとともに，その性質を基に既習の図形を捉え直したり，日常生活に生かしたりすること。"
                                ]
                            },
                            "イ 身の回りにある形の概形やおよその面積などに関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "身の回りにある形について，その概形を捉え，およその面積などを求めること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素や性質に着目し，筋道を立てて面積などの求め方を考え，それを日常生活に生かすこと。"
                                ]
                            },
                            "ウ 平面図形の面積に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "円の面積の計算による求め方について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "図形を構成する要素などに着目し，基本図形の面積の求め方を見いだすとともに，その表現を振り返り，簡潔かつ的確な表現に高め，公式として導くこと。"
                                ]
                            },
                            "エ 立体図形の体積に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "体積の単位（立方センチメートル（㎝3），立方メートル（m3））について理解すること。",
                                    "立方体及び直方体の体積の計算による求め方について理解すること。",
                                    "基本的な角柱及び円柱の体積の計算による求め方について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "体積の単位や図形を構成する要素に着目し，図形の体積の求め方を考えるとともに，体積の単位とこれまでに学習した単位との関係を考察すること。",
                                    "図形を構成する要素に着目し，基本図形の体積の求め方を見いだすとともに，その表現を振り返り，簡潔かつ的確な表現に高め，公式として導くこと。"
                                ]
                            }
                        },
                        "Ｃ 変化と関係": {
                            "ア 伴って変わる二つの数量に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "比例の関係の意味や性質を理解すること。",
                                    "比例の関係を用いた問題解決の方法について理解すること。",
                                    "反比例の関係について理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "伴って変わる二つの数量を見いだして，それらの関係に着目し，目的に応じて表や式，グラフを用いてそれらの関係を表現して，変化や対応の特徴を見いだすとともに，それらを日常生活に生かすこと。"
                                ]
                            },
                            "イ 二つの数量の関係に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "比の意味や表し方を理解し，数量の関係を比で表したり，等しい比をつくったりすること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "日常の事象における数量の関係に着目し，図や式などを用いて数量の関係の比べ方を考察し，それを日常生活に生かすこと。"
                                ]
                            }
                        },
                        "Ｄ データの活用": {
                            "ア データの収集とその分析に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "代表値の意味や求め方を理解すること。",
                                    "度数分布を表す表や柱状グラフの特徴及びそれらの用い方を理解すること。",
                                    "目的に応じてデータを収集したり，適切な手法を選択したりするなど，統計的な問題解決の方法を理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "目的に応じてデータを集めて分類整理し，データの特徴や傾向に着目し，代表値などを用いて問題の結論について判断するとともに，その妥当性について批判的に考察すること。"
                                ]
                            },
                            "イ 起こり得る場合に関わる数学的活動を通して，次の事項を身に付けることができるよう指導する。": {
                                "知識及び技能": [
                                    "起こり得る場合を順序よく整理するための図や表などの用い方を理解すること。"
                                ],
                                "思考力，判断力，表現力等": [
                                    "事象の特徴に着目し，順序よく整理する観点を決めて，落ちや重なりなく調べる方法を考察すること。"
                                ]
                            }
                        },
                        "〔数学的活動〕": "ア 内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」の学習やそれらを相互に関連付けた学習において，次のような数学的活動に取り組むものとする。\n( ｱ ) 日常の事象を数理的に捉え，問題を見いだして解決し，解決過程を振り返り，結果や方法を改善したり，日常生活等に生かしたりする活動\n( ｲ ) 数学の学習場面から数学の問題を見いだして解決し，解決過程を振り返り統合的・発展的に考察する活動\n( ｳ ) 問題解決の過程や結果を，目的に応じて図や式などを用いて数学的に表現し伝え合う活動"
                    }
                },
                "指導計画の作成と内容の取扱い": """(1) 指導計画の作成に当たっては，次の事項に配慮するものとする。\nア 単元など内容や時間のまとまりを見通して，その中で育むべき資質・能力の育成に向けて，数学的活動を通して，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，数学的な見方・考え方を働かせながら，日常の事象を数学的に捉え，数学の問題を見いだし，問題を自立的，協働的に解決し，学習の過程を振り返り，概念を形成するなどの学習の充実を図ること。\nイ 数量や図形についての基礎的な能力の維持や向上を図るため，適宜練習の機会を設けて計画的に指導すること。また，段階間の指導内容を円滑に接続させるため，適切な反復による学習指導を進めるようにすること。\nウ ２の内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」の指導の間の関連を図ること。\n(2) ２の各段階の内容の取扱いについては，次の事項に配慮するものとする。\n① 「ア思考力，判断力，表現力等を育成するため，各段階の内容の指導に当たっては，具体物，図，言葉，数，式，表，グラフなどを用いて考えたり，数学的な表現を用いて説明したり，互いに自分の考えを表現し伝え合ったりするなどの学習活動を積極的に取り入れるようにすること」とは，図，数，式，表，グラフといった数学的な表現の方法について学ぶとともに，それらを活用する指導について工夫することである。\n② 「イ「Ａ数と計算」の指導に当たっては，次の( ｱ )及び( ｲ )について留意するものとする」とは，生徒が行動を通して具体物などの教具や計算機を扱うことによって，また，他教科との関連を図りながら数を取り扱うことによって，考えることの楽しさや大切さに気付くようにしていくということである。\n③ 「ウ１段階の内容に示す事項については，次の( ｱ )から（シ）までに留意するものとする」とは，指導に当たって検討すべき観点のことである。\nなお，「( ｱ )内容の「Ａ数と計算」のア，イ，エ，オ及びカについては，職業科や家庭科との関連を図りながら，次の㋐についての金銭の価値や処理に親しむことを取り扱うものとする」については，他教科との関連を図りながら，生徒の数の理解に配慮し，金銭処理に関する指導を行うようにすることである。例えば，整数の表し方について，４位数までの十進位取り記数法による数の表し方及び数の大小や順序についての理解（中学部２段階）が進んでいる生徒に対して，いろいろな金種を組み合わせて，おつりのある買い物をすることができるよう，値段と代金とおつりとの関係を理解し，深めていくことである。金銭の処理の仕方については，値段にちょうどのお金を用意する場合であれば，値段を示す４位数を理解し，両替の考え方（例えば，千円札を百円硬貨 10 枚，百円硬貨を十円硬貨 10 枚に置き換えること。五百円硬貨や五十円硬貨などを，百円硬貨や十円硬貨５枚に置き換えること）を活用して，同じ価値のお金を，色々な金種を組み合わせて用意することである。また，値段に対して価値が少し大きいお金（例えば，値段が 1,374 円のときの 1,380 円や 1,400 円，1,500 円など，きりのよい代金のこと）を用意することである。\n④ 「エ２段階の内容に示す事項については，次の( ｱ )から( ｵ )までに留意するものとする」とは，指導に当たって検討すべき観点のことである。
(3) 数学的活動の指導に当たっては，次の事項に配慮するものとする。
ア 数学的活動は，基礎的・基本的な知識及び技能を確実に身に付けたり，思考力，判断力，表現力等を高めたり，数学を学ぶことの楽しさや意義を実感したりするために，重要な役割を果たすものであることから，２の内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」に示す事項については，数学的活動を通して指導するようにすること。
イ 数学的活動を楽しめるようにするとともに，数学を生活に活用することなどについて実感する機会を設けること。
① 「ア数学的活動は，基礎的・基本的な知識及び技能を確実に身に付けたり，思考力，判断力，表現力等を高めたり，数学を学ぶことの楽しさを実感したりするために，重要な役割を果たすものであることから，２の内容の「Ａ数と計算」，「Ｂ図形」，「Ｃ変化と関係」及び「Ｄデータの活用」に示す事項については，数学的活動を通して指導するようにすること」とし，各領域に示す全ての事項において，数学的活動を通した指導を行う必要があるということである。
② 「イ数学的活動を楽しめるようにするとともに，数学を生活に活用することなどについて実感する機会を設けること」とは，数学を学ぶことの楽しさや意義を実感できるようにすることであり，生徒が目的意識をもって主体的に取り組む意欲を生活の中に広げていくことである。そのためには，数学的活動を通して，生徒が目的意識をもって主体的に取り組み，数学に関わりのある様々な活動を行う必要があるということである。"""
    }
}
}