data = {
"高等部": {
"知的障害者": {
"国語科": {
"目標": """言葉による見方・考え方を働かせ，言語活動を通して，国語で理解し表現する資質・能力を次のとおり育成することを目指す。
（１）社会生活に必要な国語について，その特質を理解し適切に使うことができるようにする。
（２）社会生活における人との関わりの中で伝え合う力を高め，思考力や想像力を養う。
（３）言葉がもつよさを認識するとともに，言語感覚を養い，国語を大切にしてその能力の向上を図る態度を養う。""",
"１段階": {
"目標": """ア 社会生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しむことができるようにする。
イ 筋道立てて考える力や豊かに感じたり想像したりする力を養い，社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えをまとめることができるようにする。
ウ 言葉がもつよさを認識するとともに，幅広く読書をし，国語を大切にして，思いや考えを伝え合おうとする態度を養う。""",
"内容": """〔知識及び技能〕
ア 言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）社会生活に係る人とのやり取りを通して，言葉には，考えたことや思ったことを表す働きがあることに気付くこと。
（イ）相手を見て話したり聞いたりするとともに，間の取り方などに注意して話すこと。
（ウ）漢字と仮名を用いた表記や送り仮名の付け方を理解して文や文章の中で使うとともに，句読点の使い方を意識して打つこと。
（エ）表現したり理解したりするために必要な語句の量を増し，話や文章の中で使うとともに，言葉には，性質や役割による語句のまとまりがあることを理解すること。
（オ）接続する語句の役割，段落の役割について理解すること。
（カ）日常よく使われる敬語を理解し使うこと。
（キ）文章の構成や内容の大体を意識しながら音読すること。
イ 話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）考えとそれを支える理由や事例，全体と中心など，情報と情報との関係について理解すること。
（イ）比較や分類の仕方，辞書や事典の使い方などを理解し使うこと。
ウ 我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）生活に身近なことわざや慣用句などを知り，使うこと。
（イ）書くことに関する次の事項を取り扱うこと。
㋐ 文字の組み立て方を理解し，形を整えて書くこと。
（ウ）幅広く読書に親しみ，読書が，必要な知識や情報を得ることに役立つことに気付くこと。
〔思考力，判断力，表現力等〕
Ａ 聞くこと・話すこと
聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア 社会の中で関わる人の話などを，話し手が伝えたいことの中心に注意して聞き，話の内容を捉えること。
イ 目的に応じて，話題を決め，集めた材料を比較するなど伝え合うために必要な事柄を選ぶこと。
ウ 話の中心が明確になるよう話の構成を考えること。
エ 相手に伝わるように，言葉の抑揚や強弱，間の取り方などを工夫すること。
オ 目的や進め方を確認し，司会などの役割を果たしながら話し合い，互いの意見の共通点や相違点に着目して，考えをまとめること。
Ｂ 書くこと
書くことに関する次の事項を身に付けることができるよう指導する。
ア 相手や目的を意識して，書くことを決め，集めた材料を比較するなど，伝えたいことを明確にすること。
イ 書く内容の中心を決め，内容のまとまりで段落をつくったり，段落相互の関係に注意したりして，文章の構成を考えること。
ウ 自分の考えとそれを支える理由や事例との関係を明確にして，書き表し方を工夫すること。
エ 間違いを正したり，相手や目的を意識した表現になっているかを確かめたりして，文や文章を整えること。
オ 書こうとしたことが明確になっているかなど，文章に対する感想や意見を伝え合い，自分の文章のよいところを見付けること。
Ｃ 読むこと
読むことに関する次の事項を身に付けることができるよう指導する。
ア 登場人物の行動や心情などについて，叙述を基に捉えること。
イ 段落相互の関係に着目しながら，考えとそれを支える理由や事例との関係などについて，叙述を基に捉えること。
ウ 登場人物の心情や情景について，場面と結び付けて具体的に想像すること。
エ 目的を意識して，中心となる語や文を見付けて要約すること。
オ 文章を読んで理解したことに基づいて，感想や考えをもつこと。"""
},
"２段階": {
"目標": """ア 社会生活に必要な国語の知識や技能を身に付けるとともに，我が国の言語文化に親しんだり理解したりすることができるようにする。
イ 筋道立てて考える力や豊かに感じたり想像したりする力を養い，社会生活における人との関わりの中で伝え合う力を高め，自分の思いや考えを広げることができるようにする。
ウ 言葉がもつよさを認識するとともに，進んで読書をし，国語を大切にして，思いや考えを伝え合おうとする態度を養う。""",
"内容": """〔知識及び技能〕
ア 言葉の特徴や使い方に関する次の事項を身に付けることができるよう指導する。
（ア）社会生活に係る人とのやり取りを通して，言葉には，相手とのつながりをつくる働きがあることに気付くこと。
（イ）話し言葉と書き言葉に違いがあることに気付くこと。
（ウ）文や文章の中で漢字と仮名を使い分けて書くこと。
（エ）表現したり理解したりするために必要な語句の量を増し，話や文章の中で使うとともに，語彙を豊かにすること。
（オ）文と文との接続の関係，話や文章の構成や種類について理解すること。
（カ）日常よく使われる敬語を理解し使い慣れること。
（キ）文章を音読したり，朗読したりすること。
イ 話や文章の中に含まれている情報の扱い方に関する次の事項を身に付けることができるよう指導する。
（ア）原因と結果など，情報と情報との関係について理解すること。
（イ）情報と情報との関係付けの仕方を理解し使うこと。
ウ 我が国の言語文化に関する次の事項を身に付けることができるよう指導する。
（ア）親しみやすい古文などの文章を音読するなどして，言葉の響きやリズムに親しむこと。
（イ）生活の中で使われる慣用句，故事成語などの意味を知り，使うこと。
（ウ）書くことに関する次の事項を取り扱うこと。
㋐ 用紙全体との関係に注意して，文字の大きさや配列などを決めて書くこと。
㋑ 目的に応じて使用する筆記具を選び，その特徴を生かして書くこと。
（エ）日常的に読書に親しみ，読書が，自分の考えを広げることに役立つことに気付くこと。
〔思考力，判断力，表現力等〕
Ａ 聞くこと・話すこと
聞くこと・話すことに関する次の事項を身に付けることができるよう指導する。
ア 社会の中で関わる人の話などについて，話し手の目的や自分が聞きたいことの中心を捉え，その内容を捉えること。
イ 目的や意図に応じて，話題を決め，集めた材料を比較したり分類したりして，伝え合う内容を検討すること。
ウ 話の内容が明確になるように，話の構成を考えること。
エ 資料を活用するなどして，自分の考えが伝わるように表現を工夫すること。
オ 互いの立場や意図を明確にしながら，計画的に話し合い，考えを広げたりまとめたりすること。
Ｂ 書くこと
書くことに関する次の事項を身に付けることができるよう指導する。
ア 目的や意図に応じて，書くことを決め，集めた材料を比較したり分類したりして，伝えたいことを明確にすること。
イ 筋道の通った文章となるように，文章全体の構成を考えること。
ウ 目的や意図に応じて簡単に書いたり詳しく書いたりするとともに，事実と感想，意見とを区別して書いたりするなど，自分の考えが伝わるように書き表し方を工夫すること。
エ 引用したり，図表やグラフなどを用いたりして，自分の考えが伝わるように書き表し方を工夫すること。
オ 文章全体の構成や書き表し方などに着目して，文や文章を整えること。
カ 文章全体の構成が明確になっているかなど，文章に対する感想や意見を伝え合い，自分の文章のよいところを見付けること。
Ｃ 読むこと
読むことに関する次の事項を身に付けることができるよう指導する。
ア 登場人物の相互関係や心情などについて，描写を基に捉えること。
イ 事実と感想，意見などとの関係を叙述を基に押さえ，文章全体の構成を捉えて要旨を把握すること。
ウ 人物像を具体的に想像したり，表現の効果を考えたりすること。
エ 目的を意識して，文章と図表などを結び付けるなどして，必要な情報を見付けること。
オ 文章を読んで理解したことに基づいて，自分の考えをまとめること。"""
},
"指導計画の作成と内容の取扱い": """（１）指導計画の作成に当たっては，次の事項に配慮するものとする。
ア 単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，言葉による見方・考え方を働かせ，言語活動を通して，言葉の特徴や使い方などを理解し自分の思いや考えを深める学習の充実を図ること。
イ ２の各段階の内容の〔知識及び技能〕に示す事項については，〔思考力，判断力，表現力等〕に示す事項の指導を通して指導することを基本とすること。
ウ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ａ聞くこと・話すこと」に関する指導については，高等部卒業後の生活に必要な話し言葉を身に付け，活用できるよう指導すること。
エ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｂ書くこと」に関する指導については，筆記具を用いる技能の指導に偏ることなく，文章を書く場面を設けるよう工夫すること。
オ ２の各段階の内容の〔思考力，判断力，表現力等〕の「Ｃ読むこと」に関する指導については，発達の段階に応じた様々な文章に接し，日常生活において読書活動を活発に行うようにするとともに，他教科等における読書の指導や学校図書館等における指導との関連を図るようにすること。"""
},
"社会科": {
"目標": """社会的な見方・考え方を働かせ，社会的事象について関心をもち，具体的に考察する活動を通して，グローバル化する国際社会に主体的に生きる平和で民主的な国家及び社会の形成者に必要な公民としての資質・能力の基礎を次のとおり育成することを目指す。
（１）地域や我が国の国土の地理的環境，現代社会の仕組みや働き，地域や我が国の歴史や伝統と文化及び外国の様子について，様々な資料や具体的な活動を通して理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
（２）社会的事象の特色や相互の関連，意味を多角的に考えたり，自分の生活と結び付けて考えたり，社会への関わり方を選択・判断したりする力，考えたことや選択・判断したことを適切に表現する力を養う。
（３）社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土と歴史に対する愛情，我が国の将来を担う国民としての自覚，世界の国々の人々と共に生きていくことの大切さについての自覚などを養う。""",
"１段階": {
"目標": """学習の問題を追究・解決する活動を通して，次のとおり資質・能力を育成することを目指す。
ア 我が国の国土の様子と国民生活，自然環境の特色，先人の業績や優れた文化遺産，社会参加するためのきまり，公共施設の役割と制度，農業や水産業の現状，産業と経済との関わり，外国の様子について，様々な資料や具体的な活動を通して，社会生活との関連を踏まえて理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
イ 社会的事象の特色や相互の関連，意味を多角的に考える力，自分の生活と結び付けて考える力，社会への関わり方を選択・判断する力，考えたことや選択・判断したことを表現する力を養う。
ウ 社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土に対する愛情，我が国の歴史や伝統を大切にして国を愛する心情，我が国の産業の発展を願い我が国の将来を担う国民としての自覚や平和を願う日本人として世界の国々の人々と共に生きることの大切さについての自覚を養う。""",
"内容": """ア 社会参加ときまり
（ア）社会参加するために必要な社会生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 地域の人々と互いに協力することの大切さを理解し，自分の役割や責任を果たすための知識や技能を身に付けること。
㋑ 社会生活の中で状況を的確に判断し，自分の役割と責任について考え，表現すること。
（イ）社会生活を営む上で大切な法やきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会生活を営む上で大切な法やきまりがあることを理解すること。
㋑ 社会生活を営む上で大切な法やきまりの意義と自分との関わりについて考え，表現すること。
イ 公共施設の役割と制度
（ア）公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 生活に関係の深い公共施設や公共物の役割とその必要性を理解すること。
㋑ 生活に関係の深い公共施設や公共物の利用の仕方を調べ，適切な活用を考え，表現すること。
（イ）制度に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の政治の基本的な仕組みや働きについて理解すること。
㋑ 国や地方公共団体の政治の取組について調べ，国民生活における政治の働きを考え，表現すること。
ウ 我が国の国土の自然環境と国民生活
（ア）我が国の国土の自然環境と国民生活との関連に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 自然災害は国土の自然条件などと関連して発生していることや，自然災害が国土と国民生活に影響を及ぼすことを理解すること。
㋑ 関係機関や地域の人々の様々な努力により公害の防止や生活環境の改善が図られてきたことを理解するとともに，公害が国土の環境や国民の生活に影響を及ぼすことを理解すること。
㋒ 災害の種類や発生の位置や時期，防災対策などに着目して，国土の自然災害の状況を捉え，自然条件との関連を考え，表現すること。
㋓ 公害の発生時期や経過，人々の協力や努力などに着目して，公害防止の取組を捉え，その働きを考え，表現すること。
エ 産業と生活
（ア）我が国の農業や水産業における食料生産に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の食料生産は，自然条件を生かして営まれていることや，国民の食料を確保する重要な役割を果たしていることを理解すること。
㋑ 食料生産に関わる人々は，生産性や品質を高めるよう努力したり輸送方法や販売方法を工夫したりして，良質な食料を消費地に届けるなど，食料生産を支えていることを理解すること。
㋒ 生産物の種類や分布，生産量の変化などに着目して，食料生産の概要を捉え，食料生産が国民生活に果たす役割を考え，表現すること。
㋓ 生産の工程，人々の協力関係，技術の向上，輸送，価格や費用などに関心をもって，食料生産に関わる人々の工夫や努力を捉え，その働きを考え，表現すること。
オ 我が国の国土の様子と国民生活，歴史
（ア）我が国の国土の様子と国民生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の国土の地形や気候の概要を理解するとともに，人々は自然環境に適応して生活していることを理解すること。
㋑ 地形や気候などに着目して，国土の自然などの様子や自然条件から見て特色ある地域の人々の生活を捉え，国土の自然環境の特色やそれらと国民生活との関連を考え，表現すること。
（イ）我が国の歴史上の主な事象に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の歴史上の主な事象を手掛かりに，関連する先人の業績，優れた文化遺産などを理解すること。
㋑ 世の中の様子，人物の働きや代表的な文化遺産などに着目して，我が国の歴史上の主な事象を捉え，世の中の様子の変化を考え，表現すること。
カ 外国の様子
（ア）グローバル化する世界と日本の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 異なる文化や習慣を尊重し合うことが大切であることを理解すること。
㋑ 外国の人々の生活の様子などに着目して，日本の文化や習慣との違いについて考え，表現すること。"""
},
"２段階": {
"目標": """学習の問題を追究・解決する活動を通して，次のとおり資質・能力を育成することを目指す。
ア 我が国の国土の様子と国民生活，自然環境の特色，先人の業績や優れた文化遺産，社会参加するためのきまり，公共施設の役割と制度，工業の現状，産業と情報との関わり，外国の様子について，様々な資料や具体的な活動を通して，社会生活との関連を踏まえて理解するとともに，情報を適切に調べまとめる技能を身に付けるようにする。
イ 社会的事象の特色や相互の関連，意味を多角的に考える力，自分の生活と結び付けて考える力，社会への関わり方を選択・判断する力，考えたことや選択・判断したことを適切に表現する力を養う。
ウ 社会に主体的に関わろうとする態度や，よりよい社会を考え学習したことを社会生活に生かそうとする態度を養うとともに，多角的な思考や理解を通して，地域社会に対する誇りと愛情，地域社会の一員としての自覚，我が国の国土に対する愛情，我が国の歴史や伝統を大切にして国を愛する心情，我が国の産業の発展を願い我が国の将来を担う国民としての自覚や平和を願う日本人として世界の国々の人々と共に生きることの大切さについての自覚を養う。""",
"内容": """ア 社会参加ときまり
（ア）社会参加するために必要な社会生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会の中で互いに協力しながら，社会生活に必要な知識や技能を身に付けること。
㋑ 社会生活の中で状況を的確に判断し，国民としての権利及び義務，それに伴う責任について考え，表現すること。
（イ）社会生活を営む上で大切な法やきまりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 社会の慣習，生活に関係の深い法やきまりを理解すること。
㋑ 社会の慣習，生活に関係の深い法やきまりの意義と自分との関わりについて考え，表現すること。
イ 公共施設の役割と制度
（ア）公共施設の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 地域における公共施設や公共物の役割とその必要性を理解すること。
㋑ 地域における公共施設や公共物の利用の仕方を調べ，適切な活用を考え，表現すること。
（イ）制度に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 生活に関係の深い制度について理解すること。
㋑ 生活に関係の深い制度について調べ，その活用を考え，表現すること。
ウ 我が国の国土の自然環境と国民生活
（ア）我が国の国土の自然環境と国民生活との関連に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 自然災害から国土を保全し国民生活を守るために国や県などが様々な対策や事業を進めていることを理解すること。
㋑ 国土の環境保全について，自分たちにできることなどを考え，表現すること。
エ 産業と生活
（ア）我が国の工業生産に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国では様々な工業生産が行われていることや，国土には工業の盛んな地域が広がっていること及び工業製品は国民生活の向上に重要な役割を果たしていることを理解すること。
㋑ 工業生産に関わる人々は，消費者の需要や社会の変化に対応し，優れた製品を生産するよう様々な工夫や努力をして，工業生産を支えていることを理解すること。
㋒ 工業の種類，工業の盛んな地域の分布，工業製品の改良などに着目して，工業生産の概要を捉え，工業生産が国民生活に果たす役割を考え，表現すること。
㋓ 製造の工程，工場相互の協力関係，優れた技術などに着目して，工業生産に関わる人々の工夫や努力を捉え，その働きを考え，表現すること。
（イ）我が国の産業と情報との関わりに関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 大量の情報や情報通信技術の活用は様々な産業を発展させ，国民生活を向上させていることを理解すること。
㋑ 情報の種類，情報の活用の仕方などに着目して，産業における情報活用の現状を捉え，情報を生かして発展する産業が国民生活に果たす役割を考え，表現すること。
オ 我が国の国土の様子と国民生活，歴史
（ア）我が国の国土の様子と国民生活に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 世界における我が国の国土の位置，国土の構成，領土の範囲などを大まかに理解すること。
㋑ 世界の大陸と主な海洋，主な国の位置，海洋に囲まれ多数の島からなる国土の構成などに着目して，我が国の国土の様子を捉え，その特色を考え，表現すること。
（イ）我が国の歴史上の主な事象に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国の歴史上の主な事象を手掛かりに，世の中の様子の変化を理解するとともに，関連する先人の業績，優れた文化遺産を理解すること。
㋑ 世の中の様子，人物の働きや代表的な文化遺産などに着目して，我が国の歴史上の主な事象を捉え，世の中の様子の変化を考え，表現すること。
カ 外国の様子
（ア）グローバル化する世界と日本の役割に関わる学習活動を通して，次の事項を身に付けることができるよう指導する。
㋐ 我が国は，平和な世界の実現のために国際連合の一員として重要な役割を果たしたり，諸外国の発展のために援助や協力を行ったりしていることを理解すること。
㋑ 地球規模で発生している課題の解決に向けた連携・協力などに着目して，国際社会において我が国が果たしている役割を考え，表現すること。"""
},
"指導計画の作成と内容の取扱い": """（１）指導計画の作成に当たっては，次の事項に配慮するものとする。
ア 単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒の主体的・対話的で深い学びの実現を図るようにすること。その際，生活に即した具体的で分かりやすい内容を取り上げ，社会的事象の見方・考え方を働かせ，事象の特色や意味などを考え，説明したり表現したりするなど，自ら意欲的に取り組むことのできる活動の充実を図ること。
イ 各教科等との関連を図り，指導の効果を高めるようにするとともに，中学部の社会科の学習との関連を踏まえて，系統的，発展的に指導できるようにすること。
ウ コンピュータや情報通信ネットワークなどを活用して，情報の収集やまとめなどを行うようにすること。
（２）２の各段階の内容の取扱いについては，次の事項に配慮するものとする。
ア 各学校においては，地域の実態を生かして，生徒が興味・関心をもって学習に取り組めるようにするとともに，観察や見学，聞き取りなどの調査活動を含む具体的な体験を伴う学習を通し，自分の生活と結び付けて考えたことをまとめることで将来の社会生活に生かせるようにすること。
イ ２の内容については，次の事項について配慮するものとする。
（ア）日本国憲法が基本的人権の尊重，国民主権及び平和主義を基本的原則としていることについて触れること。
（イ）情報を適切に調べまとめる技能が身に付くよう，地図帳や地球儀，各種の資料で調べ，まとめる活動を取り入れること。
（ウ）アについては，身近な生活の中でのきまりから日本国憲法まで幅広く取り上げ，秩序ある社会生活を保つためには，それらを遵守することが大切であることに気付くようにするとともに，主体的に社会参加するための基礎的な力を養うこと。
（エ）イについては，選挙などの国民の政治参加の方法や意味についても取り上げること。また，地域の公共施設について，その地域にある意味や，それらの利用がよりよい社会生活を送ることにつながることなどを考えることができるようにすること。
（オ）ウについては，我が国の豊かな自然環境が国民生活に多くの恩恵を与えている一方で，地震災害，津波災害，風水害，火山災害，雪害などの自然災害と，大気の汚染，水質の汚濁などの公害を取り上げ，自然災害や生活環境に関心をもち，日常生活の中で必要な注意事項を考えることにより，環境保全のためには国民一人一人の協力が必要であることに気付くようにすること。
（カ）エの（ア）の「食料生産」，「工業生産」については，食料生産や工業の盛んな地域の具体的事例を通して調べることとし，稲作のほか，野菜，果物，畜産物，水産物などの中から，また，金属工業，機械工業，化学工業，食料品工業などの中から，それぞれ一つを取り上げること。また，消費者や生産者の立場などから多角的に考えて，これからの産業の発展について自分の考えをまとめることができるようにすること。
（キ）２段階のオの（ア）の㋐の「領土の範囲」については，竹島や北方領土，尖閣諸島が我が国の固有の領土であることに触れること。
（ク）カについては，我が国や諸外国には国旗があることを理解し，それを尊重する態度を養うようにすること。
（ケ）社会的事象については，生徒の考えが深まるよう様々な見解を提示するよう配慮し，多様な見解のある事柄，未確定な事柄を取り上げる場合には，有益適切な教材に基づいて指導するとともに，特定の事柄を強調し過ぎたり，一面的な見解を十分な配慮なく取り上げたりするなどの偏った取扱いにより，生徒が多角的に考えたり，事実を客観的に捉え，公正に判断したりすることを妨げることのないよう留意すること。"""
}
}
}
}